[
  {
    "id": "9dce986a-1560-47b7-b7dd-2f9f38a2ee73",
    "source": "slack",
    "text": "*\nSession was to cover:\n• Access to Cloud instance (pending access from last meeting). We would be working on the Dev instance.\n• They want to create CC based forms - discussed if they want to have standalone forms - or Unified Authoring. These forms are included in 2-3 pages, so standalone forms may be useful.\n• AEP configuration - Need clarity on the existing structure to which forms are to be submitted - currently on Dev it is blank/empty. - <@U0213T59LMN> could you add more details/info which we need from customer.\n• They do not have OOTB collateral (CC templates/themes). Created a template for blank CC form. <@U05TSNKRNP8> to validate the setup - if we are able to create the form now.\n*Action items from last session:*\n• _Requirements Documentation: Write and share a document listing the requirements and scope for the forms, including details such as submission destination and potential reuse across pages. (Jennifer Rogers, David Lopez)_ =&gt; *They mentioned that it is a simple flow with data submitted to RTCDP - with no prefill.*\n• _Access Provisioning: Add Vijay Kumar and Sudhanshu to the AEM dev environment with appropriate admin access profiles to enable configuration and setup activities. (David Lopez)_ =&gt; *Required access provided to Mayank, Harman, Sudhanshu*\n• _Pipeline Impact Confirmation:_ _Follow up with Paul to confirm whether running the dev pipeline will have any unintended impact on the current environment or recent releases. (Jennifer Rogers)_ =&gt; *They mentioned that we can use Dev - <@U0213T59LMN> could you help track/get confirmation on this in next call (maybe reviewing the Github repos for the environments would help - if they are connected)*\n• Slack Channel Setup: Create a new Slack channel dedicated to the forms engagement and invite all relevant team members for ongoing collaboration. (Vijay Kumar, Arun) =&gt; *Channel created - Slack channel created in Adobe Enterprise Support: #aemcs-brightline-forms*\n• *Weekly Meeting Coordination:* Coordinate and finalize a weekly meeting time that accommodates both the East Coast and India-based team members, ideally between 7:00 AM and 10:00 AM Pacific. (Vince, Arun) =&gt; *Second meeting was scheduled - so assuming this is done. <@U0213T59LMN> / <@W5HEU5M7Y> could you help confirm if we have a weekly scheduled meeting now.*\n\n:todo_done: *",
    "created_at": "2026-01-30T06:10:55.197Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757475672.747859"
  },
  {
    "id": "f0932428-fc19-4130-ab4c-2344cbd19661",
    "source": "slack",
    "text": "*\n• Heather mentioned that she would check with the concerned team on the $ value impact - based on what Varun had proposed.\n• Varun shared that we have similar opp. in other locale - where CTA placement would help - but due to current threshold - it is not automatically included in ASO UI.\n• Heather mentioned that they plan to incorporate similar approach for other locale - but it would help if we could create similar opportunity for other locale (with lower threshold). She also mentioned that it would help if we could provide more opportunities with other forms - with lower threshold to evaluate.\ncc: <@WLWHN4TV3> <@U02RMEY3D1C> <@W4RSW3ECC> <@W5HEU5M7Y>\n:todo_done: *",
    "created_at": "2026-01-30T06:10:53.686Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757477619.996589"
  },
  {
    "id": "8e75ece8-2148-4e5b-8189-7d609eb9b969",
    "source": "slack",
    "text": "*\n• *Access Issues in Mercury Marine Environments:* Mayank, Andy, and others discussed ongoing access limitations in the Mercury Marine QA and stage environments, with Christy and Sarah assisting in troubleshooting and planning to adjust permissions to enable form creation and configuration.\n• *Pipeline Execution and Core Component Deployment:* Rahul Kumar, Christy, Arun, and Andy discussed the need to rerun the Cloud Manager pipeline in the QA environment to ensure that core components and templates are properly deployed, with Christy initiating the pipeline run and the team agreeing to verify results after completion.\n• *Coordination of Communication Channels:* Arun and Andy clarified the use of communication channels, confirming that a Slack channel or Teams chat would be used for ongoing updates and coordination regarding environment access and pipeline status.\n• *Planning for Next Steps and Form Walkthrough:* Andy and Mayank agreed to plan a walkthrough of the first form creation on the next call, contingent on successful access and pipeline deployment, with the team aligning on the QA environment for development.\n:todo_done: *",
    "created_at": "2026-01-30T06:10:52.178Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757482762.169779"
  },
  {
    "id": "d700d568-b348-48c7-b480-3d81c70d8f40",
    "source": "slack",
    "text": "*\nHad a connect with Terry Mah for a new Forms opportunity\n• PWC (Chicago) wants to leverage Forms for their Audit process - worldwide with ~ 100K users\n• Render the form in headless mode in their .Net # application\n• Pre-sales opp. - started last week - probably - CS + OnPrem for China\nKey requirements:\n• Store the form definition in a separate store\n• Have a *list of fragments* (currently we do not have an API for this) - managed with an existing *React Application which has fragment search based on tags* (similar to JPMC use-case - <@W4R5LUPK3>)\n• Support for *versioning* and *locking* - where a workflow is used for *review* and unlocks the fragments for specific authors\n• Submission is to a DB (Terry mentioned that he did not expect complexity here)\n• Currently forms are defined in Excel - which is not an easy interface. They have their own React application based authoring interface - but our UE/CC editor has those capabilities.\n• Needs a custom composite component where we have form elements inside a checkbox group (a similar requirement came from UBS in past).\n• Runtime is a .Net application where the form is to be rendered based on JSON stored in their store.\n• multilingual forms/translation requirements (supported in headless)\nThey have an aggressive timeline - with 110 content fragments to be migrated in 3 months\n\nRishi shared:\n• Recent demo done for HomeDepot - will be sharing the sandbox with Terry\n• Code Sandbox to play around with the React rendition of forms\n:todo_done: *",
    "created_at": "2026-01-30T06:10:50.666Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757565593.840499"
  },
  {
    "id": "d59e1bc6-7cd1-4dd3-8a1a-736ac143b7b2",
    "source": "slack",
    "text": "*\nGo-live was scheduled for 10th September. On 5th September, a fragment localization issue was reported, which blocked the release. The issue was resolved, and a private release was patched to their environment on 10th September as promised\n\nMore details here, <https://dmasupport.slack.com/archives/C05UWBPNSTF/p1757059211088049>\n:todo_done: *",
    "created_at": "2026-01-30T06:10:49.151Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757581283.710269"
  },
  {
    "id": "a2ca1131-cc4e-4b03-8f5a-ead17d10e286",
    "source": "slack",
    "text": "*\n• *Custom Indexing*: Engineering discovered that a custom Lucene index was overriding the default, leading to inefficient queries. Renaming and copying standard rules improved performance. These changes are being tested in QA and will be rolled out to production.\n• *401 Authentication Errors*: Engineering observed inconsistent token errors across environments. Errors seem reduced after indexing updates, but monitoring continues with Adobe support involved.\n• *PDF Form Conversion*: Engineering explained that XFA-based PDFs aren’t supported. Conversion to XDP is required, though some PDFs fail conversion. An Acrobat Pro license is requested to allow direct edits when conversion isn’t possible.\n• *Data Binding &amp; Validation*: Engineering identified a misconfigured property causing validation failures. Emphasis placed on correct field naming and binding consistency. Fixes are underway.\n• *Testing automation*: Engineering provided the recordings for the automation tool for customers to review.\n:todo_done: *",
    "created_at": "2026-01-30T06:10:47.640Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757655068.314749"
  },
  {
    "id": "ae08f6cd-c8be-490c-9dec-e41848d3dcce",
    "source": "slack",
    "text": "*\n• *Pipeline Verification and Dependency Troubleshooting:* Mayank, Christy Bastian, Andy Kluck, and Shraddha collaborated to verify the deployment pipeline, check component versions, and troubleshoot missing dependencies in the QA environment, ensuring the correct setup before proceeding with form creation.\n• *Template and Form Creation in AEM:* Mayank guided Christy Bastian and Andy Kluck through the process of creating templates and adaptive forms in AEM, demonstrating template creation, enabling, and usage for form authors, and confirming successful visibility and access.\n• *Marketo Engage Cloud Configuration Setup:* Andy Kluck, Christy Bastian, and the team worked together to locate, create, and authenticate the Marketo Engage cloud configuration in the Mercury Marine folder, ensuring the connection was established and visible in the environment.\n• *Adaptive Form Building and Data Mapping:* Mayank, Andy Kluck, and Shraddha demonstrated the process of building adaptive forms using the Marketo Engage schema, mapping required fields, configuring validation, and utilizing the rule editor for conditional logic.\n• *Theme and Styling Challenges for Mercury Forms:* Andy Kluck raised concerns about the absence of Mercury-specific themes in QA, and Mayank and the team discussed options for creating or copying themes, embedding forms, and aligning form styling with the Mercury website.\n• *Layout Customization and Editor Usability:* Andy Kluck and the team explored the adaptive form editor's layout features, attempting to create two-column layouts and adjust field spans, while troubleshooting usability challenges and planning follow-up actions.\n:todo_done: *",
    "created_at": "2026-01-30T06:10:46.131Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757655365.946789"
  },
  {
    "id": "a7bcc428-5d44-4da2-9be4-13e3daad595a",
    "source": "slack",
    "text": "*\n• Accessibility Issue related to value not being tagged in accessibility tag tree for bottom caption was discussed.  It was fixed in SP23 . They tested it on SP22 document generation service. We have suggested them to test it on SP23.\n• Wells Fargo also reported a regression where path objects are visible in the content tree in Acrobat for checkboxes boundaries, which they believe was fixed in SP19. Support will open a Jira ticket to verify whether this issue can be reproduced internally.\n:todo_done: *",
    "created_at": "2026-01-30T06:10:44.620Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757947265.975139"
  },
  {
    "id": "70a18404-f1bc-4456-97ab-fed4337d2790",
    "source": "slack",
    "text": "*\n*Lead Gen Form Variant*: Suggested adding another variant with a hyperlink in the header bar. Team mentioned it’s not critical right now, but added to the backlog.\n*Conversion Rate*: First-order form (lead gen) conversion remains steady at ~24–25%.\n*Wilson Results (Aug 14–27 vs. previous period)*:\n• Lead signups ↑ *163%* (2.5K → 6.6K)\n• Revenue from lead gen ↑ *156%* ($110K → $284K)\n• Contribution to total site revenue ↑ from *~5%* → *~9%*\n\n:todo_done: *",
    "created_at": "2026-01-30T06:10:43.111Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758084265.873279"
  },
  {
    "id": "4ec4c2ac-85d9-4dc6-a460-706ed80330e1",
    "source": "slack",
    "text": "*\n• *Newsletter Subscription Form Optimization Opportunity:* Rahul Kumar presented a new Site Optimizer opportunity related to the newsletter subscription form, explaining the low conversion rates and suggesting two variants for improvement, while Clare and Paul inquired about value calculation and exportability for testing.\n    ◦ *Opportunity Identification:* Rahul Kumar detailed the analysis of the newsletter subscription form, noting that out of 134,000 page views in 60 days, only 25,000 users reached the form and just 100 interacted with it, indicating a low conversion rate.\n    ◦ *Suggested Variants:* Rahul Kumar described two system-generated suggestions: moving the form’s call-to-action (CTA) to the top of the page (above the fold) or implementing a sticky widget on the side, aiming to increase visibility and lead conversions.\n    ◦ *Value Calculation Methodology:* Clare asked about the value assigned to the opportunity, and Rahul Kumar explained that the annual value is calculated using CPA values, traffic estimates, and projected increases in conversions, with the ability to adjust the lead value as needed.\n    ◦ *Export and Testing Capabilities:* Clare inquired about exporting the suggested variants to Adobe Target for AB testing. Rahul Kumar clarified that direct export is not currently available, but Hyman outlined the roadmap to enable integration with Experience Manager and, eventually, Adobe Target for experimentation.\n*Follow-up tasks:*\n• *Extrapolated Metrics Transparency:* Add detailed explanations in reporting to clarify how extrapolated metrics and business case values (e.g., value assigned to newsletter signups) are calculated, including the underlying metrics and time periods. (Rahul Kumar, Hyman)\n\n:todo_done: *",
    "created_at": "2026-01-30T06:10:41.603Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758134396.335239"
  },
  {
    "id": "b263006d-9a0b-457d-a676-e160a73b22b2",
    "source": "slack",
    "text": "*\n• *Introduction:* Michael, Simon Habtu, Emily, John, and Dallas discussed the integration of AEM forms on <http://ups.com|ups.com>. The meeting aimed to explore the best ways to leverage AEM forms, compare them with Marketo forms, and understand the backend connections required for implementation. \n• *AEM Forms vs Marketo Forms:* Michael and Emily clarified that <http://ups.com|ups.com> should move 100% to AEM forms, reserving Marketo forms for Marketo pages. Simon Habtu explained the option of using Marketo for backend connections to Salesforce, but the focus remained on AEM forms. \n• *Forms Creation and Integration:* Meghali, the technical consultant, demonstrated the process of creating forms on EDS, including the use of Universal Editor and Forms Experience Builder. The session covered the core features, rapid form generation, and publishing forms on EDS. \n• *Themes and Customisation:* Dallas inquired about creating themes for different business requirements. Meghali and Manu explained the process of creating and integrating themes within the EDS environment, highlighting the flexibility and customisation options available. \n• *API Integration and Data Storage:* Dallas raised concerns about storing data and the best practices for API calls. Vijay Kumar explained the support for API integration, including the use of API integration tools and the importance of configuring client credentials for authentication. \n• *Forms Experience Builder:* Vijay Kumar showcased the Forms Experience Builder, demonstrating its AI-based capabilities for creating forms from screenshots and updating fields. The tool aims to speed up form authoring and enhance user experience.\n• *Next Steps and Follow-Up:* Simon Habtu and Michael discussed the next steps, including enabling API integration in the dev environment and setting up a follow-up call to discuss the scale of form creation activities. The team also considered the possibility of participating in the VIP program for forms. \n\n:todo_done: *",
    "created_at": "2026-01-30T06:10:40.061Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758169848.391489"
  },
  {
    "id": "b4a42897-4be2-425c-9e01-38dc9d325f8f",
    "source": "slack",
    "text": "*\n• *Marketo Integration and Hidden Field Mapping:* Andy and Mayank discussed the process of mapping hidden fields from AEM forms to Marketo, including the use of assignment rules based on operating units and the need for logic to populate these fields according to website region, with input from Christy and future planning for additional regions.\n• *Custom Object Field Handling Between Salesforce and Marketo:* Andy, Mayank, and Sarah clarified the handling of custom object fields originating from Salesforce, discussing the need to link custom objects to the lead object for visibility in AEM forms and outlining a workaround for mapping fields such as form name and UTM parameters.\n• *AEM Form Styling and Theme Management:* Christy, Devendra, Mayank, Jonathan, and Heidi discussed the process for managing AEM form themes, including the relevance of reference theme packages, the use of core components, and strategies for aligning form styling with site branding.\n• *UTM Parameter Handling and Pre-Release Feature Enablement:* Mayank, Andy, Christy, and others discussed the process for enabling UTM parameter handling in AEM forms, including the need to activate pre-release features in the environment and the steps required for deployment and testing.\n• *Translation Options for AEM Forms:* Sarah, Christy, Mayank, Heidi, and Jonathan discussed translation strategies for AEM forms, covering both machine and human translation options, integration with existing web translation workflows, and the use of Accolade for content translation.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:43.972Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758173463.940209"
  },
  {
    "id": "f61e487f-eb5d-40d0-98e5-7f8efea36b60",
    "source": "slack",
    "text": "*\n• *Custom Indexing*: Customer confirmed previous indexing issue resolved by creating a custom Lucene index. Unique index names don’t override OOTB, but similar names do. File deletion tests validated improved performance. Uncertainty remains about safe index removal.\n• *Forms Experience Builder Conversion*: Customer demonstrated metadata not updating when replacing PDFs in place. Workaround requires uploading into a new folder, which resets metadata. Builder provided field binding sometimes fails to map duplicates correctly. September batch includes 10–20 forms pending conversion.\n• *Signature Field Deletion*: Engineering showed prompt-based deletion of signature fields works. Prompts can be refined to better target specific fields.\n• *JWT Authentication Issue*: Customer reported 401 errors on first servlet call using JWT tokens, with success on retry. Adobe is assisting with troubleshooting via enhanced logging. Current workaround uses retries, but a permanent fix is needed. Issue escalated beyond P2 due to performance testing delays.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:42.467Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758260710.918079"
  },
  {
    "id": "46ba93be-c931-48da-8f24-d2434f997a84",
    "source": "slack",
    "text": "*\n• *Capturing ECID, FBCLID, and GCLID in Marketo Forms:* Andy Kluck, Mayank, Arun, and others discussed the technical process and challenges of capturing ECID, FBCLID, and GCLID values in Marketo forms, including the current setup, data sources, and the need for further investigation and possible custom functions.\n• *Developer Access and Repository Workflow:* Christy, Mayank, Arun, and others coordinated on providing developer access in Cloud Manager and clarified the correct workflow for code changes, including repository structure and permissions.\n• *Custom Function Development and Reusability:* Andy Kluck, Christy, Arun, and others discussed the need for custom functions to capture analytics parameters, concerns about ongoing maintenance, and the plan for the platform team to develop reusable solutions.\n• *Translation Process for Sites:* Mayank and Christy briefly revisited the topic of site translation processes, with Christy committing to provide more information in the next meeting.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:40.957Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758263694.472769"
  },
  {
    "id": "07b3f527-1dda-4e43-8fd2-a64b8f51bb3e",
    "source": "slack",
    "text": "*\n*Use Case Summary*\nRoyal wants an authoring experience where ship staff can use a module-based builder to drag and drop daily activities, ads, and other components—sourced live from a connected database of ship activities and amenities—into a template for each ship and cruise day, ensuring the most up-to-date content is always reflected; the process should automate the generation of a final PDF document for printing or download, eliminating manual updates and syncing issues while supporting thousands of unique daily itineraries across their fleet.\n\n*Notes*\n• It is a pre-sales engagement.\n• It’s an IC use case. IC Editor was demoed and received well.\n• They want to see the associate UI demo as well before making the final decision.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:39.445Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758514248.694039"
  },
  {
    "id": "4bd57a20-3361-4b52-a54f-26ac983c50ba",
    "source": "slack",
    "text": "*\n• They have a massive daily batch based invoice generation use case. \n• They generate around 13M PDFs per day. \n• Currently, they use OpenText Exstream which is a robust system and they also use RICOH for certain other PDF solutions. \n• They presented their use case requirements. They don’t have any major pain points with the existing solution. \n• They are an existing AEM Assets &amp; Sites, AEM customer. \n• They are exploring alternatives to see if there is a better price point from what they are currently paying. \n• Arun gave an overview of Forms solution.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:37.935Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758514658.124379"
  },
  {
    "id": "86fb93b9-ddfe-418d-9fb1-d86f79422039",
    "source": "slack",
    "text": "*\n• Forms Team showcased accessibility issues for few of their forms which had high traffic. \n• Shared the issues with Michelle which she will hand over to relevant team.\n• Michelle mentioned that their forms team is small, with legacy UI and they avoid changes due to lack of expertise.\n• We also asked if they had any critical forms that they would want us to look at, they mentioned their “Book a flight” form is the critical one.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:36.423Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758690059.009889"
  },
  {
    "id": "932e83d4-4091-460b-a37f-52d683c5c6b1",
    "source": "slack",
    "text": "*\n• *Forms Search Inconsistency*: Customer reported inconsistent search results in Forms Experience Builder. Engineering confirmed issue occurs across both main interface and properties dialog. Workarounds (full path/name) help but don’t solve root cause. Engineering committed to investigate and fix.\n• *401 Authentication Errors*: Arneh identified conflicting cookies and headers as the likely cause of 401s. Recommended removing cookies from requests. Customer will check with middleware team. Engineering to provide cookie details and logs.\n• *Offshore Developer Support*: Engineering offered direct support to customer’s offshore developers via email and scheduled working sessions during IST hours. Customer will provide single point of contact details.\n• *Publication Workflow Feedback*: Customer suggested adding a republish option in Forms UI to avoid unpublish/republish cycle. Engineering agreed to log enhancement request.\n• *Adaptive Form Testing Update*: Customer reported offshore developer successfully created and modified adaptive forms. Team is progressing towards broader adoption of Forms Experience Builder.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:48:34.910Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758691681.214369"
  },
  {
    "id": "dcfd0d68-7551-466d-8eb3-b43fda48e18f",
    "source": "slack",
    "text": "*\n• *AEM Forms Integration with Adobe Experience Platform (AEP):* Harman, Mayank, and Katie Manarte discussed the end-to-end process of integrating AEM forms with Adobe Experience Platform, including schema creation, data set configuration, and form setup, with Vince and other team members contributing questions and clarifications.\n• *Form Field Configuration and Validation:* Katie Manarte inquired about configuring specific form fields, such as checkboxes and validation rules, with Harman and Mayank confirming that these options are available and customizable within the AEM editor.\n• *Documentation and Support Resources:* Katie Manarte requested access to both written and video documentation for the integration process, with Harman and Vince confirming that comprehensive resources, including step-by-step videos, are available and will be shared.\n• *Future Form Use Cases and Additional Integrations:* Mayank and Katie Manarte discussed potential future forms and other integration needs, agreeing to gather requirements and schedule further discussions or demos as needed.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:33.397Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758706160.526549"
  },
  {
    "id": "e1f89715-4e7e-4e03-9beb-03ffc2b05082",
    "source": "slack",
    "text": "*\n• *Implementation of Custom Functions for Tracking IDs:* Andy, Mayank, Speaker 1, and the team discussed the implementation of custom functions to capture Facebook click ID, Google click ID, and Adobe Analytics ECID, with Speaker 1 demonstrating the code and deployment process, and clarifying the need for website team involvement for deployment.\n• *Setting Up Rules for Operating Unit Selection:* Mayank and Speaker 1 described the process for parsing the address URL to determine the operating unit (such as US or Australia) and explained how custom rules can be created for this purpose, with Andy requesting assistance to ensure correct setup.\n• *Access Issues with Git Repository and Developer Involvement:* Mayank, Christy, and Speaker 1 discussed ongoing access issues with the Git repository required for deploying custom functions, with Christy attempting to troubleshoot login problems and agreeing to escalate the issue to the security team, while Arun and others highlighted the importance of involving developers in the process.\n• *Deployment Process and Client Library Integration:* Speaker 1 and Christy discussed the technical steps for integrating the custom client library into the codebase, including file structure, deployment to the QA environment, and the need to register the client library in form settings.\n• *Coordination and Handover for Next Steps:* The team, including Andy, Mayank, Christy, and Speaker 1, agreed on next steps for sharing code, resolving access issues, and coordinating with the operations and developer teams to finalise the implementation and testing of custom functions and rules.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:31.887Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758706353.738309"
  },
  {
    "id": "6968d656-2e39-49f0-856f-1d4b59da5e70",
    "source": "slack",
    "text": "*\n_AI-generated notes_\n\n*Key Topics:*\n• *Introduction:* Matthew, Arun, Vijay Kumar, and Chris from Adobe met with Laura, Dipesh Shrestha, and James from Centene to discuss the VIP project for implementing forms on edge delivery services. The meeting aimed to understand Centene's use cases, identify key forms for implementation, and explore potential collaboration opportunities. \n• *Centene Team Introductions:* Laura, Dipesh Shrestha, and James introduced themselves and their roles at Centene. Laura is a senior manager over the product side, Dipesh is an engineering manager overseeing two engineering teams, and James is a product management lead in the Experience Cloud organisation. \n• *VIP Program Overview:* Arun explained the VIP program, which involves a joint development team working together to get initial forms live on edge delivery services. The program includes regular meetings, a Slack channel, and a focus on integrating forms with existing systems of record. \n• *Forms Use Cases:* James and Laura discussed their respective use cases for forms on the secure portal and public side. James mentioned the need for forms in secure portal experiences, while Laura highlighted the need for forms on the public side, including new forms and existing forms with uploads. \n• *Technical Considerations:* The team discussed technical considerations, including the use of MongoDB and FileNet for storing form data, the need for forms to be embedded within pages, and the potential use of headless forms and cross-channel implementation. \n• *Conversational Forms Demo:* Chris provided a quick demo of conversational forms, showcasing the ability to fill forms through a chat interface and image uploads. This feature is in co-innovation mode and not yet out-of-the-box functionality. \n• *Next Steps:* The team agreed to identify one or two forms for the VIP engagement, share the URLs of the target forms, and explore the potential for co-innovation on conversational forms. Arun emphasised the importance of making the forms implementation repeatable and reusable. \n:todo_done: *",
    "created_at": "2026-01-25T16:48:23.513Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758772873.101649"
  },
  {
    "id": "82127f7c-1280-4db6-b267-d48532fbb52b",
    "source": "slack",
    "text": "*\nDetails\n● I*nova Account Migration to Adobe* Eric Van Geem provided an overview of the Inova account, noting that they are an AEM Forms customer with approximately 180 forms on their current <http://inova.org|inova.org> site, which is hosted on Drupal. The team is in the process of migrating everything to Adobe, specifically utilizing AEM Forms and Edge Delivery Services to build the new site. The goal is to understand options for integrating AEM Forms with their existing systems, including parallel submissions to Eloqua and AEP\n● *AEM Forms and Edge Delivery Services Capabilities* Vijay Kumar confirmed that all submit actions, except for the \"assign task\" step within AEM workflow, are supported on Edge Delivery Services. Vijay Kumar also stated that both Eloqua and AEP connectors are available out of the box, with Eloqua using a REST API and API using a direct connector. The team can offer assistance in setting up and configuring forms for multiple submission endpoints through their VIP program, similar to past collaborations.\n● *VIP Program for AEP Connectors and Project Timeline* Vijay Kumar explained that the VIP program for AEP connectors is currently running, with new AEP and Marketo connectors recently introduced. They stated that participation in the VIP program requires a committed go-live date within a few weeks of starting the program. Eric Van indicated that while Inova is committed to going live, development on the site and forms has not yet begun, with a projected go-live date of July or August next year, following discovery, design, and a year-long development phase.\n● *Azure Blob Storage Support for Form Attachments* Eric Van Geem inquired about storing signature images, specifically mentioning Azure blob storage as a potential option. Vijay Kumar confirmed that Azure blob storage is supported out of the box for attachments, allowing for configurations where attachments are sent to Azure blob storage while other data goes to AEP and Eloqua. They also mentioned that the process for configuring AEP connectivity is being streamlined to be more user-friendly and avoid multiple manual steps.\n● *Ongoing Collaboration and Future Engagements* Eric Van Geem and Vijay Kumar agreed to coordinate on Slack to initiate the VIP program when the development of forms begins, acknowledging that content pages and other integrations might be prioritized initially . Vijay Kumar also inquired about Eric Van Geem's continued engagement with the \"stereicycle\" account, to which Eric Van Geem responded that their team is still involved in maintenance, though their personal allocation has shifted, with potential for future opportunities related to DA - universal editor approaches.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:21.997Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1758801181.582319"
  },
  {
    "id": "68e09702-b9d0-47d3-a632-c9b953586ff4",
    "source": "slack",
    "text": "*\n• *Agent UI Demonstration and Capabilities:* Harshit provided an in-depth demonstration of the Agent UI, highlighting features for editing, validating, and managing content fragments, PDF output and preview, dynamic content, and API integration. Harshit also addressed Alexey’s questions regarding last-minute edits and dynamic content handling.\n• *Cloud Service Roadmap and Feature Availability:* Chris and Adam briefed Alexey on the current status and future roadmap of the AEM Forms Cloud Service. They covered feature rollout timelines, distinctions between the managed service and cloud service offerings, and the availability of inline editing and other key functionalities.\n• *Customer Feedback and Product Development Collaboration:* Chris and Adam encouraged Alexey to actively provide feedback and feature requests throughout the ongoing development of AEM Forms Cloud Service, emphasizing Royal Caribbean’s opportunity to influence the product roadmap.\n• *Customer Adoption, Budget, and Next Steps:* Adam and Alexey discussed the adoption process for AEM Forms Cloud Service, touching on licensing, budget approval, project timing, and upcoming internal reviews and coordination with the architecture team.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:48:20.486Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759122294.631499"
  },
  {
    "id": "7f42cffa-5f13-4fa3-935c-3647dbb57c42",
    "source": "slack",
    "text": "*\nSharing old notes of Maruti use cases\n• Some of forms are repeating in both <http://marutisuzuki.com|marutisuzuki.com> and <http://nexaexperience.com|nexaexperience.com>\n• Features\n    ◦ *Journeys ( Wizard, multi-step)*\n    ◦ *API Integration*\n• *Rules*\n        ▪︎ Invoke Service\n        ▪︎ Hide/Show\n        ▪︎ May be more\n• *Prefill*\n• *DoR* ( generating PDF on final submission at least for Customer &amp; Dealer Journey)\n• *Email* - assuming forms like booking service, appointment, etc. sending some kind of notification to filler.\nForms in <http://marutisuzuki.com|marutisuzuki.com>\n• Customer Journey\n• Dealer Journey\n• <https://www.marutisuzuki.com/service|Service Cost Calculator>\n• <https://www.marutisuzuki.com/corporate/reach-us/business-opportunities|Business Opportunities>\n• <https://www.marutisuzuki.com/corporate/reach-us/business-opportunities|Book showroom visit>\n• <https://www.marutisuzuki.com/service/book-service-appointment|Book a Service>\n• <https://www.marutisuzuki.com/corporate/reach-us/business-payments|Business Payment>\n• <https://www.marutisuzuki.com/corporate/careers/training-academy|Training Application form>\n• <https://www.marutisuzuki.com/more-from-us/exchange|Exchange>\n• <https://www.marutisuzuki.com/subscribe/preferences|Car subscribe>\n• <https://www.marutisuzuki.com/more-from-us/institutional-customers/enquiry|institutional>\nForms in <https://www.nexaexperience.com/|NexaEx>\n• <https://www.nexaexperience.com/book-test-drive|Test Drive>\n• <https://www.nexaexperience.com/ebook#/login|eBook>\n• <https://www.nexaexperience.com/service|Book a Service>\n• <https://www.nexaexperience.com/maruti-suzuki-car-finance|Smart Finance>\n• <https://www.nexaexperience.com/corporate-institutional-sales|Sales Enquiry>\nForms in <https://www.marutisuzukiinsurance.com/#/home|marutisuzukiinsurance>\n• <https://www.marutisuzukiinsurance.com/#/renew-policy|Renew>\n• Claim - Its seems manual but we can propose form\nForms in <https://www.marutisuzukidrivingschool.com/|marutisuzukidrivingschool>\n• <https://www.marutisuzukidrivingschool.com/mock-llr-test|Mock Test>\n• Enquire\n• <https://www.marutisuzukidrivingschool.com/quiz|Quiz>\n\n:todo_done: *",
    "created_at": "2026-01-25T16:48:18.976Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759137943.174139"
  },
  {
    "id": "180167fa-0b25-4a86-bef1-961229dd3142",
    "source": "slack",
    "text": "*\n• We showed how to create a servlet that integrates the OSGi service for rendering PDFs in a local setup. We had previously shared a private FAR for this via an Adobe CRM ticket, and Ashish from NFCU was able to make it work in the meeting.\n• We informed them that their cloud environments — Dev, Dev2, and SQA — have been updated with the latest requested changes.\nFew new features have been requested\n• Unit conversion from mm to cm within the canvas.\n• Typography enhancements — specifically adding superscript and subscript formatting options.\n• Switch one component to another. For example, if a user has added a textfield with content, they should be able to convert it into a numeric field while retaining the content. Though this functionality exists in the desktop designer — but do we really need to support this? \n• Text overflow handling for textfields — if a caption or value is too long, the container should auto-expand to accommodate the content.\n• Batch PDF generation — not an immediate priority, but we discussed the current behavior and the potential need for batch processing in future render scenarios.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:17.465Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759215618.215119"
  },
  {
    "id": "fb366fe7-1641-4337-acdf-6c1716879e44",
    "source": "slack",
    "text": "*\n• *Demonstration of Form Creation and Import Capabilities:* Anurag demonstrated to Daniel Stöckli and Michael Peter the current capabilities for creating adaptive forms from scratch, importing forms via screenshots or hand-drawn images, and converting Acro and XFA PDF forms, highlighting the use of LLM for field detection and mapping.\n    ◦ *Screenshot and Hand-Drawn Import:* Anurag explained and demonstrated how users can import screenshots or hand-drawn images into the adaptive forms editor, where an LLM identifies fields and maps them to form components, supporting both single and multiple image uploads.\n    ◦ *PDF Form Conversion:* Anurag described the process of importing Acro forms and XFA PDF forms into the form manager, where the system analyzes the PDF and creates an adaptive form, with recent support added for XFA PDFs.\n    ◦ *Uniform Editor Experience:* Anurag clarified that the import and creation capabilities are available in both the universal editor and adaptive forms editor, ensuring a consistent user experience across interfaces.\n    ◦ *Field and Script Handling:* Anurag noted that while field mapping and detection are robust, script analysis and migration from PDF forms are not yet implemented, and are recognized as a significant area for future development.\n• *Current State and Roadmap for Script Migration and Testing Automation:* Daniel Stöckli and Michael Peter inquired about the status and timeline for JavaScript migration from PDF and XFA forms and automated testing capabilities, with Anurag confirming content migration is available, script migration is in POC, and testing automation is being explored for core component forms.\n    ◦ *Script Migration Status:* Anurag confirmed that content migration for XDP and XFA forms is available, but JavaScript migration for Acro and XFA forms is still in the proof-of-concept phase, with no concrete timeline but an estimate of one to two months for initial results.\n    ◦ *Testing Automation Efforts:* Anurag described ongoing work on automated testing utilities for core component forms, which involve recording end-to-end user flows and detecting test case failures, but noted that these utilities do not yet support foundation component forms.\n    ◦ *Customer Feedback and Data Needs:* Anurag requested that Daniel and Michael provide information on their current testing practices, time spent on testing, and representative forms with JavaScript to help guide development and prioritization of script migration and testing features.\n    ◦ *Timeline and Availability:* Anurag stated that the script migration feature is targeted for release within the year, likely in Q4, and encouraged the team to provide sample forms and scripts to accelerate the POC and ensure the solution meets real-world needs.\n• *Early Access, Production Readiness, and Customer Use:* Anurag clarified to Daniel Stöckli that the demonstrated features are in early access and can be used in production-like environments, with feedback encouraged before general availability, and explained the silent launch approach and plans for broader release.\n    ◦ *Early Access Definition:* Anurag explained that early access means the features are hosted on production infrastructure and can be used in development or sandbox environments, but are not yet generally available pending a unified go-to-market strategy.\n    ◦ *Customer Enablement:* Anurag confirmed that select customers can use the features and are encouraged to provide feedback, with the team assessing internally to enabling sandboxes and supporting customer-specific use cases during the early access period.\n    ◦ *General Availability Plans:* Anurag noted that general availability will be coordinated with the broader AEM team and will include additional agentic capabilities, with the timeline for full release still to be finalized.\n• *Collaboration on Real-World Use Cases and Feedback:* Anurag requested that Daniel Stöckli and Michael Peter's team provide representative forms, especially those with JavaScript, and details on testing practices to support POC development, and discussed collaboration on Figma import and migration utilities.\n    ◦ *Sample Forms and Scripts:* Anurag asked the team to identify and import 10-20 representative UBS forms, including those with JavaScript, into their sandbox environment and report on the results to help validate and improve the migration tools.\n    ◦ *Testing Data Collection:* Anurag requested quantified data on time spent testing forms and information on automation frameworks used, to better understand customer needs and refine the testing automation solution.\n    ◦ *Figma Import Collaboration:* Anurag invited the team to share anonymized Figma files or URLs to support the ongoing POC for Figma import, confirming that either method of sharing is acceptable and will help guide feature development.\n    ◦ *On-Premises Customer Support:* Anurag discussed options for on-premises customers, suggesting the use of temporary sandboxes for development and migration, with the ability to export results to on-prem systems, and confirmed internal discussions are ongoing to support this approach.\n• *Migration Utility for Foundation to Core Components:* Daniel Stöckli and Michael Peter raised the topic of migrating forms from foundation to core components, with Anurag explaining that a separate migration utility exists, primarily benefiting Helvetia forms, and offered to arrange a demo for interested teams.\n    ◦ *Migration Utility Availability:* Anurag stated that a migration utility for moving from foundation to core components is available and has been improved for UBS, but may be more suitable for Helvetia forms, and offered to provide a demo or further information as needed.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:48:15.953Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759221198.042019"
  },
  {
    "id": "bdbbecf7-b85e-4e52-87f0-b8e949155692",
    "source": "slack",
    "text": "*\n• AFTIA presented the current state of the use case implementation and the partner has shared the demo and the presentation of how and what kind of engagements they did with Adobe .\n• Adobe (AMS) team has shared the couple of things which Adobe is offering to the customer to support the use cases in terms of scale and submission throughput.\n• From engineering we shared the optimised approach - the why and how the present use case can be implemented \n• ALTEC seems to be satisfied with the approach and is aligned with the plan\n:todo_done: *",
    "created_at": "2026-01-25T16:48:14.443Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759241322.890699"
  },
  {
    "id": "a2795378-5786-4cde-b741-233be488c5b7",
    "source": "slack",
    "text": "*\n• *Challenges in Form Creation and AEP Integration:* Katie Manarte raised concerns about the complexity of creating forms and integrating them with Adobe Experience Platform (AEP), highlighting the numerous steps and potential for errors, while Mayank acknowledged these issues and discussed ongoing efforts to simplify the process with the AEP team.\n• *Adaptive Form Component Usage and Embedding Methods:* Katie Manarte and Mayank discussed the use of the adaptive form component in AEM, with Mayank demonstrating multiple ways to embed forms into site pages, including direct embedding, using experience fragments, and leveraging core components.\n• *Communication and Support Channels:* Vince, Mayank, and Jennifer discussed the availability of a Slack channel for ongoing support, encouraging Katie Manarte to use it for questions and feedback between meetings to expedite issue resolution.\n• *Next Steps and Action Items:* Katie Manarte will experiment with the adaptive form embedding methods and schema integration, reporting back on progress, while the team continues discussions with AEP to streamline the setup process and encourages ongoing communication via Slack.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:12.932Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759242567.213609"
  },
  {
    "id": "a68efdcf-0034-4647-a0e6-57ee7e57b406",
    "source": "slack",
    "text": "*\n• *Overview of Forms Co-Innovation Program:* Anurag provided a comprehensive overview of the Forms Co-Innovation (VIP) program, explaining its purpose, selection criteria, phases, and the benefits for strategic customers, with input from Simon Habtu.\n• *Early Access Innovations and Experience Builder:* Anurag introduced the Early Access page listing available innovations, including the Experience Builder AI assistant, and clarified ongoing documentation efforts, with additional context provided by Emily and Vijay Kumar Jalagri.\n• *Technical Integration Scenarios for Forms:* Mukundan and Kumuda raised questions about integrating forms with various back-end systems, which Anurag and Vijay Kumar Jalagri addressed by detailing configuration options and clarifying data handling practices.\n    ◦ *Integration Scenarios:* Mukundan described three scenarios: submitting plain forms via e-mail, submitting data to REST API endpoints, and integrating with third-party systems like SAP or databases, seeking demos for each use case.\n    ◦ *Configuration and Data Model:* Anurag explained that e-mail and REST endpoint submissions are straightforward configurations, while integration with back-end systems can be achieved using the form data model, which allows for no-code configuration with various endpoints.\n    ◦ *Data Storage Practices:* Anurag clarified that AEM does not store any form data in its repository for confidentiality and PII reasons; all data remains in the customer’s system of record.\n    ◦ *Demo and Customization Support:* Vijay Kumar Jalagri noted that the shared demo video covers API integration and custom components, and offered to provide customized demos based on the team’s specific requirements.\n• *Program Participation and Next Steps for UPS Team:* Simon Habtu, Emily, Kumuda, and Anurag discussed UPS’s potential participation in the program, clarifying the scope, resource commitments, and next steps, including sharing example forms and outlining the beta agreement process.\n    ◦ *UPS Team Sentiment and Requirements:* Emily and Simon Habtu expressed enthusiasm for the opportunity, noting that the program is free for UPS and requires alignment on prioritized use cases, success criteria, and a committed go-live date.\n    ◦ *Form Volume and Migration Plans:* Vijay Kumar Jalagri requested information on the number of forms and migration plans, to which Simon responded that UPS expects to start with one or two forms and expand as they transition forms onto <http://ups.com|ups.com>.\n    ◦ *Example Form Sharing:* Simon shared an example of a simple virtual consultation form, indicating that initial forms may be straightforward but will require back-end integration, which is a priority for the engineering team.\n    ◦ *Next Steps and Beta Agreement:* Anurag agreed to compile next steps and have Michael send meeting notes, requesting an e-mail ID for the beta agreement signature to initiate the program, with the expectation that the beta will address integration and accelerate UPS’s progress.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:11.420Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759295224.273769"
  },
  {
    "id": "0f3d472e-ec49-4cd1-bff4-b88abca89743",
    "source": "slack",
    "text": "*\n• *Unbound Fields Report:* Customer discussed the need to identify fields that fail to bind during form conversion. Generating a consolidated report of these unbound fields will help the team perform manual corrections more efficiently.\n• *Validation Rules Testing:* Customer suggested that manual effort is there in adding validation rules for similar fields in different forms. He agreed to share a sample set of rules with the team for review and testing.\n• *Batch Conversion Capability Status:* Customer feedback was related to only single form conversion working for now and they have to do it for every form. Batch conversion capability would help, as this feature is critical for scaling form migrations. \n• *Custom Styles Documentation:* Arneh confirmed that documentation exists for applying custom CSS styles to adaptive form components. He agreed to send the reference materials to Andy for immediate use by the offshore developers.\n• *Core Components Customization Guidance:* Team to provide practical guidance and possible code snippets for customizing adaptive form core components, helping developers streamline their implementation.\n• *Account Number Field Business Sign-Off:* Andy highlighted the importance of securing business approval for the account number field’s validation and behavior before moving into QA testing. This will ensure alignment with business requirements and reduce rework later.\n• *Number of forms to convert* : Customer shared the plan to convert forms using builder in batches till February 2026. With some of them planned each month.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:09.906Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759302140.947489"
  },
  {
    "id": "0bb1962c-3573-4e51-8175-efdb096d30ed",
    "source": "slack",
    "text": "*\n• *AEM Form Integration and Hidden Fields Issue:* Andy Kluck, Mayank, Devendra, and Sudhanshu discussed the problem of hidden fields and conditional rules not transferring from the adaptive form to the published AEM site page, with Devendra and Sudhanshu explaining the technical reasons and suggesting next steps for troubleshooting.\n• *Client Library Inclusion for Form Functionality:* Sudhanshu, Mayank, and Devendra explained the necessity of including specific client libraries in the site page header to enable adaptive form rules, and discussed both temporary and recommended approaches for implementation.\n• *Environment Configuration and Deployment Strategy:* Andy Kluck, Christy, and Sudhanshu discussed how client library and configuration changes should be managed across QA, stage, and production environments, agreeing on a one-time setup in the codebase and the need for documentation and tracking of changes.\n• *Testing Plan and Temporary Workarounds:* Andy Kluck, Mayank, and Sudhanshu coordinated on immediate testing of the form in QA using the temporary client library inclusion, with Andy preparing test pages and planning to involve Joseph if further testing is needed.\n• *Locale and Region Logic for Form Fields:* Andy Kluck, Speaker 1, and others discussed how to populate country and language fields in the form, deciding to use URL parameters for MVP and deferring location API integration for future releases.\n• *Theme Ticket and Coordination with AEM Team:* Andy Kluck and Sarah Warzecha briefly discussed the status of the theme ticket with the AEM team, with Sarah agreeing to follow up for updates.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:08.394Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759302631.277869"
  },
  {
    "id": "29a0f1df-ee57-492b-a1a0-fe1fa4886aa1",
    "source": "slack",
    "text": "*\n• All ASO opportunities attended the meeting.\n• Presented the Forms opportunity for one of their forms.\n• The attendees showed interest based on their reactions.\n• They requested to run this audit on their other three domains.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:06.882Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759720571.470079"
  },
  {
    "id": "2e809047-6c37-4e01-93cb-991d4be0ef6b",
    "source": "slack",
    "text": "*\n• All ASO opportunities attended the meeting.\n• From forms side presented the experimental forms opportunity found for their newsletter subscription form.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:05.372Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759720674.127879"
  },
  {
    "id": "92119337-478c-47e1-b0b6-3152f98389bd",
    "source": "slack",
    "text": "*\n• Presented *Forms opportunities* for the domain `<http://conti.com.br|conti.com.br>`.\n• Suggested *experimentation* with variations for *two of their forms*.\n• They are *currently accessing* the suggested options.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:03.862Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759743994.384419"
  },
  {
    "id": "8f837d05-7886-45ab-a553-f5c5330f5066",
    "source": "slack",
    "text": "*\n• *401/501 Errors:* Customer escalated the ticket and coordinating internally; Arneh investigated and raised API and middleware behavior causing cookies and login token conflicts. \n• *Unbound Fields:* Engineering to document all unbound fields from form conversion and enhance service visibility.\n• *BATCH Support:* Customer to share completion timelines for the Batch support POC once confirmed.\n• *Da Vinci Form QA:* Customer to publish and enable the Da Vinci form in QA for testing.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:48:02.354Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759905157.566889"
  },
  {
    "id": "75bbb578-e3fe-430d-a93c-0ae297016c9b",
    "source": "slack",
    "text": "*\n• *Adaptive Form Configuration and Bind Reference:* Katie Manarte raised questions about configuring adaptive forms, specifically regarding the use of bind references and schema integration, which Mayank explained in detail, with Vince and Arun contributing to the discussion.\n• *Adaptive Form Container Versus Embedded Form:* Katie Manarte, with input from Mayank, Vince, and Arun, compared the adaptive form container and embedded form approaches, discussing their respective setup processes, usability, and configuration challenges.\n• *Help Text Tooltip Behavior in Published Forms:* Katie Manarte reported an issue where clicking the help text tooltip in the published form always navigates to the first name field, which Mayank and Vince acknowledged and agreed to investigate further.\n• *Next Steps and Deployment Timeline:* Katie Manarte, Jennifer, and Vince discussed the next steps for testing, analytics integration, and deployment, confirming the plan to replace the current Brightline W form and setting an end date of October 23rd.\n:todo_done: *",
    "created_at": "2026-01-25T16:48:00.845Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759918620.082929"
  },
  {
    "id": "fe30a00f-e2a6-48af-bb6b-ed0a0fa766a7",
    "source": "slack",
    "text": "*\n• *Form Integration Issues on Regional Pages:* Andy, Mayank, Speaker 1, and Christy discussed ongoing problems with embedding and displaying forms on the Australia and New Zealand regional pages, including issues with rules not showing, forms not loading, and errors in the published environments.\n• *Deployment and Pipeline Process for Form Functionality:* Christy, Speaker 1, and Mayank discussed the need to move manual changes for form functionality into the code repository and pipeline, as temporary fixes were insufficient for production environments.\n• *Coordination and Next Steps for Issue Resolution:* Andy, Mayank, Christy, and Speaker 1 agreed on next steps, including involving additional developers, improving communication, and targeting resolution by Thursday to enable testing and styling updates.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:59.333Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759918705.952969"
  },
  {
    "id": "8fc90be6-66f1-41d2-b6ff-9cb3dc3df36f",
    "source": "slack",
    "text": "*\n• Discussed form opportunities that were presented to them in our last meeting.\n• Devendran from AstraZeneca side mentioned that they had discussed these with their internal team.\n• He also stated that the decision regarding form placement and CTA placement was made by their brand team.\n• Presented additional form opportunities and form accessibility (a11y) opportunities for their other domains - *Wainua* and *Tagrisso*.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:57.820Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1759980070.548739"
  },
  {
    "id": "8454b8f1-92ab-402a-bc6f-7b621a1e4f6d",
    "source": "slack",
    "text": "*\n• *AEM Form Publishing and Loading Issues:* Andy Kluck, Mayank, Sakshi, and others discussed persistent issues with AEM forms not loading on the published QA website, despite working in the editor and preview modes, and identified that dispatcher rules and client library configurations may be blocking the required resources.\n• *Dispatcher and Authentication Configuration Challenges:* Sakshi, Jonathan, Mayank, and others conducted a detailed review of dispatcher and authentication settings, identifying that missing or misconfigured rules in the dispatcher files were likely preventing form resources from loading on the published site, and discussed next steps for remediation.\n• *Access and Collaboration Barriers:* Sarah, Mayank, Sakshi, and others addressed ongoing access issues to repositories and IT systems, outlining the need for support from Christy and the IT help desk to resolve authentication loops and ensure timely progress on required configuration changes.\n• *Outstanding Technical Issues and",
    "created_at": "2026-01-25T16:47:56.308Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760073869.744429"
  },
  {
    "id": "764636df-0e63-4278-9e5e-89c53e60eb60",
    "source": "slack",
    "text": "*\n• *Login Token Issue:* Customer investigating source of login token in metadata calls and will raise it in the upcoming support call with Adobe.\n• *Unbound Fields &amp; Batch Conversion:* Engineering progressing on unbound fields listing and batch PDF conversion; demo planned for next week with feedback invited.\n• *Form Loading Issue:* Engineering identified file attachment component as cause of form load failure; deleting it resolves the problem.\n• *Browser Mandatory Field Bug:* Customer reported dropdown not showing as mandatory in Chrome; Engineering requested HAR logs and Chrome version for analysis.\n• *AEM Publishing Issues:* Customer experienced lag and lost changes during publishing; Engineering reviewing tickets and advising on package verification.\n• *Future Core Upgrade:* Customer plans to move authoring to production and in 2026 to simplify publishing and boost performance.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:54.796Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760094837.281229"
  },
  {
    "id": "c37b1334-d278-40ad-804d-f01ae9e7b4b6",
    "source": "slack",
    "text": "*\n• *Producer Usability Challenges with Adobe Forms:* Katie Manarte, supported by Rebecca and Vince, raised concerns to Mayank and Harman about the complexity of configuring Adobe Forms for producers, emphasizing that current setup requires developer involvement and is not user-friendly for non-technical team members.\n• *Backend Configuration and Submission Process:* Mayank and Harman described the technical requirements for configuring form submissions in Adobe, clarifying the need for initial admin setup and explaining the process for connecting forms to various endpoints, while addressing questions from Katie and Rebecca.\n• *Styling and Theming Issues with Embedded Forms:* Katie Manarte reported issues with form styling disappearing when embedded components are removed, prompting Mayank to explain how themes and client libraries are applied depending on form setup within Adobe Sites.\n• *Next Steps and Support Plans:* Vince proposed assembling a support team and seeking further documentation or training to address the usability concerns raised by Katie, aiming to streamline the form creation process for the team.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:53.284Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760546749.825929"
  },
  {
    "id": "c2bb94e0-af90-46c4-b043-99c972f4d8b4",
    "source": "slack",
    "text": "*\n• *Form Conversion Process and Binding Issues:* Arneh, Gaurav, Andy, and Mayank discussed the ongoing challenges and solutions related to converting forms, particularly focusing on binding issues, the use of additional instructions, and the need for manual edits in some cases, with Krishna and Rociel handling authoring tasks.\n• *Conversion Report Feature and Its Usage:* Arneh, Gaurav, Andy, and Mayank discussed the new download conversion report feature, which helps identify fields without bindings and provides a quick way to verify form conversion quality at a page level.\n• *Form Publishing Workflow and QA Process:* Andy and Mayank reviewed the workflow for moving forms from development through QA to production, including the use of Adobe Sign for testing and the scheduling of production releases, with Mayank requesting updates on go-live timelines.\n• *401 Login Token Issue and Troubleshooting:* Arneh and Andy discussed ongoing troubleshooting of a 401 login token issue, including attempts to reproduce the problem, the use of JWT tokens, and plans to share code snippets to facilitate local testing and performance analysis.\n• *Team Structure and Batch Conversion Plans:* Gaurav and Andy discussed the current team structure for form conversion, confirming that Krishna and Rociel are the primary authors, and outlined plans to use the form builder for upcoming batches of forms, with batch support being developed.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:51.771Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760546957.315829"
  },
  {
    "id": "8e5fa393-d919-475d-8d93-389d58623ff3",
    "source": "slack",
    "text": "*\n• *Dispatcher Pipeline Deployment Issues:* Mayank, Jonathan, and Andy discussed the deployment of dispatcher changes, with Jonathan explaining that although the latest updates were pushed, a pipeline build failure is preventing deployment and testing until the issue is resolved, likely by the next day.\n• *Theme Updates and Team Coordination:* Mayank inquired about recent theme-related changes in the repository, with Jonathan confirming that Ben McKnight's team is handling theme updates for AEM forms, and Andy clarifying that their focus is on form submission and integration with Marketo.\n• *Documentation of Form Changes:* Mayank and Andy discussed the need for a shared document tracking all changes made to forms, with Andy requesting Mayank to follow up with Christy and Ben to ensure the document is being maintained and shared.\n• *Marketo Engage Integration Blocker:* Andy raised an ongoing issue where new forms cannot connect to Marketo Engage due to persistent loading errors, and Mayank agreed to investigate the environment to address this blocker.\n• *Form Styling and Privacy Rule Handling:* Andy noted that the current approach to form styling, which relies on privacy rules shared by Shraddha, is a temporary solution, and coordination with Ben's team is needed for a more sustainable approach.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:50.262Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760547174.065489"
  },
  {
    "id": "1cd8afe0-9876-4672-bd90-73a44dd047f2",
    "source": "slack",
    "text": "*\n*High level summary:*\n• Account is escalated - they have not been able to create the first form and want to go-live with the first form soon. They shared a list of issues in advance - and the same were discussed in the call: <https://adobedx.slack.com/archives/C09LE642LHL/p1760462296224229>\n• We have proposed a VIP engagement to help them go live with the first form (short ~ 4 week engagement expected). Proposal is to leverage some of the new capability:\n    ◦ Forms Experience Builder - they did not show much interest in this - and clarified that current issues are related to configurations/connectivity, and mentioned that the forms smaller (~ 1 page) - and they normally create the fields/sections in a day.\n    ◦ Forms Optimization - we pitched this part. Though current forms being targeted are behind authentication\n• We have asked for screenshots of a couple of forms for more clarity on the use-case.\nGenerated by AI. Make sure to check for accuracy.\n*Meeting notes:*\n• *Email Configuration in Cloud Environment:* Randy, Sudhanshu, and Arun discussed challenges with configuring email services in the cloud, including unclear documentation and the need for step-by-step guidance, with Sudhanshu proposing to provide a recording or detailed instructions for the setup.\n    ◦ *Documentation Limitations:* Randy explained that the current documentation for configuring email in the cloud is difficult to follow and does not clearly address the necessary steps or permissions, particularly regarding OSGI environment variables and cloud manager access.\n    ◦ *Security Concerns with Local Setup:* Randy raised concerns about configuring email on local development environments due to security risks, such as opening ports that could expose devices to email viruses, and asked if configuration must be done locally or can be performed directly in the cloud.\n    ◦ *Clarification on Configuration Location:* Sudhanshu clarified that email configuration should be performed on the cloud instance itself, not on local development environments, and acknowledged the need to improve documentation based on this feedback.\n    ◦ *Next Steps for Email Setup:* Sudhanshu proposed to share a recording or detailed steps for configuring email on the AEM side, and Randy noted that their Office 365 administrator was unavailable for the call but had completed registration on their end.\n• *Local Development Environment Challenges:* Tim Mishico and Randy described difficulties with setting up and maintaining the local development environment, including errors during batch file execution and discrepancies between local and cloud behavior, with Sudhanshu suggesting a follow-up debug session.\n    ◦ *Setup and Execution Errors:* Tim Mishico reported that after installing Docker Desktop and creating containers, the batch file failed to execute properly, preventing successful local document record creation, despite following the provided URL instructions.\n    ◦ *Debugging and Support:* Sudhanshu recommended scheduling a separate call to review the specific errors encountered and requested that Tim share the command prompt output to facilitate troubleshooting.\n    ◦ *Preference for Cloud Development:* Randy expressed a preference for developing directly in the cloud due to difficulties in keeping local environments up to date and issues with pushing changes from local to cloud, especially given firewall and configuration differences.\n    ◦ *Rapid Development Environment Introduction:* Sudhanshu introduced the concept of a rapid development environment (RDE) available in the cloud, which can be used for most development tasks, reducing the need for local setups, though some limitations exist for specific features like document of record.\n• *Form Listing, Access Control, and Workflow Integration:* Randy, George, Sakshi, and Sudhanshu discussed requirements for listing forms, controlling user access, and integrating workflows, with the team explaining available options in Adobe Cloud Manager and proposing collaborative configuration sessions.\n    ◦ *Form Listing Options:* Sakshi and Sudhanshu explained that forms can be listed using a forms portal component on a site page, or via a custom component using the list forms API, allowing users to select and initiate forms directly from a web interface.\n    ◦ *User Group Access Control:* Sakshi clarified that access control can be implemented so that only assigned user groups see specific forms, leveraging authentication and user group assignments, which aligns with Randy and George's requirements for targeted form visibility.\n    ◦ *Workflow Initiation and Tracking:* Randy described the need to track forms through various workflow stages, including submission, approval, and assignment, and asked how users can view the status and history of forms within Adobe Cloud Manager.\n    ◦ *Collaborative Configuration Approach:* The team agreed that hands-on, collaborative sessions in the client's environment would be more effective than generic demo videos, with Sudhanshu proposing to work directly with the client to configure and validate the setup.\n• *Storing Forms and Attachments in Azure:* Randy, Mayank, and Sudhanshu discussed technical challenges and solutions for storing forms and attachments in Azure Blob Storage and SQL Server, including workflow integration and handling of attachments, with Mayank outlining a recommended approach using FDM connectors.\n    ◦ *Direct Storage in Azure Blob:* Randy explained that forms can be successfully stored in Azure Blob Storage directly from the form, but this method does not trigger workflows, which is a key requirement for their process.\n    ◦ *Workflow and Data Storage Integration:* Mayank clarified that while generic connectors for Azure Blob and SharePoint exist, they are not available as workflow steps; instead, the recommended approach is to use a Form Data Model (FDM) connector within the workflow to store form data in Azure.\n    ◦ *Handling Attachments:* Mayank and Randy discussed the need to convert attachments to base64 strings for storage in Azure SQL Server, as binary formats are not directly supported, while Azure Blob Storage can handle attachments more naturally.\n    ◦ *Preference for Hands-On Support:* Randy requested hands-on support in their environment rather than demo videos, emphasizing the need for step-by-step guidance to address configuration-specific issues and ensure successful integration.\n• *Populating Dropdowns from External Data Sources:* Sakshi demonstrated a solution for populating dropdown lists from SharePoint and Azure SQL Server, addressing a previously identified issue with array handling, and explained the technical steps for configuring dropdowns using rules and service invocations.\n    ◦ *Issue Identification and Fix:* Sakshi identified that dropdowns were not populating correctly when the SharePoint list returned an array, and confirmed that this issue has been fixed and will be enabled for the client's environment.\n    ◦ *Technical Configuration Steps:* Sakshi detailed the process of configuring a dropdown to use data from a SharePoint list or Azure SQL Server, including setting the enum and enum names properties and using rules to process the response payload.\n    ◦ *Custom Function for Data Extraction:* A custom function was described to extract relevant information from the response array and populate the dropdown, with the flexibility to handle both SharePoint and SQL Server data sources.\n    ◦ *Collaboration Offer:* Sakshi and Sudhanshu offered to collaborate directly in the client's environment to implement and validate the dropdown population solution, ensuring it works with the client's specific data sources and requirements.\n• *Workflow Review, Approval, and Form Status Tracking:* Randy, Mayank, and Sudhanshu discussed requirements for reviewing, approving, and tracking forms through workflow stages, including pre-filling forms, viewing attachments, and accessing workflow history, with the team confirming these features are supported and offering to help configure them.\n    ◦ *Review and Approval Process:* Mayank explained that the platform supports review and approval workflows, allowing forms to be routed to specific users or groups for approval, with the ability to approve or reject applications at each stage.\n    ◦ *Workflow Stage Tracking:* Mayank confirmed that workflow stages can be configured to track the progress of each form, including sending emails and recording actions taken at each stage, which aligns with Randy's requirements for process visibility.\n    ◦ *Pre-Filling and Attachment Handling:* The team clarified that pre-filling forms and handling attachments are supported, and that the review and approval process can be set up to automatically manage these aspects without requiring manual retrieval from Azure storage.\n    ◦ *Use Case Documentation Request:* Mayank requested a detailed use case document from Randy to enable the team to configure and demonstrate the complete workflow journey, including all required features and scenarios.\n• *Next Steps and Communication Channels:* Sudhanshu and Randy agreed on action items for the next meeting, including sharing use case documentation, selecting forms for demonstration, and exploring communication via Teams or Slack for more efficient collaboration.\n    ◦ *Scheduling Next Meeting:* Sudhanshu proposed scheduling the next call for Friday, considering upcoming holidays, and Randy agreed, emphasizing the need for timely follow-up to maintain project momentum.\n    ◦ *Sharing Use Case Documentation:* Randy committed to compiling and sharing documentation, screenshots, and requirements for the forms to be used in the collaborative configuration sessions.\n    ◦ *Exploring Communication Tools:* The team discussed the possibility of using Slack or Teams for asynchronous communication, with Randy preferring Teams due to existing usage in their environment, and Sudhanshu agreeing to check feasibility on their side.\n:todo_done: *",
    "created_at": "2026-01-25T16:47:48.728Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760593625.819359"
  },
  {
    "id": "b2c79a30-f268-40c8-a0b2-1a6ad7839424",
    "source": "slack",
    "text": "*\n• *Batch Importer Demo:* <@W4R5Y3YHX> demonstrated the batch importer service for converting multiple PDFs to adaptive forms asynchronously with error tracking and output management.\n• *Feedback on Batch Importer:* Customer shared use cases for small batch conversions, requested CRX path input, flexible output locations.\n• *Error Handling &amp; Recovery:* Engineering showcased file-level error reporting and the ability to rerun only failed conversions for better debugging and transparency.\n• *Access Token Script:* Engineering reminded Customer to review the shared JWT access token generation script available on Teams.\n• *Unblocked Off-shore team*: Customers off shore team has been trying out import form and had a few queries. Connected with them over teams to resolve those queries and form conversion was successful.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:13.632Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760688547.214749"
  },
  {
    "id": "420119ca-eee0-4825-b3f8-ddcb7c084f4b",
    "source": "slack",
    "text": "*\n• Ford is eager to move to cloud service. They have a mandate to move to Cloud by 2027. \n• They are eager to go for co-innovation and VIP to help them to move to cloud. \n• <@W5HEU5M7Y>, they are expecting a mail from us to confirming that we will help in migrating their XDP (Forms &amp; Output Service use cases) and IC uses cases (including content migration). \n• I have confirmed the same. Let’s discuss this offline and schedule kick-off for VIP after Diwali. \n• This would be a good success story.\ncc: <@W4RSW3ECC>\n:todo_done: *",
    "created_at": "2026-01-25T16:46:13.526Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760711241.211559"
  },
  {
    "id": "b1610bf7-c781-415f-8ff5-afeedd60a45f",
    "source": "slack",
    "text": "*\n*Meeting notes*\n\n*Current Form Workflow and Demonstration:* Randy provided a detailed walkthrough of the current expenditure request form, explaining its workflow, user interactions, and technical limitations, with Sakshi, Sudhanshu, and others asking clarifying questions about form fields, attachments, and approval logic.\n\n*Requirements for Adobe AEM Forms Migration:* Sakshi, Randy, and the team discussed requirements and expectations for migrating the current form process to Adobe AEM Forms, covering workflow rules, data storage, authentication, and integration points.\n\n*Amendment Process for Approved Forms:* Randy and Sakshi explored the process for amending previously approved forms, including how amendments trigger new approval flows and the technical requirements for handling such scenarios in AEM.\n\n*Form Field Behaviour and User Experience:* Sakshi and Randy clarified the expected behaviour of various form buttons and fields, including print, save, amend, and reset, as well as localisation and dynamic field display.\n\n*Project Timelines, QA, and Go-Live Process:* Mayank, Sakshi, and Randy discussed project timelines, the QA and UAT process, and the steps required to move the new form to production, confirming that the process is informal and can proceed quickly once development is complete.\n\n*Future Scope and Parallel Form Development:* Randy and Sakshi agreed to include an additional European form in the scope, with George providing use case scenarios, and discussed the potential for parallel development to accelerate adoption.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:13.420Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760934379.857719"
  },
  {
    "id": "32373e67-93b9-4af0-92ee-53a16afcab37",
    "source": "slack",
    "text": "*\nMeeting notes:\n• *Current Form Workflow and Demonstration:* Randy provided a detailed walkthrough of the current expenditure request form, explaining its workflow, user interactions, and technical limitations, with Sakshi, Sudhanshu, and others asking clarifying questions about form fields, attachments, and approval logic.\n    ◦ *Form Initiation and User Selection:* Randy described how users start a new form by selecting it from a list available via an internal URL, then choose a branch or location, with mandatory fields indicated in blue. The form is primarily in English, but localisation for dates is being considered for future improvements.\n    ◦ *Form Fields and Data Entry:* The form requires users to enter financial details, including total costs, with calculations such as contingency being automatically computed. Both page one and page two are filled by the form filler before submission, and most fields are static or read-only except for a few, such as currency selection.\n    ◦ *Attachments and Supporting Documents:* Users can attach supporting documents, such as spreadsheets, for estimated costs, but attachments are not mandatory. If required attachments are missing, the next approver (typically an accountant) can deny the submission and request the correct documents.\n    ◦ *Approval Workflow and Approver Selection:* The next approver is selected from a list of all email addresses in Outlook, with rules excluding certain roles (e.g., accountants, senior executives) from being chosen. The workflow enforces multiple approval steps, and the process is designed to prevent direct submission to the President or CEO.\n    ◦ *Form Submission and Status Tracking:* Upon submission, the form follows a defined approval path based on the selected approver and amount thresholds. The system tracks the status of each form, including who approved or denied it, and allows users to print or save the form at various stages.\n• *Requirements for Adobe AEM Forms Migration:* Sakshi, Randy, and the team discussed requirements and expectations for migrating the current form process to Adobe AEM Forms, covering workflow rules, data storage, authentication, and integration points.\n    ◦ *Workflow Rules and Approval Logic:* Approval rules are currently defined within a workflow editor, with each form having its own set of rules based on amount thresholds and organisational roles. The team confirmed that these rules can be authored at the form level in AEM, and dynamic approval paths are required, especially for amended forms.\n    ◦ *Data Storage and Integration:* The current system uses Azure SQL Server for storing approver lists and may use Azure BLOB storage for documents of record. There is no hard requirement to move to Azure SQL, but it is the preferred and available option. SharePoint lists are available but have concerns regarding security and speed.\n    ◦ *Authentication and Access Control:* All forms are behind authentication, with no anonymous access allowed. The team expects AEM to support authenticated workflows, ensuring only authorised users can initiate or approve forms (_*ACL is not a blocker for them - they don't have it today, but want to introduce it*_)\n    ◦ *Document of Record and Error Handling:* The document of record is currently stored as a file, and the team discussed a previous error encountered with document generation. Randy agreed to share error details via Teams for further troubleshooting.\n    ◦ *Session Scheduling and Support:* Sakshi proposed scheduling working sessions to assist with environment setup, document of record configuration, and rapid development environment queries. The team agreed to coordinate sessions around upcoming holidays.\n• *Amendment Process for Approved Forms:* Randy and Sakshi explored the process for amending previously approved forms, including how amendments trigger new approval flows and the technical requirements for handling such scenarios in AEM.\n    ◦ *Amendment Workflow Initiation:* Once a form is fully approved, it can be reopened for amendments, typically to adjust costs due to overruns or changes. Only cost fields can be amended; no new items can be added.\n    ◦ *Prefilling and Approval Path:* The amendment process involves creating a new form prefilled with data from the original, with all other fields set to read-only except those being amended. The approval path may change based on the new total amount or organisational changes.\n    ◦ *Dynamic Approver Selection:* The list of eligible approvers for amendments is dynamically generated based on current organisational roles and amount thresholds, ensuring compliance with updated approval policies.\n    ◦ *Technical Implementation Considerations:* The team discussed whether to treat amendments as new forms with linked historical data, and agreed that AEM should support this approach, allowing for flexible and auditable amendment processes.\n• *Form Field Behaviour and User Experience:* Sakshi and Randy clarified the expected behaviour of various form buttons and fields, including print, save, amend, and reset, as well as localisation and dynamic field display.\n    ◦ *Print and Save Functionality:* The print button is available at all stages and generates a printable version of the form, which may differ from the web version. The save button is primarily for the form filler to save progress locally before submission.\n    ◦ *Dynamic Field Display:* Fields such as contingency, outside labour, and year rows are dynamically displayed based on user input, and the printable version adapts accordingly.\n    ◦ *Reset and Amend Buttons:* The reset button clears the form for the filler, while the amend button is used post-approval to initiate the amendment process. The team agreed to revisit the amend button's implementation in future sessions.\n• *Project Timelines, QA, and Go-Live Process:* Mayank, Sakshi, and Randy discussed project timelines, the QA and UAT process, and the steps required to move the new form to production, confirming that the process is informal and can proceed quickly once development is complete.\n    ◦ *Estimated Timelines:* Randy indicated that the team aims to go live as soon as a working form is ready, ideally before the end of the year, with the process being repeatable for other forms.\n    ◦ *QA and UAT Process:* QA will be performed by Randy, Tim, and George, with UAT handled by accountants and senior managers. The process is expected to take a few weeks at most, with no need for external validation.\n• *Future Scope and Parallel Form Development:* Randy and Sakshi agreed to include an additional European form in the scope, with George providing use case scenarios, and discussed the potential for parallel development to accelerate adoption.\n    ◦ *Parallel Form Implementation:* The team will work on the primary form as the main scope for the VIP engagement, while also preparing to develop a European form in parallel, leveraging the established workflow and technical setup.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:13.312Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760934412.685319"
  },
  {
    "id": "c0acd625-ac05-47d0-adcc-72b741469e51",
    "source": "slack",
    "text": "*\nAnurag, Sudhanshu and Khushwant visited the Maruti factory on Friday. We went to the Innovation Gym first where the Adobe team sites (~ 6-8 team members sit in that office). Some quick notes/pointers which can help during the Maruti day on 7th:\n• Main discussion was with Sr VP of Service, Ashok San (they follow the Japanese culture and suffix San when referring to each other).\n• Ashok San is very *data oriented* - most of his queries were around the impact - and how much *quantitative impact* the products were having.\n• When talking about agents - Ashok San was raised queries around *how the specific agent was helping the business*.\n• Ashok's San's mail goal seems to be increasing the outreach to customers - and his point was that - Maruti has data of customers who are coming to their site (*online* and *offline*) - how they could increase this outreach. \n    ◦ Sumit Gupta (Delivery partner) - talked about RTCDP (which has both online and offline data) - and profile stitching - and it could help identify users - once they click on a promotion.\n    ◦ Anurag talked about the fact that with agentic traffic - the content might not be visible to agents - and outreach may be impacted (their main concern was lot of traffic was going to consolidators). They were surprised - were not aware of this, and Anurag proposed we could demo this on Maruti day.\n• Ashok San was surprised why these features/details were not shared with them earlier - and Chinmay or Sumit mentioned that they planned to improve the traffic/site part first, and then move to forms (after reviewing impact). Ashok San highlighted that *in Maruti - we do not do things sequentially, rather in parallel* (for speed).\n• We have Forms opportunity is different areas - including:\n    ◦ Services\n    ◦ TrueValue Dealership (dealership side)\n    ◦ Insurance (on back burner)\n    ◦ Dealer connect\n• Some of these are quite old (~ 10 years), and using old technologies. Some have huge DB with limited resources - and not fix issues (they mentioned - its like fitting 6 airbags in old WagonR).\n• They have MTAB app <https://play.google.com/store/apps/details?id=in.mtab.android.marutisuzuki&amp;hl=en_IN> (similar exists on Apple - which uses same backend). \n    ◦ App crashes - data loss\n    ◦ No offline option\n    ◦ Integrates with multiple services which they have created in-house (app and services created by their team)\n    ◦ Some of these services allow clicking photo of different car sides - which auto-detects accidental damages - and needed for pick-up and delivery checks.\n• They are very much interested in WhatsApp - and how it could help get confirmation without service centre call - for confirmation on Service Estimates (Maruti leadership wants all communication through a common WABA account)\n• When Anurag was demoing form creation Ashok San asked asked - why we cant create it through a prompt - and Anurag moved to next demo which highlighted the feature (so they are quite interested in Agentic part)\n• The app (which has form with 200+ fields) is updated regularly - 5-10 enhancements in a month - and recent enhancements/changes are related to adding support for Electric cars (changes are done - to be tested/go-live) - but parallel flow is created - and an enhancement takes around a week or two.\n• They asked about how much time it would take - for this 1 time movement to AEM Forms.\n• Current WhatsApp groups used by Maruti service centres are local - and Maruti does not have that info - they want to streamline that - so that Maruti has more details/insights.\n• Ashok San asked - if the Adobe team was aware of the overall flow and stakeholders (not specific to the service flow - but overall - when a car comes to service - then the overall flow between the various stakeholders - customers, dealers, Maruti).\n    ◦ Satyajeet showed how Adobe was working with different team to understand the process - they showed an excel which captures the information they are trying to captures.\n    ◦ We proposed to have another connect if needed post Diwali for getting more insights in the process.\n• Saving time in process is critical for them - they even mentioned that they are working with another company to review the time spent on different steps in the process - from car coming it to exit - to identify areas of improvement.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:13.205Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1760938155.973389"
  },
  {
    "id": "46e3552c-4e4a-46ed-a64f-ff6f68cc35a3",
    "source": "slack",
    "text": "*\n• *Testing and Validation of Custom Functions for ECID, FCLID, GCLID:* Andy, Mayank, Christy, and the team discussed ongoing testing of custom functions for ECID, FCLID, and GCLID, including the need for development team review and validation of cookie-based retrieval methods, with Shraddha preparing a sample function for ECID and Christy agreeing to verify cookie values in production.\n• *Documentation of Custom Changes and Deployment Processes:* Mayank, Sarah, Andy, and Christy discussed the need for comprehensive documentation of all custom changes, including technical and business details, to facilitate smoother deployments across environments, with Mayank's team agreeing to draft the technical documentation and Christy's team to supplement with environment-specific information.\n• *Multilingual Form Translation and Integration in AEM:* Andy, Sakshi, Christy, Ben, and Mayank discussed the process for translating forms into multiple languages using AEM, including the use of dictionaries, translation providers, and embedding translated forms, with action items to set up Microsoft Translation and share relevant documentation.\n• *Reusable Form Fragments and Authoring Restrictions:* Andy, Sakshi, Mayank, and Sarah discussed strategies for locking down required form fields using fragments or custom components in AEM, aiming for reusability without strict security, and agreed to schedule a demo in the next meeting to illustrate the setup.\n• *Theme Integration for Forms:* Andy and Mayank briefly discussed the need to address theme integration for forms, noting that the current approach uses existing website styling, with plans to involve Ben McKnight and cover this topic in the next meeting.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:13.099Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1761302429.679959"
  },
  {
    "id": "ab246699-0cac-4034-92be-e0d6fa281b1d",
    "source": "slack",
    "text": "*\n• *Current Forms Usage and Integration Plans:* Manju, Pavan Kumar Ainampudi, and Ashajyoti from the Micron team, along with Mayank, Vijay Kumar, and Anurag from the AM Forms team, discussed the current use of AEM forms, the integration with Marketo and Salesforce, and upcoming plans to migrate to Microsoft Dynamics 365 and expand form usage for events and lead generation.\n    ◦ *Existing Forms and Integrations:* Manju explained that Micron currently uses a small number of forms for registration, contact, and technical sales, with data initially routed to Salesforce and then synced to Marketo. The team is consolidating forms and planning to migrate CRM systems from Salesforce to Microsoft Dynamics 365, which is expected to improve two-way sync capabilities.\n    ◦ *Event and Campaign Use Cases:* The team uses Marketo landing pages for event registrations and aims to unify the experience on <http://micron.com|micron.com> for consistency. Events such as CES and expos require extensive form usage to capture leads and contacts from partners and customers.\n    ◦ *Marketo Campaigns and Retargeting:* Manju confirmed that Marketo campaigns are leveraged for retargeting different customer segments using smart lists, and that these are a core part of their marketing automation strategy.\n    ◦ *Future Roadmap and Expansion:* While the primary focus remains on lead generation and event forms, Pavan Kumar Ainampudi mentioned that additional use cases are under discussion for the future, though details are still being finalized.\n• *Migration from Foundation to Core Components:* Pradeep, Anurag, and Vijay Kumar discussed the migration strategy from foundation components to core components for forms, including technical considerations, migration utilities, and the impact on styling and business logic.\n    ◦ *Migration Utility Limitations:* Anurag clarified that the current migration utility can migrate content but not business logic or custom code, so teams should evaluate the complexity of their forms before migrating.\n    ◦ *Styling and Customization Differences:* Pradeep asked about style system compatibility, and Anurag explained that team representation and styling may differ between foundation and core components, suggesting a separate discussion with the engineering lead for migration specifics.\n    ◦ *Headless and External Application Support:* Vijay Kumar and Pradeep discussed embedding forms in external applications using headless capabilities, with Vijay confirming that both core components and edge delivery forms support headless integration for frameworks like React and Angular.\n    ◦ *Migration Assessment and Next Steps:* Mayank and Pradeep agreed to assess the time and effort required to migrate approximately 40 forms, with Pradeep offering to provide access to development instances and custom JS/CSS files for review by the AM Forms team.\n• *Forms Experience Builder and Rule Editor Challenges:* Ashajyoti presented several challenges encountered with the Forms Experience Builder, particularly with the rule editor’s validation logic, editing capabilities, and navigation after submission, prompting the AM Forms team to request form samples for debugging.\n    ◦ *Rule Editor Validation Issues:* Ashajyoti described intermittent problems where the rule editor fails to validate or allow editing of rules, especially when creating custom validation logic for form fields.\n    ◦ *Navigation and Post-Submission Actions:* Ashajyoti noted that navigation after form submission is limited when forms are embedded via iframes, requiring custom code to achieve desired redirection, and suggested enhancements for more seamless navigation handling.\n    ◦ *Custom JS for Field Value Handling:* Ashajyoti explained the need to write custom JavaScript to update DOM values for input fields, as the foundation components do not automatically update the value attribute, leading to additional development overhead.\n    ◦ *Debugging and Next Steps:* The AM Forms team requested that Ashajyoti share problematic forms and related code samples to facilitate debugging and provide targeted recommendations, with follow-up actions to review and address the highlighted issues.\n• *Headless Forms Integration and Documentation:* Arneh, Mayank, and Pavan Kumar Ainampudi discussed the availability of headless integration for forms, sharing documentation and starter kits for React and Angular, and confirming that Marketo integration features are supported in headless scenarios.\n    ◦ *Headless Integration Capabilities:* Mayank and Vijay Kumar confirmed that both core components and edge delivery forms support headless integration, allowing forms to be embedded in external applications using JSON output and starter kits for React and Angular.\n    ◦ *Marketo Integration in Headless Mode:* Pavan Kumar Ainampudi asked if Marketo integration features are available in headless mode, and Mayank confirmed that submission endpoints and integration logic remain consistent regardless of the rendering approach.\n    ◦ *Documentation and Resources:* Arneh provided links to developer documentation and a code playground for headless forms integration, ensuring the Micron team has resources to reference after the meeting.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.984Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1761548178.630329"
  },
  {
    "id": "9d1764bb-1423-4d8c-800a-fa99df1e1771",
    "source": "slack",
    "text": "*\nCustomer is creating a new business division , Fedex-Freight. They have accenture as their partner who are implementing the forms for them. They are looking into creating multiple forms. They have forms authored via UE and delivered via edge.\n\nThey were facing issues in submission from edge. they wanted to do email submission. We have solved the issue by enabling advanced networking on their setup.\n\n<@W4RU4N66R> also demoed them forms ai assistant, showcasing features like screenshots to forms , Rules , Conversational forms etc.\n\nThe customer acknowledged that they might look into these features in future forms.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.879Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1761622645.845869"
  },
  {
    "id": "ec4e805a-ab76-45d3-8853-875613431708",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Repository Structure and Code Walkthrough:* Sakshi provided an overview of the restructured repository for cloud deployment, explaining the separation between immutable and mutable content, and highlighted how OSGI configurations, custom components, and client libraries are managed, with input and clarifying questions from Randy Reisling and others.\n    ◦ *Repository Modularization:* Sakshi explained that the repository is divided into immutable content (custom components, client libraries, developer activities) and mutable content (author activities, templates, sample content), allowing for selective inclusion in CI/CD pipelines.\n    ◦ *OSGI Configuration Management:* Sakshi described how OSGI configurations are managed in the UI.config directory, with separate files for different environments (author, publish), and emphasized the use of environment variables for sensitive data like client secrets.\n    ◦ *Custom Functions and Client Libraries:* Sakshi demonstrated how JavaScript functions can be added to client libraries, making them available in the rule editor UI for form authors, and provided an example of a custom function for use in forms.\n    ◦ *Pipeline and Branch Setup:* Sakshi showed the setup of development branches and pipelines, explaining how different branches can be targeted for deployments and how full stack and frontend pipelines are configured.\n• *Azure Email Integration and OAuth Configuration:* Abhishek and Sakshi, with support from Sudhanshu and Chad, guided Randy Reisling and the team through the process of configuring Azure OAuth for email integration, including setting up Azure Active Directory, registering applications, defining scopes, and managing secrets and tokens.\n    ◦ *Azure App Registration and Scopes:* Abhishek outlined the steps for registering an application in Azure Active Directory, specifying required scopes (SMTP.Send, openid, offline_access), and setting up redirect URLs for OAuth authentication.\n    ◦ *Secret and Token Management:* The team discussed how to generate and store client secrets and refresh tokens, with Abhishek providing a Java utility and video tutorial to help generate and validate tokens, and Sakshi clarifying the use of environment variables for secure storage.\n    ◦ *Configuration in Cloud Manager:* Randy, with guidance from Sakshi and Abhishek, was walked through adding the necessary configuration variables in Cloud Manager, including naming conventions and the distinction between client secret and refresh token.\n    ◦ *Troubleshooting Token Generation:* Chad and Abhishek collaborated to resolve issues with generating the refresh token, identifying problems with URL formatting (removal of angular braces) and scope definitions, and confirming the correct use of client secret values.\n    ◦ *Token Expiry and Usage:* Abhishek explained that refresh tokens generally do not expire if used regularly, but will expire after 90 days of inactivity or if password or policy changes occur.\n• *Advanced Networking and Environment Region Configuration:* Sudhanshu, Sakshi, and Abhishek assisted Randy Reisling and Chad in understanding and configuring advanced networking in Cloud Manager, focusing on opening SMTP ports, selecting appropriate regions (Canada vs. US), and managing environment deletion and recreation to meet GDPR and organizational requirements.\n    ◦ *Advanced Networking Purpose:* Sudhanshu clarified that advanced networking is required to open ports beyond HTTP/HTTPS, such as SMTP for email and specific ports for Azure SQL Server connections.\n    ◦ *Region Selection and GDPR Concerns:* Randy and Chad raised concerns about environment region (Canada vs. US) due to GDPR and German Work Council requirements, with Sakshi and Sudhanshu confirming that environments can be recreated in the desired region and that region selection impacts available networking options.\n    ◦ *Environment Deletion and Recreation:* The team discussed the process for deleting and recreating dev and prod environments to enable region selection, with Sakshi advising written consent for prod deletion and confirming that repositories and code can be reused.\n    ◦ *Permission and Role Requirements:* The group reviewed necessary permissions (business owner, deployment manager) for advanced networking configuration, troubleshooting access issues and confirming roles in the admin console.\n    ◦ *Flexible Port Egress Setup:* Attempts were made to configure flexible port egress, with troubleshooting around grayed-out options, deletion of existing configurations, and documentation references for correct setup.\n• *Dynamic Dropdown Population and Custom Functions in Forms:* Sakshi demonstrated the implementation of dynamic dropdown population in forms using custom JavaScript functions, addressing a previously open support ticket and showing how client libraries and pipelines are used to deploy these functions.\n    ◦ *Custom Function Implementation:* Sakshi showed a JavaScript function that extracts property values from a JSON array for use in dropdowns, explaining how it can be invoked via event payloads or hardcoded data.\n    ◦ *Client Library Deployment:* The process for adding custom functions to client libraries and making them available in the rule editor was demonstrated, including the use of annotations and pipeline deployment.\n    ◦ *Integration with Data Sources:* Sakshi explained that if a service returns an array of strings (e.g., from SQL Server), it can be directly assigned to the dropdown enum, whereas more complex data (e.g., from SharePoint) may require transformation.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.771Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1761627924.197009"
  },
  {
    "id": "220fa82e-fed0-44ef-925f-e0e2cd75b020",
    "source": "slack",
    "text": "*\n• *URL Rewriting Issue:* Customer reported embedded form failures caused by model.json paths not being rewritten properly through Cloudflare and AEM filters.\n• *Cloudflare Routing Rules:* Andy described how Cloudflare is configured to route requests with specific prefixes (such as /aem-form) to the appropriate AEM instance based on the environment (dev, QA, prod), ensuring that requests are directed correctly depending on the deployment stage.\n• *Embed Logic Review:* Engineering reviewed loadAdaptiveForm logic and confirmed script sequencing follows Adobe’s guidance but fails for core components.\n• *Core-Component Behavior:* Issue occurs only in core components; foundation components load correctly due to differing callback handling.\n• *Blocker Confirmation:* Customer confirmed all current forms are blocked from UAT due to unresolved routing and model.json failures.\n• *Form Conversion Progress:* Three forms have passed development testing successfully; QA and UAT are on hold until the routing issue is fixed.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.666Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1761722933.589879"
  },
  {
    "id": "220a4aee-2cb3-42ce-9c62-4049262584db",
    "source": "slack",
    "text": "*\nThis session was targeted at the marketing team at NFL.\n\n• Introduced the AEM forms product offering and its various capabilities. \n• Followed by a demo of authoring an already live NFL form in the universal editor, showcasing various capabilities like configuring AEP schema and submit action, authoring content via the experience builder, auto-mapping schema elements to form fields, authoring a custom component and managing assets in dam etc.\n• The NFL team was really impressed with the Experience Builder capabilities and how simple authoring is in UE.\n• Forms team clarified their queries related to integrating pre fill, experimentation, adobe analytics, embedding UE authoring form in a non AEM site etc.\n• The NFL team also expressed their interest in Form Optimiser offering to enhance the conversion for their forms\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.561Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1761800607.873069"
  },
  {
    "id": "4cc38533-a83a-46e4-baf8-26b1ee7fa414",
    "source": "slack",
    "text": "*\n*Cloudflare Form Submission Routing and Security:* Andy Kluck, Christy, and Sarah Warzecha discussed the recent Cloudflare configuration that now globally routes form submissions correctly and blocks potential SQL injection attempts, with Christy and Natalie Perscal as the main contacts for any issues.\n\n*ECID, FBCLID, and GCLID Field Population in Forms:* Andy Kluck, Christy, Mayank, and Shraddha reviewed the technical approach for populating ECID, FBCLID, and GCLID fields in AEM forms, focusing on cookie-based retrieval, the need for async function support, and the requirement for code review before production deployment.\n\n*Scaling and Environment Preparation for AEM Forms:* Andy Kluck, Mayank, and Christy discussed the steps required to scale the AEM forms solution to new environments, including documentation, access provisioning, and the need to repeat configuration steps for each environment.\n\n*Microsoft Translation Connector Setup:* Andy Kluck, Christy, Mark, and Jonathan discussed the status and requirements for setting up the Microsoft Translation connector for Mercury Marine, agreeing to coordinate offline to obtain the necessary key and complete the configuration.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.455Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762139700.650049"
  },
  {
    "id": "643a2965-8d6e-45c4-8a29-82d6aa3a64d7",
    "source": "slack",
    "text": "*\n*ECID Function Deployment and Rule Modification:* Shraddha updated Andy and Joseph on the deployment of the new ECID async function, which will require a subsequent rule modification once Christy deploys the code, and clarified that only the ECID field will change while FBCID and GCID will continue to be read from cookies.\n\n*Cloudflare Blocking Issue with New Forms:* Andy raised the recurring issue of Cloudflare blocking submissions for new forms and discussed the need for a permanent solution with Shraddha, indicating plans to address it further with Christy.\n\n*Forms Authoring and Fragment Demo Discussion:* Shraddha and Andy discussed the need for a forms fragment demo, with Andy concluding that, based on recent experience, the demo is unnecessary as the forms will remain static and permissions-based within AEM.\n\n*Documentation Updates and Sharing:* Shraddha informed Andy that they are updating the project documentation to include more details and will share the completed version via email once finished.\n\n*Testing, Environment Migration, and Ownership Planning:* Andy outlined the next steps for testing, migrating forms to higher environments, ensuring access, and clarifying ongoing ownership and maintenance responsibilities within AEM and Marketo.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.349Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762139888.047429"
  },
  {
    "id": "7b0ae183-7d15-4187-829f-391e44a80542",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Database Integration and Networking Configuration:* Shraddha, Sakshi, Randy, and Chad Roberts discussed the technical requirements and steps for connecting AEM to Azure SQL Database, focusing on advanced networking configurations, egress settings, and firewall rules, with action items assigned to both teams for further investigation and setup.\n    ◦ *Egress Configuration Requirements:* The team reviewed the need for dedicated egress to obtain a static IP address for whitelisting in Azure, and discussed the limitations of flexible port egress, which is required for SMTP but does not provide a fixed IP range. Sakshi and Shraddha agreed to investigate if both dedicated and flexible egress can be enabled simultaneously or if domain whitelisting is possible.\n    ◦ *Firewall and Connectivity Settings:* Shraddha guided Randy through the Azure portal to review current firewall rules and connectivity settings, confirming that only IP addresses (not domains) can be whitelisted, and highlighted the need to switch the connectivity mode to 'proxy' for AEM integration.\n    ◦ *Direct Database Creation and Access:* Chad Roberts clarified that their current setup involves direct SQL DB creation without a server layer, which complicates networking configuration. The group agreed to explore direct connection options and document the process, as current integrations rely on a server intermediary.\n    ◦ *Action Items and Next Steps:* Shraddha and Sakshi will investigate the feasibility of switching from flexible to dedicated egress and the implications for SMTP/email integration, while Chad and Randy are tasked with setting up secret variables and adjusting connectivity settings in Azure and AEM. Updates will be shared via email and Teams.\n• *Environment Variable and Secret Management in AEM:* Sakshi and Randy discussed best practices for managing sensitive credentials in AEM, recommending the use of environment variables for secrets such as SMTP tokens and database passwords, and provided guidance on configuring these in Cloud Manager.\n    ◦ *Storing Secrets Securely:* Sakshi advised Randy to revert storing SMTP credentials directly in the repository and instead configure them as environment variables in Cloud Manager, ensuring restricted access and improved security.\n    ◦ *Environment Variable Usage:* The team clarified that environment variables should be used for secrets in both development and production environments, and Sakshi demonstrated how these variables are referenced in configuration files and picked up by AEM during deployment.\n    ◦ *Configuration File Management:* Sakshi explained that configuration changes should be made in the code repository and deployed via the pipeline, rather than directly in the UI, to ensure consistency across local and cloud environments.\n• *AEM Deployment Workflow and Pipeline Process:* Randy, Sakshi, and Harman discussed the end-to-end process for deploying code changes from local development to the AEM cloud environment, including Maven builds, repository management, and pipeline execution.\n    ◦ *Local Development and Build:* The group reviewed the use of Maven (MVN clean install) for building local changes, with Sakshi and Harman providing troubleshooting steps for Java version management and build errors.\n    ◦ *Repository and Pipeline Usage:* Sakshi explained that after committing changes to the cloud repository, the deployment pipeline must be run to push updates to the development, staging, or production environments, clarifying the distinction between non-production and production pipelines.\n    ◦ *Role Assignments and Access:* Randy was guided through assigning developer roles to Harman and Shraddha in AEM, with Sakshi specifying the minimum required permissions and Harman providing additional tips for user management.\n• *AEM Workflow and Form Integration Progress:* Harman updated the team on the status of workflow and form integration in the AEM dev environment, describing a test workflow and form setup, and outlined plans for further development once foundational integrations are complete.\n    ◦ *Test Workflow Implementation:* Harman described a test workflow with two steps—task assignment and Java code execution—linked to a form submission, and confirmed that logs are available in Splunk for monitoring.\n    ◦ *Next Steps for Forms:* The team agreed to revisit form and workflow development after resolving the SQL and email integrations, with Harman encouraging Randy to explore the current setup and share questions for future sessions.\n• *Documentation, Onboarding, and User Role Clarification:* Randy raised concerns about the complexity of AEM documentation and the lack of clear onboarding materials, prompting Harman to share relevant links and offer to address specific queries via email or chat.\n    ◦ *Documentation Gaps and Orientation Needs:* Randy expressed difficulty understanding user roles, permissions, and deployment steps due to fragmented documentation, and suggested that an orientation session would have been beneficial at project start.\n    ◦ *Support for User Role Setup:* Harman provided documentation links and offered to answer specific questions about user roles, permissions, and workflow setup, encouraging the team to share issues for targeted assistance.\nFollow-up tasks:\n• *Azure SQL and Email Integration Networking:* Verify if both dedicated and flexible egress can be configured simultaneously for Azure SQL and email integration, or if domain whitelisting is possible for direct database connections without SQL Server. (Speaker 1)\n• *Cloud Manager Secret Variable Setup:* Set up the secret variable for Azure SQL database connection in Cloud Manager environment variables. (Chad Roberts)\n• *Azure SQL Connectivity Configuration:* Update Azure SQL connectivity settings to use proxy connections as required for AEM integration. (Chad Roberts)\n• *SMTP Credentials Security:* Revert SMTP password and authentication token from repository to environment secrets and configure them as restricted variables. (Randy)\n• *Sample Code Sharing for SQL DB Connection:* Share sample code or details on how the current applications are interacting with Azure SQL DB directly (outside of AEM) to assist integration efforts. (Randy)\n• *Developer Access Provisioning:* Provide Harman and Shraddha with developer roles and environment access in AEM as requested. (Randy)\n• *Advanced Networking Configuration Exploration:* Explore and update the advanced networking configuration in Cloud Manager to support port forwarding for Azure SQL (port 1433) and document any required changes. (Speaker 1)\n• *Documentation Improvement Request:* Document and share a straightforward step-by-step guide for deploying changes from local development to cloud environments, including pipeline usage and user role setup. (Randy)\n• *Workflow and Form Use Case Progress:* Continue building and documenting the first form and workflow as a template for future use cases, ensuring progress is tracked and communicated to the team. (Harman)\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.240Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762237903.056619"
  },
  {
    "id": "6173b506-1123-46c0-bc55-90cea9666ac6",
    "source": "slack",
    "text": "*\n*ECID Deployment and Rule Editor Updates:* Shraddha, Christy, and Andy discussed the deployment status of the ECID code, with Christy confirming the ECID deployment is pending and planning to notify the team upon completion, after which Shraddha will update the rule editor and share changes via e-mail for further testing.\n\n*Form Submit Tracking and Satellite Tracking Discussion:* Andy and Sarah Warzecha raised the need for reliable form submit tracking for analytics, discussing past use of satellite tracking and seeking Shraddha's guidance on alternative mechanisms, with plans for Sarah to provide more information via e-mail and Shraddha to investigate further.\n\n*Form Styling and Theme Implementation for Multiple Brands:* Andy, Sarah Warzecha, and Shraddha discussed the need to develop scalable form styling solutions for different brands, moving away from previous workarounds and planning to translate ECL styling from Figma into AEM form themes, with internal sessions proposed for further exploration.\n\n*Deployment Planning and Documentation for Stage and Production Environments:* Andy, Shraddha, and Christy coordinated on planning the deployment of forms to stage and production environments, discussing the status of documentation, timing, and the need for collaborative sessions to ensure all steps are captured and executed, with Speaker 1 preparing an Excel sheet to track changes.\n\n*Marketo Connector Setup and Form Building Access:* Andy and Shraddha confirmed that Marketo connectors are set up for both stage and production environments, but noted that access to AEM forms is pending, preventing form creation until deployment is complete.\n\n*Page Policy and Client Library Optimisation:* Shraddha, Andy, and Christy discussed optimising page policies by removing unnecessary client libraries and form-related properties from pages without forms, with Christy noting the need to identify relevant pages and possibly define new templates.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.135Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762311254.939099"
  },
  {
    "id": "ec911712-3ef9-47bd-a5e4-e90cad6519eb",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Current Forms Environment and Integration Challenges:* Tony J Fenner, Stephen, Brad R Tuckner, and John described the current forms landscape at Mayo Clinic, highlighting the use of multiple platforms (AEM forms, fillable PDFs, HTML forms), the lack of integration with Epic, and the need for a more unified, user-friendly, and efficient forms management system.\n    ◦ *Forms Platform Fragmentation:* Stephen and Tony J Fenner explained that Mayo Clinic currently uses three main platforms for forms: AEM forms (about 70 forms), fillable PDFs (hundreds to thousands), and HTML forms (over 5,000), with each platform serving different levels of form complexity. This fragmentation leads to inefficiencies and inconsistent user experiences.\n    ◦ *Epic Integration Limitations:* Tony J Fenner and Stephen discussed that the current on-prem solution has minimal clinical integration, with forms accessed via links from Epic but lacking embedded workflows or patient context transfer. The team expressed a desire for tighter integration, such as launching forms within Epic with pre-filled patient and provider data.\n    ◦ *User Experience Goals:* John and Stephen emphasized the need for a modern, guided, and simple user experience for form completion, drawing analogies to TurboTax, where users are guided through a process and the system generates the required official documents at the end.\n    ◦ *Governance and Rogue Solutions:* Brad R Tuckner highlighted the importance of a managed forms program to maintain high standards and consistency, noting that staff have begun adopting less expensive, unofficial solutions, which undermines governance and increases urgency for modernization.\n• *Modernization Strategy and Platform Consolidation:* Arun, Stephen, John, and Brad R Tuckner discussed strategies for consolidating forms onto a single platform (AEM forms), prioritizing high-value use cases, and leveraging reusable components to improve scalability, cost-effectiveness, and maintainability.\n    ◦ *Platform Consolidation Benefits:* Arun described the advantages of consolidating all forms (marketing, clinical, administrative) onto AEM forms, including the ability to manage multiple use cases, separate or combine programs as needed, and leverage features like reusable form fragments and templates.\n    ◦ *Reusable Components and Templates:* Arun and John discussed the use of reusable form fragments and templates within AEM forms, which would allow the team to create modular, maintainable forms and provide a consistent user experience across different use cases.\n    ◦ *Migration Prioritization:* John and Stephen suggested starting the modernization effort with high-impact use cases, such as patient consent and authorization forms, to demonstrate value and build momentum for broader migration.\n    ◦ *Cost and Pricing Considerations:* Stephen and John raised concerns about per-submission pricing for simple forms, emphasizing the need for affordable solutions, especially for high-volume, low-complexity forms, and discussed the possibility of using different SKUs or negotiating discounts.\n• *Technical Requirements and Data Integration:* Sakshi, Tony J Fenner, and John explored technical requirements for data handling, including the use of XML and JSON, barcode integration for lab orders, and the need for flexible data export and workflow capabilities.\n    ◦ *XML and JSON Data Handling:* Sakshi asked about the transition from XML to JSON for data export; Tony J Fenner clarified that while XML is currently used for certain integrations (e.g., supply chain), the team is open to adopting JSON for modernization, provided legacy integrations are maintained.\n    ◦ *Barcode and Order Matching:* Tony J Fenner described the workflow for lab orders, where a fillable PDF is printed and included with samples; the ideal future state would embed an ID or barcode in the document to enable automated lookup and eliminate manual data entry.\n    ◦ *Workflow and Approval Processes:* Tony J Fenner explained that some forms, such as supply chain requests, involve approval workflows with human-in-the-loop steps, managed via J2EE workflows in the current on-prem environment.\n• *Use Case Identification and Next Steps:* Arun, Tony J Fenner, John, and Stephen agreed to focus initial modernization efforts on high-value forms (e.g., patient consent and authorization), requested sample forms for further analysis, and coordinated scheduling for the next meeting to discuss migration paths and technical demonstrations.\n    ◦ *Sample Forms for Analysis:* Arun requested URLs or examples of representative forms (especially consent and authorization forms) to tailor future discussions and demonstrations; Tony J Fenner agreed to provide these samples.\n    ◦ *Meeting Scheduling:* The group discussed scheduling the next session to allow time for preparation and to accommodate holidays, ultimately agreeing to coordinate with Kelly to find a suitable date, with Tony J Fenner identified as a required participant.\n    ◦ *Focus on High-Impact Use Cases:* John and Stephen reiterated the strategy of starting with a narrow, high-value use case (e.g., consents and authorizations) to demonstrate ROI and build a foundation for broader modernization.\n• *Storefront and End-User Access Improvements:* Stephen presented the vision for a unified forms storefront, where users can access all forms and publications through a single interface, regardless of underlying technology, to streamline workflows and reduce confusion.\n    ◦ *Unified Catalog Access:* Stephen described the goal of providing a single searchable catalog for all forms and publications, allowing users to access any item without navigating multiple platforms or contexts.\n    ◦ *Consistent User Pathways:* The team discussed the importance of ensuring that users are not forced into different workflows based on form complexity or platform, aiming for a seamless experience across the entire forms library.\nFollow-up tasks:\n• *Sample Forms for Modernization Use Cases:* Share a few sample URLs of the simpler forms (e.g., consent and authorization forms) that will serve as initial use cases for modernization to help tailor future discussions and demos. (Tony J Fenner)\n• *Next Meeting Scheduling:* Coordinate with Kelly to find a suitable date and time for the next meeting, ensuring Tony's required attendance and accommodating other key participants' schedules. (the team)\n• *Storefront Context Sharing:* Package and send screenshots or a PDF of the next iteration of the storefront to provide context for the universal forms environment discussion. (Stephen)\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:12.026Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762407925.414709"
  },
  {
    "id": "0e71eca0-fc28-4731-bbae-dd1d48336d23",
    "source": "slack",
    "text": "*\n• *Transition from Marketo to AEM Forms: Analytics Tracking:* Andy, Mayank, Heidi, Mark, and Jonathan discussed the transition from Marketo to AEM forms, focusing on ensuring analytics tracking (including Adobe Analytics and Google Analytics) is maintained and properly configured during and after the migration.\n• *Form Styling and Theme Implementation Across Brands:* Andy, Jonathan, Mark, Mayank, and Joseph discussed the challenges and requirements for form styling and theme implementation when migrating from Marketo to AEM forms, especially regarding the use of Figma designs, CSS variables, and the ECL (Enterprise Component Library) for multiple brands.\n• *Permissions and Access for Form Development:* Andy, Mayank, Mark, and Jonathan addressed issues related to permissions and access for creating and editing forms in different environments, identifying the need for proper group assignments and coordination with Christy to resolve access limitations.\n• *Multi-Brand Form Data Routing and Configuration:* Andy, Mayank, and Mark discussed the setup and configuration of Marketo connectors for multiple brands, clarifying how forms should be routed to different data sources and the implications for form duplication and theming.\n• *Next Steps and Open Items:* Andy, Mayank, and Joseph outlined the next steps, including resolving outstanding permissions, planning for higher environment rollouts, coordinating with Christy and Shraddha, and validating the scalability of form styling and analytics across brands.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.920Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762496766.537899"
  },
  {
    "id": "21ee6aac-b982-49c9-9a02-85c98574bc2c",
    "source": "slack",
    "text": "*\n*Dynamic Client Letter Generation Use Case:* Naveen Sharma described the need to generate dynamic client letters reflecting account changes, and discussed with Chris how Adobe tools could support a proof of concept (POC) for this workflow, including data binding and document generation.\n\n*Adobe Interactive Communication Editor Capabilities:* Chris demonstrated the Interactive Communication (IC) editor to Naveen Sharma, outlining its features for template creation, data binding, and dynamic PDF generation, and discussed licensing requirements and roadmap enhancements.\n\n*Feature Enablement and Next Steps for POC:* Chris and Naveen Sharma discussed the steps required to enable the IC editor feature in Naveen's environment, agreed on sharing environment details, and planned a follow-up session to support the POC and demo to leadership.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.815Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762512398.594299"
  },
  {
    "id": "6eebc535-9909-42cb-8251-8805c8733082",
    "source": "slack",
    "text": "*\nFord is planning to migrate their Interactive Communications (IC) from AEM Forms 6.5 to AEM Forms on CS.\n• Current Deployment and Environment Details:\n    ◦ Approximately 700 existing ICs.\n    ◦ Batch generation use case is in place.\n    ◦ Output Service is being utilized.\n    ◦ No Agent UI use cases.\n    ◦ FDM data sources are MS SQL and PostgreSQL.\n    ◦ Data merge is performed using JSON.\n    ◦ Ford has around 70 XDPs.\n• Ford's ask to migrate existing ICs to the CS and to enable the creation of new ICs.\n• Sandbox environment has been procured and set up.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.710Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762793715.280409"
  },
  {
    "id": "6f78462f-7c05-4216-8e38-3a8f87533c7a",
    "source": "slack",
    "text": "*\nAbbott is encountering multiple conversion issues, as detailed in <https://wiki.corp.adobe.com/display/lc/PDF+Generator+Support+for+Office+2021+and+Acrobat+DC|this wiki page>\n, during their environment upgrade from *Windows Server 2016 + Office 2016 + Acrobat Classic* to *Windows Server 2022 + Office 2021 + Acrobat DC*.\nAs outlined in the wiki, workarounds are available for the reported issues, and Abbott has agreed to adopt the approach of running the AEM server interactively (from the command line).\nPreviously, the customer required an exception approval to operate the server in command-line mode due to security restrictions. However, in their recent update, Abbott confirmed that this exception approval is no longer required.\n\nWe have discussed the following four options with the customer:\n1. *Run server in command-line mode* – The customer has tried this approach and is currently performing testing in their environment. They have made progress with this approach and are continuing their validation to complete testing.\n2. *Multi-threaded support with single user* – As mentioned in the <https://wiki.corp.adobe.com/display/lc/Action+Plan+for+Office+to+PDF+Conversions+and+PDF+Generator+Roadmap|PDF Generator Roadmap>, we implemented and shared update about solution that enables multi-threaded support with a single user while running the server as a service. This update was shared with the customer, and they provided positive feedback and confirmed their readiness. With this solution, Word and Excel conversions support multi-threaded execution, whereas PowerPoint remains single-threaded. The customer indicated a need for PowerPoint multi-threaded conversions as well for certain use cases. To achieve this, they plan to run the server in command-line mode(with multi-threaded conversion by a single user for Excel).\n3. *Abbott application improvements* – Abbott shared their application code for evaluation, and we provided recommendations to improve throughput. However, at this stage, the customer is not planning to implement any changes and intends to revisit this after resolving the current issues.\n4. *Long-term plans for Office conversions* – Abbott has requested Adobe to share its long-term roadmap and strategy for Office conversions.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.603Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762862276.317519"
  },
  {
    "id": "168a39b7-b17c-47c8-a0a4-da5ae319415b",
    "source": "slack",
    "text": "*\n• *Feature Toggle and Bundle Configuration for Local Development:* Christy, Mayank, and Shraddha discussed the process for enabling feature toggles in local development, confirming that uploading the bundle to the system console and enabling it via Config Manager is the required approach, with documentation and links provided by Shraddha.\n• *Marketo Connector and Form Configuration in AEM:* Christy, Mayank, and Shraddha walked through the steps to configure the Marketo connector in AEM, including obtaining credentials, setting up global configurations, and deploying the Mercury Marine code base, with Andy Kluck joining later to discuss form migration and scalability.\n• *Form Migration, Environment Structure, and Scalability:* Andy Kluck, Christy, and Mayank discussed strategies for migrating forms between QA, stage, and production environments, including the storage locations of forms and configurations, the feasibility of moving forms versus rebuilding, and the need for documentation on folder structures.\n• *Documentation and Process Standardization:* Mayank and Shraddha emphasized the importance of following and updating documentation for both cloud and local setups, with Christy agreeing to adjust formatting and Andy planning to use the documentation to build and import forms, ensuring consistency and easier troubleshooting.\n• *Meeting Frequency Adjustment:* Mayank proposed reducing the frequency of the meetings from twice a week to once a week as the project nears go-live, with Andy suggesting a Thursday meeting to address any deployment issues and reevaluate the schedule as needed.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.492Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762925718.072349"
  },
  {
    "id": "7e261822-fa92-4d13-8859-f1353663d381",
    "source": "slack",
    "text": "*\n• *Form Validation and Prefix Path Issue:* Andy Doerr, Arneh, and Gaurav discussed ongoing issues with form validation failures and incorrect prefix paths in the application, with Gaurav guiding Andy to update the prefix path in the code and Arneh suggesting testing the fix before deployment.\n• *Bulk PDF Import and Migration Progress:* Mayank, Naveen, Andy Doerr, and Krishna discussed the ongoing migration of forms from DocuSign, the use of the AI-powered bulk PDF import service, and the need for clear instructions and quantifiable feedback on the migration process.\n• *Layout and Mapping Issues in Converted Forms:* Gaurav, Andy Doerr, and Naveen addressed layout changes and mapping issues in XDP forms converted using AI tools, referencing specific email threads and discussing the need for more information to resolve the reported problems.\n• *Authoring Use Case and Meeting Coordination:* Naveen, Arneh, and Gaurav discussed ongoing collaboration with Chris on the authoring use case, including meeting scheduling issues and sharing demo recordings for further development.\n• *Form Theming and Styling Considerations:* Arneh and Andy Doerr discussed the lack of consistent theming and styling in the converted forms, with Andy noting previous difficulties in creating a theme and expressing intent to address this now that core components are functioning.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.386Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762925843.256829"
  },
  {
    "id": "fb618ca5-466c-4bff-b29b-ac9e107d7177",
    "source": "slack",
    "text": "*\n*Meeting notes*\n\n*AEM Forms Local Development Environment Setup:* Christy, Mayank, Andy, and Shraddha discussed and collaboratively worked through the step-by-step process for setting up AEM Forms on a local SDK instance, focusing on creating comprehensive internal documentation to guide future developers through the process.\n\n*Cloud Manager and Environment Configuration:* Mayank and Shraddha explained to Christy how to enable and configure AEM Forms as an add-on in Cloud Manager, clarifying the process for both new and existing environments and the implications for license availability.\n\n*Marketo Connector and ECID Integration:* Andy and Christy discussed the setup and testing of the Marketo connector for both local and stage environments, including questions about using a sandbox for local development and ensuring ECID values are correctly submitted from AEM Forms.\n\n*Documentation Consolidation and Handover:* Christy, Mayank, and Shraddha agreed on the importance of consolidating all setup steps and troubleshooting notes into a single, detailed internal document or Excel tab to facilitate future development and handover.\n\nF*ollow-up tasks*\n.\nD*ocumentation for Local AEM Forms Setup: _Done_*\nSend Christy the detailed step-by-step instructions for setting up AEM Forms on a local SDK, including enabling feature toggles and any additional configuration required for local development. (Shraddha, Mayank)\n.\n*Excel Documentation Update: _Done_*\nAdd the local AEM Forms setup steps provided by Christy to a new tab in the shared Excel documentation for team reference. (Mayank, Shraddha)\n.\n*Sandbox Marketo Connector Details:* Provide Christy with the details needed to set up the Marketo connector for local development using the Mercury Sandbox environment. (Andy)\n.\n*ECID Submission Issue Investigation:* Investigate and clarify why the ECID is not being submitted to Marketo from the QA environment and coordinate with Andy to resolve the issue. (Shraddha, Andy)\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.281Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1762939436.325349"
  },
  {
    "id": "20d979a2-e787-4a73-aa87-4d74017bfc99",
    "source": "slack",
    "text": "*\n• Meeting was scheduled by Michael for discussing all the open queries of UPS. In that one story they were interested was Certificate based authentication of Onedrive.\n• Current implemented changes were presented to the customer as a demo &amp; recording with all standard MSFT doc is also shared.\n• The demo was well received by the customer, waiting on their response.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.178Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1763008572.322029"
  },
  {
    "id": "64599b28-6f7d-433a-9896-083f12c01ffd",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Database Connectivity Troubleshooting:* Randy, Sakshi, Chad, Tim, and Speaker 1 collaborated to diagnose intermittent connectivity issues with the Azure SQL database, discussing network settings, activity logs, and pipeline activity, and performed configuration changes to test solutions.\n    ◦ *Initial Connectivity Issue:* Randy reported being unable to access the Azure SQL database, despite it working earlier for Speaker 1, who had verified connectivity two hours prior. The team confirmed that the dedicated egress IP was whitelisted and reviewed networking and connectivity settings in the Azure portal.\n    ◦ *Review of Network and Access Settings:* Speaker 1 guided Randy through the Azure portal to check server name, networking settings, and IP whitelisting. They confirmed that the environment variables for the database password were set and discussed the use of SQL Server Management Studio for connectivity.\n    ◦ *Activity Logs and Pipeline Checks:* Speaker 1 requested Azure SQL activity logs to investigate connection drops, and Sakshi agreed to share Microsoft documentation on retrieving these logs. The team discussed whether any pipelines had run that could have affected connectivity, with all confirming no recent activity.\n    ◦ *Testing Connectivity Modes:* Speaker 1 asked Chad and Randy to change the database connectivity mode from 'proxy' to 'default' and then back to 'proxy' to test if the issue persisted. They confirmed that no idle timeouts were configured and monitored the effect of these changes.\n    ◦ *Next Steps and Documentation Sharing:* Speaker 1 shared relevant Microsoft documentation and community blog links for further troubleshooting, requested Randy to email activity logs, and confirmed that no private access was configured, only public access. The team agreed to continue investigating and follow up with more information.\n• *Dynamic Workflow and Form Integration in Adobe Experience Manager:* Sakshi, Harman, and Randy discussed the integration of dynamic forms with custom workflows in Adobe Experience Manager (AEM), focusing on how approvers are selected, data flows through the system, and how business logic can be implemented using JavaScript and ECMA scripts.\n    ◦ *Form Structure and Data Formatting:* Sakshi demonstrated the form skeleton, including disabled fields, automatic formatting, and the calculation of total and contingency costs. The form integrates with the workflow and allows for attachments, with certain fields intended to be populated from the SQL database.\n    ◦ *Approver Selection Logic:* Randy explained that approver selection is typically individual-based rather than group-based, due to the company's business processes. Harman and Sakshi suggested using groups for workflow assignment, but Randy clarified that most approvals are handled by specific individuals, requiring custom logic.\n    ◦ *Workflow Customisation and Branching:* Harman described how workflow branching can be implemented using ECMA scripts in AEM, allowing for logic based on form data such as approval amounts. The team discussed how to configure branches, set default routes, and use JavaScript to control workflow progression.\n    ◦ *Data Flow and Accessing Form Data:* Harman and Sakshi explained how form data is submitted to the workflow, stored as JSON, and accessed within scripts. They demonstrated how to retrieve and manipulate this data, both in local and cloud environments, and how to configure data storage and retrieval.\n    ◦ *Printable Document Generation:* Sakshi showed how to generate a printable PDF version of the form (document of record), configure its appearance, and exclude certain fields or panels based on visibility rules. They discussed options for pixel-perfect PDFs and dynamic exclusion of form elements.\n• *Database Preparation for Workflow Integration:* Randy confirmed plans to create new tables in the SQL database to support dynamic dropdowns and workflow integration, with Sakshi and the team ready to assist in integrating these data sources once available.\n    ◦ *Table Creation for Dropdowns:* Randy stated that tables for branch, division, and approver information would be created in the SQL database to enable dynamic population of form fields, as required for workflow integration.\n    ◦ *Integration Planning:* Sakshi confirmed that once the database tables are ready, the team can proceed with integrating these data sources into the forms, enabling dynamic dropdowns and improved workflow automation.\n• *User Access and Consumption Options for AEM Forms:* George inquired about how users would access AEM forms, and Sakshi explained the available out-of-the-box components, APIs, and options for listing and filtering forms on various platforms, including web and mobile.\n    ◦ *Form Listing and API Access:* Sakshi described that forms can be listed using an out-of-the-box component or accessed via an API that returns a JSON listing, allowing integration with custom websites or applications.\n    ◦ *Platform Support:* Sakshi confirmed that forms can be accessed on Windows, iOS, and Android platforms, and offered to provide a demo or dummy site page to illustrate these options.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:11.072Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1763529026.443209"
  },
  {
    "id": "94afc60a-efe5-4f64-bf12-bf74858b7f2b",
    "source": "slack",
    "text": "*\n• *Multiple Form Loading:* Customer facing issues loading multiple forms in the same division due to missing unload function in AF2, causing event listener conflicts.\n• *Event Handling:* Engineering discussed reusing listener logic and temporary workarounds like clearing the division before reloading forms.\n• *Unload Function Follow-Up:* Engineering will consult core team for proper unload recommendations and share findings.\n• *JSON/XML Conversion:* Customer to implement JSON–XML conversion and prefill logic for form submission and PDF generation; development in progress.\n• *Testing &amp; Validation:* Conversion and unload logic are required for successful PDF generation and end-to-end validation.\n• *AEM Search Integration:* Customer explored AEM’s new semantic search with Engineering; demo planned to assess fit and performance.\n• *Indexing Issues:* Customer reported search failures in dev environment due to conflicting indexes; Engineering investigating and defining best practices.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.966Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1763529691.340699"
  },
  {
    "id": "44cce2ab-bb8d-4449-8b5a-9aaea85180b6",
    "source": "slack",
    "text": "*\n• James provided overview that he has implemented AEM Forms Core Components on his site and published a 5‑minute overview video of AEM Forms capabilities. <https://www.youtube.com/watch?v=gRuqGc-5cmo>\n• Now, He is interested in Document Services- Output and DocAssurance Service and Interactive Communication on AEM as a Cloud Service.\n• We provided brief overview of the service and He is now looking for for a deeper, hands‑on session focused on setup, configuration, and practical usage so he can start using these capabilities. \n• He agreed to provide practitioner feedback from an outsider perspective to help us improve our services.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.861Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1764046139.663049"
  },
  {
    "id": "ae9ece00-dac3-40ca-ba57-f758fde10acf",
    "source": "slack",
    "text": "*\nFidelity Stock Plan Services run a single AEM Publish instance with the AEM Forms add-on on Windows Server that also hosts Microsoft Office and Acrobat required to support of PDF generation.\n*Requirements*\n• Migration to the latest versions of Windows Server, Microsoft Office, and Acrobat\n• Support for DOCX to PDF conversion\n• Support for DOCX documents larger than 1 MB\n• Support for multiple concurrent PDFG conversions (10+)\nWith the latest supported versions of Windows Server and MS Office, they are unable to run multi-threaded conversions. We have suggested them with the newly implemented solution that enables multi-threaded conversions in single-user mode while running the server as a service.\nAdditionally, they need to decompress the generated PDF. We suggested trying different Adobe PDF Settings options to achieve the desired output. Currently, they are using the open-source PDFBox library for this purpose.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.756Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1764090684.923759"
  },
  {
    "id": "1e344f8f-4eb5-49fd-ac11-76bdecc213e7",
    "source": "slack",
    "text": "*\n• *AFV2 Guidebridge Enhancement:* Engineering deployed a private build enhancing guidebridge that enables the use-case of multiple forms on a single page; Customer to validate functionality.\n• *Validation Request:* Engineering requested confirmation from Customer that the AFV2 fix resolves the reported issue.\n• *XDP Versioning:* Engineering completed internal implementation and raised a pull request; official release deferred to 2026 due to code freeze.\n• *Private Build Option:* A private build with XDP versioning can be shared before the official release if needed.\n• *Converted Forms Status:* Customer team converted five to six forms under validation; production readiness to be confirmed with offshore resource.\n• *Follow-Up with Offshore Team:* Customer to check with offshore developer on deployment status and report updates.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.650Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1764135866.061899"
  },
  {
    "id": "e6758787-2d7a-4037-95e2-95147ef7f8fd",
    "source": "slack",
    "text": "*\n• *Project Status and Migration Challenges:* Andy provided an update on the project's current state, highlighting issues encountered during the migration from QA to stage, particularly with form naming conventions and connector configurations, while Mayank, Shraddha, and Christy were identified as key stakeholders in resolving these challenges.\n• *Front-End Code Review and Documentation:* Mayank raised the topic of front-end code review, noting that Christy and Jonathan from Brunswick were responsible for reviewing and documenting the custom JavaScript code, with Sarah and Andy coordinating the process and planning further review after the holiday.\n• *Theming and Styling Implementation:* Andy updated the group on the status of theming and styling, explaining that Steve and the internal team were handling the deployment of themes using Figma exports, with Natalie responsible for addressing styling issues before go-live.\n• *Scalability and Multi-Brand Form Strategy:* Andy outlined the plan to scale the solution for multiple brands, starting with Mercury Marine as a pilot, and discussed the need to adapt hidden field logic and URL parsing for different brand requirements, with Mayank and Christy providing guidance.\n• *Go-Live Timeline and Support Planning:* Mayank emphasized the importance of expediting the go-live for Mercury Marine before the Adobe shutdown in late December, with Andy agreeing to focus on completing the PDP page form and coordinating with the team to meet the target date.\n• *Marketo Partitioning and Data Attribution Concerns:* Sarah and Andy discussed ongoing challenges with Marketo partitioning and data attribution, particularly regarding lead assignment across multiple brands, and agreed that these are primarily data management issues rather than form implementation problems.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.544Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1764136037.917299"
  },
  {
    "id": "187ead86-dcd4-4bbc-bb88-1348fb56774e",
    "source": "slack",
    "text": "*\n*Meeting Summary – Verizon Discussion on Document Generation and AEM Capabilities*\n\n*Current Vendor Landscape and Business Need*\n• *Verizon* is currently operating as an on-premise site customer.\n• They use *Open Text Extreme* for print output and multiple other solutions for digital communications.\n• Verizon is assessing whether *AEM* can serve as a unified platform to replace multiple existing systems, reducing vendor dependencies and operational complexity.\n• *Document Volume*:\n    ◦ *Peak output*: 1–2 million documents/day\n    ◦ *Average size*: 10–13 pages per document\n    ◦ *Total daily pages*: 7–8 million pages, with occasional peaks of *10–15 million pages*\n    ◦ Bill cycles run *daily*, including holidays, with heightened activity on peak billing days.\n*Key Discussion Points-*\n\n*AEM Forms Overview*\n<@W5HEU5M7Y> provides a recap of AEM Forms and its functionalities.\n• *AEM Forms offers an end-to-end digital enrollment solution, including data input and workflow automation.*\n• It supports customer communications like billing statements and account statements.\n• The product incorporates AI for content creation and updates.\n    ◦ AEM allows for stack consolidation, enhancing brand identity and user experience.\n*Cloud Service Advantages*\n<@W5HEU5M7Y> discusses the advantages of using AEM as a cloud service.\n• Cloud services offer continuous innovation and easier code maintenance.\n• They are scalable and resilient, adjusting to traffic surges.\n• Security patches can be applied quickly across the customer base.\n• Integration with Adobe's Digital Asset Management (DAM) enhances content reuse.\n*Communication and Document Generation Process*\n<@W5HEU5M7Y> explains the process of generating communications and documents using AEM.\n• The focus is on steps 4-6 of the document generation process. <https://adobe-my.sharepoint.com/:p:/p/macman/EUvLzWgblYdMu6LXkCSdO0MBFOz_oO-glK_F7lIhSKYeVg?e=bHn6q0>\n• Also explained Adobe Proposal added in the PPT. AEM can directly generate PDFs and AFPs, simplifying the workflow.\n• The system allows for real-time document generation and batch processing.\n*Interactive Communication (IC) Demonstration*\n• <@WE163TH43> Demonstrated the creation of an *Interactive Communication Document* using AEM.\n• Key highlights:\n    ◦ The demo showcases data integration using JSON and REST endpoints.\n    ◦ Templates and reusable fragments are used to create the communication document.\n    ◦ The editor allows for layout control and data binding for personalized documents.\n    ◦ Features include drag-and-drop capabilities and fluid layout options.\n*Advanced Document Generation &amp; Data Binding Features*\n• The demo showcased:\n    ◦ Creation and reuse of fragments via drag-and-drop\n    ◦ Multiple approaches to data binding (by notation or drag-and-drop)\n    ◦ Ability to define business rules, such as summation of values across components\n    ◦ Component-level customization including typography, appearance, and styling\n    ◦ Real-time *PDF preview* using sample data inputs\n*Flexible Page and Layout Configuration*\n• IC Editor provides granular control over page structures:\n    ◦ Individual pages can have *different orientations* (portrait/landscape)\n    ◦ Support for multiple *paper sizes and dimensions* within a single document\n    ◦ The system supports multiple templates for different document types, such as bills and marketing materials.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.437Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1764149465.423279"
  },
  {
    "id": "ace0575b-c9f9-4abf-9aa2-de66e6a754ba",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Server Connectivity and Regional Restrictions:* Sakshi, Randy Reisling, and Shraddha discussed ongoing issues with connecting to the Azure SQL server, identifying that regional restrictions and content filtering on Randy Reisling's side were causing access problems, and agreed to review configuration and permissions to resolve the issue.\n    ◦ *Connection Troubleshooting:* Sakshi and Randy Reisling reviewed connection errors to the Azure SQL server, with Sakshi demonstrating the error state and Randy Reisling confirming that content filtering and profile issues on their side were contributing factors. Sakshi suggested signing out and logging in with the correct profile, but Randy Reisling noted that strict site filtering was blocking access.\n    ◦ *Regional Access Restrictions:* Shraddha requested details from Randy Reisling about any Azure-side regional whitelisting, as the connection was successful from Canada Central but not from other regions, indicating a possible regional restriction in place.\n    ◦ *Next Steps for Resolution:* Randy Reisling agreed to review the Azure configuration and provide information on any regional or user-based restrictions, while Sakshi requested relevant permissions for their users to facilitate troubleshooting and access.\n• *Dynamic Form Design, Theming, and Front-End Pipeline:* Sakshi guided Randy Reisling and George through the process of creating dynamic forms, custom themes, and deploying changes using a front-end pipeline, including repository setup, CSS customisation, and local development workflows.\n    ◦ *Form Initialisation and Drop-Down Logic:* Sakshi explained the setup for dynamic drop-downs in forms, including custom functions to extract and store either IDs or names from payloads, and demonstrated how to configure storage and display values independently.\n    ◦ *Theme Customisation and Repository Structure:* Sakshi described the creation of a dedicated repository for Carpenter forms themes, the use of SCSS variables for branding, and the ability to customise component styles by editing the variables and CSS files in the repository.\n    ◦ *Front-End Pipeline Deployment:* A front-end deployment pipeline was set up to quickly deploy theme changes to the development environment, with Sakshi clarifying the association between repositories, pipelines, and theme selection in the application.\n    ◦ *Local Development Workflow:* George inquired about seeing CSS changes locally, and Sakshi explained how to configure the local environment using a .env file and run the build process to preview changes before pushing to the repository.\n• *Form Listing, Access Control, and Out-of-the-Box Components:* Sakshi demonstrated to George and Randy Reisling the use of out-of-the-box components for form listing, folder-based filtering, and access control using ACLs, ensuring that forms and site pages can be configured for different layouts and user permissions.\n    ◦ *Form Listing and Layout Options:* Sakshi showed how to configure the form listing component to display forms in list or card layouts, filter by folders, and set pagination options, providing flexibility in how forms are presented to users.\n    ◦ *Access Control Lists (ACLs):* Sakshi explained the use of ACLs to restrict access to forms or folders based on user or group permissions, ensuring that only authorised users can view or interact with specific assets.\n    ◦ *API Integration:* The team discussed the availability of public APIs for retrieving form lists and definitions, allowing integration with custom UIs if required.\n• *Document of Record and PDF Generation:* Sakshi detailed the configuration of the document of record feature, including custom branding, dynamic content inclusion/exclusion, and formatting options for the PDF output, addressing questions from Randy Reisling about customisation and data handling.\n    ◦ *Custom Branding and Layout:* Sakshi demonstrated how to customise the PDF output by changing colours, adding logos, and configuring headers and disclaimers to match the Carpenter theme.\n    ◦ *Dynamic Content and Exclusion:* The process for excluding specific components or titles from the PDF was shown, allowing for a cleaner and more relevant document of record based on user selections and form rules.\n    ◦ *Formatting and Localisation:* Sakshi explained the use of out-of-the-box and custom formats for fields such as currency and dates, and clarified how localisation and manual selection of formats can be handled within the form.\n• *Translation and Localisation of Forms:* Sakshi and Randy Reisling discussed the translation and localisation capabilities, including the creation of translation projects, use of machine and human translation, and the handling of licensing requirements for additional languages.\n    ◦ *Translation Project Setup:* Sakshi demonstrated how to create translation projects for multiple languages, select source and target languages, and initiate machine translation if the appropriate licence is available.\n    ◦ *Machine and Human Translation:* The team discussed the use of Microsoft and other third-party translation providers, as well as the option to manually translate and upload dictionaries for custom language support.\n    ◦ *Licensing and Permissions:* It was clarified that machine translation requires additional licensing, and that users can still perform manual translations if machine translation is unavailable.\n    ◦ *Practical Application and Documentation:* Sakshi offered to share documentation on manual translation workflows, and Randy Reisling confirmed that English would suffice for now, with future plans to support additional languages as needed.\n• *Workflow Automation and Variable Handling:* Harman and Randy Reisling reviewed the implementation of workflow automation, focusing on setting variables from form data, handling branching logic, and ensuring that drop-down values are correctly passed and used in workflow steps.\n    ◦ *Workflow Example and Reference:* Harman confirmed that the test workflow on Randy Reisling's instance demonstrates how to extract JSON data from forms and use it for branching logic, providing a reference for future workflow development.\n    ◦ *Drop-Down Value Handling:* Randy Reisling asked about capturing the correct value from drop-downs, and Harman clarified that the selected value is passed through the form and can be used directly in workflow steps such as task assignment.\n    ◦ *Next Steps for Form Publishing:* The team discussed preparing simpler forms for a test group of users, aiming to go live with at least one form before the end of the year, and requested guidance on the publishing process.\n• *Reusable Fragments and Rule Management:* Sakshi advised Randy Reisling and George on saving reusable form logic as fragments, enabling efficient updates and consistent rule application across multiple forms.\n    ◦ *Fragment Usage:* Sakshi recommended saving commonly used rules and logic as fragments, so that updates can be made in one place and applied across all relevant forms, streamlining maintenance and consistency.\nFollow-up tasks:\n• *Azure SQL Server Regional Access Restrictions:* Provide details of the Azure SQL Server configurations and any regional whitelisting or restrictions that may affect connectivity from regions outside Canada Central to assist with troubleshooting access issues. (Randy Reisling)\n• *Azure SQL Server Regional Access Restrictions:* Investigate and clarify what regional restrictions are in place on the Azure SQL Server that may prevent connections from regions other than Canada Central, and communicate findings to the team. (Randy Reisling)\n• *Translation Licensing and Manual Translation Documentation:* Share the documentation outlining how to download, manually translate, and upload translation dictionaries for forms, to support manual translation in the absence of a machine translation licence. (Sakshi)\n• *Translation Licensing and Manual Translation Documentation:* Review and address the translation licence issue that is preventing the use of machine translation for form localisation, and determine next steps for enabling additional languages. (Randy Reisling)\n• *Front End Theme Development Guidance:* Share documentation with George on how to configure the local environment to view front end CSS and design changes in real time while editing, including instructions for using the front end pipeline locally. (Sakshi)\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.326Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1764149604.281159"
  },
  {
    "id": "ceedf847-1a4a-4198-bc44-4743d07526e0",
    "source": "slack",
    "text": "*\n• *Mercury Marine Forms Deployment Status:* Andy updated Mayank, Heidi, Mark, and the team on the progress of Mercury Marine forms deployment, noting that production testing is underway, styling changes are pending, and there are no major blockers except for translation setup and minor styling issues.\n• *Translation Approach for Forms and Sites:* Andy, Heidi, Mark, and Mayank discussed translation strategies, clarifying that Mercury Marine sites currently use human translation, while forms are planned to use Microsoft Translator, pending setup and access in the production environment.\n• *Marketo Data Routing and Partitioning:* Andy explained to Mayank and the team how form submissions are routed in Marketo, detailing edge cases with data partitioning and confirming that the current setup meets Mercury Marine's requirements without causing blockers.\n• *Form Wizard and Submission Issues:* Andy and Mayank discussed ongoing issues with the form wizard, where form creation and data submission processes fail to load properly, and reviewed workarounds and upcoming fixes tracked by the team.\n• *Form Design and Layout Feedback:* Andy sought feedback from Heidi and Nathan regarding the layout of rating buttons on forms, leading to a discussion about horizontal versus dropdown arrangements and agreement to explore cleaner design options.\n• *Upcoming Lead Capture Initiative:* Mayank proposed a new initiative to Andy, Heidi, and Joe to enhance lead capture and form discovery, suggesting a follow-up meeting to showcase capabilities and gather feedback from the team - <@W4XTCQ07J> / <@WLWHN4TV3>- Can we setup something for coming Thursday to demonstrate forms optimiser.\n• *Next Steps and Support Process:* Mayank outlined the next steps for the Mercury Marine forms project, emphasizing the support process for resolving blockers and requesting feedback on product and process improvements from Andy and the team.\n• *BBG Data Integration Planning:* Andy mentioned plans to begin integrating BBG data into forms, noting that custom functions will be needed to support different data sets and brands, and will coordinate with Christy for further details.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.218Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1765292186.526739"
  },
  {
    "id": "30eb404a-faa6-4314-bfc5-7ed21d8fd014",
    "source": "slack",
    "text": "*\n*Context*: Customer came with requirement of *34K fields in a form* (AF1)\n\nMeeting notes:\n• *Migration from Foundation to Core Component Based Forms:* Sakshi and Amit explained the process and results of migrating the large JSON-based foundation component form to a core component based form, highlighting performance improvements, technical changes, and the implications for Vijay and the team.\n    ◦ *Migration Process Overview:* Sakshi described converting the provided JSON foundation component form, which contained approximately 9,100 fields across 9 tables, into a core component based form, and then scaling it up to 37,000 fields to test performance and tab navigation.\n    ◦ *Performance Comparison:* The team observed that while the initial render time for the core component based form was high (around 4 minutes for 37,000 fields), tab navigation was significantly faster compared to the foundation component based form.\n    ◦ *Technical Adjustments:* Due to the lack of a table component in core components, Sakshi explained that tables were represented using panels, and formatting or table-like appearance would need to be achieved through CSS or by developing a custom table component.\n    ◦ *Coexistence of Form Types:* Sakshi clarified that foundation component based forms and core component based forms can coexist within the same AEM infrastructure, and migrating one form does not impact others.\n• *React-Based Headless Form Rendering:* Amit demonstrated rendering the migrated core component form using a React-based headless approach, detailing the technical setup, performance benefits, and deployment considerations for Vijay and the team.\n    ◦ *React Rendering Setup:* Amit showcased the use of a custom React application that fetches JSON from the core component and renders it using a custom hook, with the setup available via code sandbox and downloadable packages.\n    ◦ *Performance Metrics:* Sakshi and Amit reported that the React-based rendering significantly reduced the initial render time to under a minute for 37,000 fields, with tab switching occurring almost instantaneously.\n    ◦ *Deployment and Infrastructure:* Sakshi and Amit explained that deploying the React component requires embedding it within a site page, and that the React-based approach does not require changes to the existing AEM authoring infrastructure, but does require a React client library.\n    ◦ *Compatibility and Feasibility:* The team discussed the need to verify whether React-based rendering is supported on AEM 6.5 or only on cloud setups, with Sakshi taking an action item to confirm this by the end of the day.\n• *Customization, Theming, and Table Representation:* Vijay raised questions about appearance, theming, and table handling in the migrated forms, with Sakshi and Amit clarifying the technical requirements for CSS, JS, and the limitations of core components regarding tables.\n    ◦ *Theming Consistency:* Sakshi and Amit confirmed that core component based forms and vanilla React forms share the same HTML structure, allowing the same CSS themes to be applied to both, provided the official library is used.\n    ◦ *Table Representation:* Sakshi explained that, in the absence of a table component in core components, tables are represented as panels, and achieving a table-like appearance requires custom CSS and potentially additional JavaScript.\n    ◦ *Migration Utility Limitations:* The migration utility provided by the team converts foundation component based forms to core component based forms but does not handle tables perfectly, so manual enhancements or extensions may be necessary.\n• *Performance Metrics and Testing Recommendations:* Service Mothemane and Yashaswi requested detailed performance metrics and scenario-based analysis, with Sakshi recommending that the team conduct their own tests with business rules applied to validate performance improvements.\n    ◦ *Request for Detailed Metrics:* Service Mothemane asked for clear documentation of performance statistics under various scenarios, including the impact of adding business rules, to inform internal stakeholders and guide decision-making.\n    ◦ *Testing with Business Rules:* Sakshi advised that while their tests were conducted with business rules removed, the team should add their own rules to the migrated forms and measure performance in their environment for accurate results.\n    ◦ *Provision of Artifacts:* Sakshi committed to sharing the migrated form packages, documentation, and setup instructions, enabling the team to conduct their own tests and gather metrics.\n• *Alternative Solutions and Parallel Business Discussions:* Takalani, Adele, and Vijay discussed ongoing parallel streams, including meetings with business stakeholders about form splitting and dynamic rendering, with Sakshi providing technical recommendations for these approaches.\n    ◦ *Parallel Business Meetings:* Takalani confirmed a scheduled meeting with business stakeholders to discuss alternative solutions, and Adele clarified that this stream is independent of the technical migration efforts.\n    ◦ *Dynamic Form Rendering:* Vijay described exploring dynamic rendering based on user sector classification, and Sakshi suggested splitting the form into smaller fragments or using conditional rendering to improve performance and user experience.\n• *Next Steps and Action Items:* Yashaswi, Sakshi, and Anshika Singh Sengar outlined the immediate next steps, including sharing migrated form packages, documentation, and confirming React support on AEM 6.5, with Anshika Singh Sengar responsible for distributing meeting notes and artifacts.\n    ◦ *Artifact Distribution:* Sakshi agreed to provide the migrated form packages and documentation to Anshika Singh Sengar, who will distribute them along with meeting notes and responses to outstanding questions.\n    ◦ *Feasibility Confirmation:* Sakshi took responsibility for confirming by end of day whether React-based rendering is supported on AEM 6.5 or only on cloud, and to communicate this to the team.\n    ◦ *Weekly Meetings:* The team agreed to continue weekly meetings to exchange updates and coordinate progress, especially in light of the upcoming shutdown period.\nFollow-up tasks:\n• *Feasibility of React Component on AEM 6.5:* Check and confirm whether rendering the React component inside a site page is supported on AEM 6.5 or only available in cloud configuration, and communicate the findings to the team. (Sakshi, Amit)\n• *Provision of Migrated Form Packages and Setup Instructions:* Share the migrated core component based form package, the React sandbox structure, and clear setup instructions (including documentation links) with Anshika for distribution to the team. (Sakshi)\n• *Summary of Meeting Outcomes and Deliverables:* Summarize all discussed points, provide the relevant packages, and respond regarding AEM 6.5 support by end of the day for team review. (Sakshi)\n• *Performance Metrics Documentation:* Detail the performance statistics under specific tested scenarios for each form rendering option, including recommendations and anticipated impacts on the current setup, and share this documentation with the team. (Sakshi)\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.112Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1765371354.813939"
  },
  {
    "id": "06cb672a-cf3a-445e-a1a3-bc05e60c63bd",
    "source": "slack",
    "text": "*\n• James is new to this cloud deployment pipeline approach, so I walked him through the AEM archetype and the process for deploying code to AEM.\n• I gave him a demo of the IC on Cloud feature, including the AI capabilities available through AI Assistant and Forms Experience Builder within the IC editor.\n• He is interested in trying these features himself and is waiting for us to enable them in his environment.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:10.007Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1765378376.520859"
  },
  {
    "id": "efc42ef4-6dd7-4fad-ad8e-2cc6f38a8dea",
    "source": "slack",
    "text": "*\n*Form Go-Live Status and Next Steps:* Heidi Reinke confirmed to Shraddha that the form is live on production in a test state, outlined the steps to move it to the final page, and agreed to share both test and final URLs with the Adobe team.\n\n*Outstanding Questions and",
    "created_at": "2026-01-25T16:46:09.902Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1765931489.292819"
  },
  {
    "id": "b694843f-eba1-40d6-ae0d-1d0b1065555a",
    "source": "slack",
    "text": "*\n• *Slow Deletion Performance:* Customer reported slow/unresponsive deletion of text fields; Engineering identified a slow `references` network call as the likely cause.\n• *Diagnosis &amp; Workarounds:* Engineering suggested broader field testing, requested access to reproduce, and recommended using Experience Fielder as a temporary workaround.\n• *Form Migration Policies:* Engineering guided Customer to fix layout issues by setting responsive grid policies and aligning templates across environments.\n• *Editing Enablement:* Engineering enabled allowed components so Customer can edit forms on stage.\n• *Schema Association:* Engineering clarified core components support JSON schemas only; guided XSD→JSON conversion and schema configuration, noting sync/maintenance risks.\n• *Testing Status:* Customer confirmed UAT/production testing is blocked due to SPA deployment, not AEM.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.796Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1765972821.635309"
  },
  {
    "id": "ee0195f3-b0c7-4dd5-bc17-93ce5c3459d5",
    "source": "slack",
    "text": "*\nDelivered a private release, which the customer said selectively worked. On the call, we pointed out incorrect configuration. Customer rectified it, and validated things to be working as desired.\n\nPost that updated the private release on their 7 cloud environments and 3 RDE\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.691Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1765977115.742489"
  },
  {
    "id": "d77b5024-b528-4a8d-ba78-cd53432f70f1",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n*Meeting Notes*\n• *Sprint Dashboard &amp; KPI Alignment*: Vijay presented a new dashboard for sprint tracking, focusing on outcome goals, baselines, and targeted KPIs for Project Zenith. The team agreed to review and align on practical targets, ensuring they are industry-standard and achievable. 1\n• *Reporting &amp; Communication*: Regular updates (weekly/fortnightly) will be sent to keep all teams informed of progress and achievements, aiding communication with business stakeholders. 2\n• *Performance Improvements*: Notable gains in mobile performance scores were discussed, with a target to reach 95+ Lighthouse scores for new and existing journeys. Enforcement of performance checks in the CI/CD pipeline was agreed, with exceptions requiring approval and tracking. 3\n• *API Virtualization*: The team is moving towards using API virtualization for all development to avoid outages, with incremental tracking of coverage and maturity. Immediate mocking of APIs for new scenarios was confirmed. 4\n• *Testing &amp; Impact Analysis*: Emphasis on sharing impact analysis documents for changes, especially those affecting functionality due to lazy loading, to guide focused testing and avoid regressions. 5\n• *Automation &amp; Code Coverage*: Progress on test automation was shared, with targets to increase coverage in upcoming sprints and specific dates to be set for completion. 6\n• *RUM &amp; Observability*: Improvements in error transparency and reduction of noise in client-side error reporting were discussed, with further enhancements planned for the next sprint. 7\n*Feedback Provided*\n• *KPI Practicality*: Ashish and Santosh stressed the need for realistic, industry-standard KPIs and regular review to ensure targets are achievable. 8\n• *Exception Handling*: Ashish requested that design authority for performance enforcement remain with the technical team, not delivery, to prevent bypassing standards under delivery pressure. 11\n• *Testing Guidance*: Ashish highlighted the importance of clear impact analysis for changes, so testers know exactly which functionalities to focus on, reducing risk of missed regressions. 5\n• *API Virtualization Progress*: Santosh requested clear communication and tracking of virtualization coverage, with immediate mocking for new scenarios to prevent development outages. 12\n• *Automation Targets*: Santosh asked for specific target dates (TDs) for automation completion to improve planning and accountability. 13\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.585Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1766490510.217959"
  },
  {
    "id": "b4c93b7c-92fc-4e53-b0d9-b0f4488847b6",
    "source": "slack",
    "text": "*\nThis was for an escalated issue, where the customer's SQL server connection is getting dropped and sometimes returning too many requests.\nOn analysis it was found that their custom servlet was establishing the connection which was dropping.\nWe have provided them with some pointers around jdbc connection configuration.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.479Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1766506195.165989"
  },
  {
    "id": "0ccad1eb-e790-449b-8bfa-2c1cd3705900",
    "source": "slack",
    "text": "*\n• *Overview of Adobe AEM Forms Value Proposition:* Melissa, Mark, and Jared from Adobe provided Sunil, Williams-VZ, Ani, Kiran, and the Verizon team with a comprehensive overview of the value proposition, features, and differentiators of Adobe AEM Forms, focusing on interactive communications, integration, compliance, and collaboration capabilities.\n• *Interactive Communications Features:* Melissa recapped the core features of AEM Forms’ interactive communications, highlighting a single source of truth, centralized management, business rule-driven workflows, automation to reduce manual effort and errors, flexible data integration, and governance with reusable templates and collaboration between IT and business users.\n• *Scalability and Omnichannel Delivery:* Melissa explained that AEM Forms enables scalable document processing, supporting both on-demand and batch operations at high volume, and facilitates omnichannel experiences by allowing content deployment across digital and print channels with reusable templates and content fragments.\n• *Integration and Compliance:* The team emphasized AEM Forms’ flexibility in integrating disparate data sources and maintaining compliance, with features such as pre-approved content, locked templates, and collaborative workflows that ensure governance and regulatory adherence.\n• *Differentiators and Future Capabilities:* Melissa and Arun discussed differentiators such as empowering business users, upcoming Gen AI authoring (currently in early access), tight integration with Adobe Experience Cloud, and the platform’s ability to address both output and input use cases, providing a unified solution for future needs.\n• *Comparison of On-Premise and Cloud Service Offerings:* Jared, Arun, and Melissa detailed the differences between Adobe AEM Forms’ on-premise and cloud service models for the Verizon team, covering entitlements, technical capabilities, user management, infrastructure, and the implications for AI features and integration.\n• *On-Premise Model Details:* Jared outlined the on-premise proposal, which includes up to 360 million renditions per year, AEM Forms Portal, reader extensions, adaptive forms, interactive communications, integrations, and media library, with clarification from Arun that the charging model is based solely on renditions, not individual modules.\n• *Cloud Service Model Details:* Jared described the cloud service offering, which also supports 360 million renditions per year but adds Cloud Manager for environment management, automated provisioning of production, stage, and dev environments, and Adobe-managed compliance and security for infrastructure.\n• *User and Environment Management:* Arun clarified that on-premise allows unlimited local installations of the Forms Designer, while the cloud version includes both standalone and integrated designer tools with upcoming versioning support; disaster recovery and redundancy are managed by the customer on-premise but handled by Adobe in the cloud.\n• *AI and Innovation Availability:* Todd, Arun, and Melissa explained that AI-driven features, such as Gen AI authoring and prompt-based template generation, are exclusive to the cloud service, with ongoing innovation and integration with other Adobe cloud solutions, while on-premise does not support these AI capabilities.\n• *Technical Clarifications on Renditions, Templates, and Integration:* Sunil, Ani, Williams-VZ, and Arun engaged in a detailed technical discussion to clarify the definition of renditions, template management, asset handling, and integration options for both on-premise and cloud deployments.\n• *Definition and Counting of Renditions:* Arun confirmed that a rendition is defined as a single generated document (not per page), regardless of whether it is a bill, letter, or other template, and applies to both digital and print outputs; repeated retrievals of the same stored document do not count as additional renditions if the document is not regenerated.\n• *Template and Asset Management:* The team discussed that the Forms Designer is used to create templates, which are then uploaded to AEM; the Media Library is used for managing in-house assets such as icons and logos, and is not an external stock library, with asset search and management available within the repository.\n• *Feature Inclusion and Additional Purchases:* Arun clarified that all listed features (e.g., Forms Portal, Designer, Media Library) are included in the base package, and the only charge is for the number of renditions; there is no need to purchase additional modules for the described use cases.\n• *Integration and Batch Processing:* Arun explained that both API and batch processing are supported: on-premise uses local infrastructure for batch data and output, while the cloud version uses Azure Blob storage; both models support synchronous and batch operations, with the cloud offering additional integration benefits for multi-solution architectures.\n• *Next Steps and Internal Decision Process for Verizon:* Sunil and Williams-VZ outlined Verizon’s plan to review the provided proposals, compare with existing Adobe assets, and conduct internal discussions regarding business case justification and funding, with Adobe offering support for business case development and follow-up in January.\n• *Internal Review and Comparison:* Sunil stated that the Verizon team will review the provided pricing and feature slides, compare the proposed AEM Forms solution with existing Adobe assets already in use by Williams-VZ’s team, and determine which approach best fits their use case.\n• *Business Case and Funding Considerations:* The team discussed the need to prepare a business case and secure funding for the proposed solution, with Sunil noting that the internal process will determine the channel and structure for funding, and that Adobe’s Digital Services group can assist with business case development at no cost.\n• *Timeline for Follow-Up:* It was agreed that, due to the holiday period, the Verizon team will reconvene internally and plan to reconnect with Adobe in the second week of January to discuss next steps and any further questions.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.370Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1767606144.777479"
  },
  {
    "id": "0c9c08b5-1fed-4a02-8283-aaaa04f559da",
    "source": "slack",
    "text": "*\n• *Migration of Ministry of Defence Forms to AM Forms Cloud Service:* Tano Polizzi and Darshan Mahor discussed the opportunity to migrate the UK Ministry of Defence's legacy on-premises forms system to the AM Forms cloud service, focusing on replicating existing forms, ensuring accessibility, and leveraging new AI capabilities.\n*Migrate Existing XDP:* Tano Polizzi and Darshan Mahor reviewed the technical steps for importing legacy XDP files, resolving compatibility issues, and generating accessible, fillable PDFs using AM Forms cloud service APIs and UI.\n\n*AI Assistant Capabilities:* Tano Polizzi and Darshan Mahor explored the process of converting PDF into adaptive forms and Darshan provided information about Forms Experience Builder Capabilities w.r.t to IC/AF.\n\n*Action Items and Next Steps for Demo Preparation:* Tano Polizzi and Darshan Mahor outlined action items to prepare for a customer demo, including environment enablement, documentation delivery, and scheduling a follow-up meeting with additional team members.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.263Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1767774077.405919"
  },
  {
    "id": "c28fac73-3f93-4cc8-a272-fd4405007a82",
    "source": "slack",
    "text": "*\n• 3-4 GenAI converted forms are in QA phase and should be live in some time. 2 others are in progress.\n• LPL is looking to build more forms this year and will onboard more members from their operations team\n• LPL might need onboarding session for Experience builder from Engineering to onboard the operations-team for new conversions.\n• LPL Raised a few issues related to conversions and the quality. Engineering to look into those.\n• Discovery agent demo to be showcased in the next call.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.154Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1767779861.747509"
  },
  {
    "id": "9fad453c-bc22-4b48-b5e0-b0210692253f",
    "source": "slack",
    "text": "*\n_AI-generated content may be incorrect_\n*Meeting notes*\n• *PDF to XDP Conversion Issues and Troubleshooting:* Tano described challenges encountered when converting legacy PDFs to XDP files using experimental APIs, with Darshan and Gaurav providing analysis and troubleshooting support, and Prateek Awasthi assigned to further investigate issues with empty fields in the conversion output.\n• *Feature Parity Between Life Cycle and Interactive Communications:* Tano inquired about the comparison of features between Adobe Life Cycle and Interactive Communications, with Chris explaining the current status of feature parity, the beta nature of IC on cloud, and the process for prioritising customer-required features.\n• *Generating Accessible and Fillable PDFs from Interactive Communications:* Tano sought guidance on generating accessible and fillable PDFs from Interactive Communications, with Darshan detailing the available APIs, documentation, and technical steps, and Gaurav clarifying the distinction between different conversion flows.\n• *AI Assistant and Experience Builder for Form Conversion:* Tano, Gaurav, and Darshan discussed the use of the AI assistant (Experience Builder) for converting PDFs and XDPs to adaptive forms, including technical details, limitations, and recommendations for customer demonstrations.\n• *Access to Experimental APIs and Permissions:* Tano requested access to experimental APIs for XDP generation, with Darshan agreeing to enable the required APIs upon request and clarifying when their use is necessary.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:09.045Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1767793373.896409"
  },
  {
    "id": "27d04d2d-09da-4d7a-bf67-5470e0c83565",
    "source": "slack",
    "text": "*\n• *Requirement* - Fidelity Stock Plan Services has a requirement to migrate to the latest versions of Windows Server, Microsoft Office, and Adobe Acrobat. With the newly supported Microsoft Office 2021 and Acrobat DC (FRL), multi-threaded conversions are not supported by default and the customer has a strong requirement to support multi-threaded PDFG conversions.\n• *Proposed Solution* - The customer is on the OSGi platform. To address the requirement, the single-user mode multi-threaded support(which was also shared for JEE) was made available through a buddy build for OSGi env. The details of the buddy build and the configuration are outlined here: <https://wiki.corp.adobe.com/display/lc/PDF+Generator+Support+for+Office+2021+and+Acrobat+DC>\n• *Outcome -* The CSE team has successfully validated the buddy build in their environment after enabling single-user mode.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:08.938Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1767941642.953959"
  },
  {
    "id": "f7b1cd33-e203-4414-a4f7-37d7f841a92a",
    "source": "slack",
    "text": "*\n• *Bulk Migration Need:* Customer highlighted the urgency to migrate ~1900 RIA forms from DocuSign to AEM; manual conversion (~2 hrs/form) is not scalable.\n• *Batch API Approach:* Engineering outlined batch APIs for PDF-to-AEM conversion with async processing and rate limits; recommended starting with small batches to validate quality.\n• *Pilot Testing:* Customer agreed to provide 50 commonly used PDFs for initial API testing before scaling.\n• *Field Mapping &amp; Reports:* Engineering confirmed automated field mapping with a conversion report highlighting unbound fields; manual review still required.\n• *Form Elements Issues:* Customer noted ongoing issues with radio buttons and checkboxes in Acroforms; Engineering to investigate.\n• *Form Standardization:* Customer confirmed high similarity across RIA forms; fragments were previously used but abandoned due to maintenance complexity.\n• *Discovery Agent:* Engineering referenced semantic search capabilities and offered additional demos if there’s interest.\n• *Metrics &amp; Impact:* Engineering requested time-savings and throughput metrics; Customer agreed to collect and share.\n:todo_done: *",
    "created_at": "2026-01-25T16:46:08.831Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1768367896.017359"
  },
  {
    "id": "85bd49b5-64b7-4693-97e4-9fdc2703aab2",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Arun, Martin, Christoph, and Sven discussed the decision to stop using EM forms and replace them with a custom-built form solution from another vendor. The meeting aimed to understand the reasons behind this decision and explore potential ways to retain some of the business. \n• *Decision to Replace EM Forms:* Martin and Christoph explained that the decision to stop using EM forms was primarily due to the cost of ownership and license costs. The decision was made at a higher level, and the team is now trying to convince some markets to adopt a custom solution. \n• *Current Implementation and Concerns:* Christoph and Sven discussed the current on-premise implementation of forms and the concerns around the cost of ownership. They also mentioned that the pricing did not change significantly, and the decision to move away from EM forms was based on the initial expectation of a large price increase. \n• *Convincing Markets and Custom Solutions:* Christoph and Sven highlighted the need to convince markets, especially Japan, to adopt a custom solution. They discussed the importance of showcasing the advantages of EM forms, particularly in terms of AI capabilities and integration with other services. \n• *Integration with Edge Delivery Services:* Arun and Sven discussed the previous attempts to move BMW to Edge delivery services and the challenges faced due to the lack of integration between the website and forms. They emphasised the need to present a unified experience to the customer. \n• *Pitching EM Forms and AI Capabilities:* Arun and Sven planned to pitch the latest EM forms and AI capabilities to BMW, highlighting the ease of form creation, analytics, and integration with other services. They aimed to demonstrate the superiority of EM forms over custom-built solutions. \n• *Meeting with BMW Stakeholders:* Sven mentioned the need to identify the new responsible person at BMW after the reorganisation. The team planned to approach Nadine and understand who is responsible for forms to pitch the new solutions and change the sentiment towards AEM forms. \n• *Preparing for the Pitch:* Arun, Martin, and Christoph discussed the need to sync before the pitch to ensure they highlight the right value propositions. They planned to review the material and agenda before the meeting to make a strong case for retaining and expanding the use of EM forms. \n:todo_done: *",
    "created_at": "2026-01-25T16:46:08.723Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1768451922.332899"
  },
  {
    "id": "dbeab955-0d64-45ca-8103-73e29c39f39b",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Arun, Chmelik Aaron, Vijay Kumar, and Sudhanshu introduced themselves and their roles. The meeting aimed to discuss the migration from Marketo forms to AEM forms and the potential benefits of this migration. \n• *Marketo to AEM Forms Migration:* Arun and Chmelik Aaron discussed the benefits of migrating from Marketo forms to AEM forms, including easier form creation, modifications, and continuous monitoring for higher conversion rates. They proposed engaging in a POC to analyse the current Marketo forms and identify opportunities for improvement. \n• *Organisational Changes:* Chmelik Aaron mentioned upcoming organisational changes in February or early March, which would involve assigning a person to own the B2B forms. This person would be responsible for driving the migration and optimisation process. \n• *Forms Optimisation Overview:* Sudhanshu provided an overview of forms optimisation, explaining how it aims to increase user engagement, improve form conversion rates, and ensure compliance with accessibility standards. Arun added that the POC would involve deploying the Sites Optimizer module to identify opportunities and make changes to the forms. \n• *Cost and Licensing:* Chmelik Aaron raised concerns about the cost and licensing of the Sites Optimizer module. Arun clarified that the POC would not involve any licensing costs and that the initial engagement would focus on proving value. The cost discussion would be addressed later if they decide to continue using the product. \n• *Next Steps and Timeline:* Arun and Chmelik Aaron agreed to re-engage in early March to discuss the POC and involve Luis Michelle, who would be responsible for driving the B2B forms optimisation. They also discussed the need to enable operational telemetry data collection as pre-work for the POC. \n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:08.618Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1768452083.682849"
  },
  {
    "id": "02772920-d5f5-4bde-95d4-413dba4c216b",
    "source": "slack",
    "text": "*\n• High level overview of the opportunities was shared\n• S&amp;P Global is moving from AMS to CS - including a division - which is separating from the org - and would be moving to EDS forms (June-Sept) on CS. Other divisions (main S&amp;P Global) would move to AF (non EDS) Forms on CS (Sept-March'27).\n• They shared that the progressive form opp. is something they have tried - and currently doing an A/B Testing as well - results not yet available (not done for most forms - which is the main opp. we shared)\n• Highlighted that for them conversion means sales - not just form submission - and after a few changes - they were able to increase submissions - but leads were not quality leads.\n• Varun shared how we analyze the forms - and the complete flow - and how we have engaged with another customer for more quality leads.\n• Customer highlighted that the change may not be no-code - since their forms are of 2 types - frontend driven - which would work - but another - backend driven (/energy) - which has empty submit. Shared a contact of Yugi from ACS team - who was engaged in initial discussion to move to cloud and would have more details (Site migration is planned as lift&amp;Shift - while for forms ACS proposed - recreating the forms - as it would be faster).\n:todo_done: *",
    "created_at": "2026-01-25T16:46:08.502Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1768453320.359949"
  },
  {
    "id": "4f6916d9-4fd0-46ad-9407-e04519904386",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *XFT to Adaptive Forms Migration Process:* Paul provided Vijay Kumar, Sudhanshu, and Satya Deep with a comprehensive overview of the migration process from legacy XFT forms to adaptive forms for the State of Washington project, detailing the technical workflow, challenges, and the use of custom utilities and scripts.\n• *Legacy System Overview:* Paul explained that the original system consisted of approximately 300 XFT forms created in a VB application called Forms Gen, which interacted with various backend systems and produced both input and output forms, with output forms being archived and printed for different outlets.\n• *Migration Workflow and Tools:* The migration involves parsing XFT files using a custom Python script to extract fields, properties, and embedded VBScript logic, which are then compiled into a specification spreadsheet that forms the basis for adaptive form development.\n• *Reusable Components and Theming:* Paul described the creation of reusable fragments for common elements such as names and addresses, the development of a common theme and template, and the use of client libraries and custom layouts to standardize and streamline adaptive form creation.\n• *Output Form Generation and Packaging:* The process includes assembling document packages by combining adaptive forms with output templates (XDPs), leveraging assembler APIs, and integrating third-party libraries for PDF handling and redaction, with the final packages distributed or archived as required.\n• *Specification and QA Process:* A detailed specification document is generated for each form, reviewed and approved by the client, and used as a reference for both development and QA, ensuring alignment and traceability throughout the migration.\n• *Project Scale, Timelines, and Resource Allocation:* Vijay Kumar and Sudhanshu inquired about the overall scale, batch processing, and time estimates for form migration, with Paul clarifying the number of forms, batching strategy, and the breakdown of effort between adaptive and output forms.\n• *Form Volume and Batching:* Paul stated that the project involves migrating approximately 300 input forms and 800 output forms, with work proceeding in batches of five to ten forms at a time, and the current contract targeting around 100 adaptive forms.\n• *Time Estimates and Workflow:* The typical timeline for creating an adaptive form is two to four weeks, depending on complexity, with the process including specification generation, client review, and development, while output templates are generally simpler and can be created in a day.\n• *Effort Distribution:* Paul explained that adaptive form development usually takes one to five weeks per form for a developer, while output template creation is much faster due to their static and repetitive nature, and that work on output forms can begin in parallel with adaptive form specification review.\n• *Reuse and Efficiency Gains:* The team leverages existing forms and fragments to accelerate development, often modifying similar forms rather than starting from scratch, which reduces effort and increases velocity as the project progresses.\n• *Automation, Utilities, and AI Opportunities:* Satya Deep and Sudhanshu discussed with Paul the evolution of migration utilities, the potential for cumulative improvements, and the possible application of AI to further streamline specification generation and logic extraction.\n• *Utility Evolution and Pattern Matching:* Paul described how the custom Python script and associated Excel-based dictionary are incrementally improved by capturing and reusing common code patterns and logic, making the specification process more efficient over time.\n• *Challenges with Legacy Code:* Despite automation efforts, significant variation in legacy VBScript and form logic limits the extent of automation, requiring manual review and interpretation, especially for unique or complex cases.\n• *Potential AI Applications:* Paul and Satya Deep discussed the potential for AI to assist in interpreting legacy VBScript, generating specifications, and identifying reusable components, with the goal of reducing manual effort and accelerating the migration process.\n• *Future Collaboration and Demonstrations:* Vijay Kumar proposed a follow-up session to demonstrate current AI agent capabilities for form authoring and to review a sample migrated form, aiming to identify areas where AI can further optimize the workflow.\n• *Technical Architecture and Integration Details:* Paul outlined the technical architecture supporting the migration, including the use of Spring Boot applications, REST APIs, assembler calls, and integration with backend systems, as well as the project’s deployment and tracking infrastructure.\n• *Forms Gen Server and API Integration:* Form submission data is sent as JSON to a Spring Boot-based Forms Gen Server, which interfaces with Adobe APIs via a partner-provided REST layer, orchestrates PDF generation, and assembles document packages for distribution or archival.\n• *Project Management and Tracking:* The team uses two Jira systems—one internal and one customer-facing—for tracking development tasks and QA findings, with the project built using Maven, VS Code, and GitHub for version control and deployment.\n• *Next Steps and Collaboration Planning:* The group agreed on next steps, including sharing specification documents and form packages, arranging access to development environments, and scheduling a follow-up meeting to demonstrate and compare form authoring approaches.\n• *Sharing Artifacts and Access:* Paul committed to sharing a sample specification document and, if possible, providing access to a development environment or project package for Vijay Kumar, Sudhanshu, and Satya Deep to review.\n• *Follow-Up Meeting Objectives:* The next meeting will focus on demonstrating current AI agent capabilities, reviewing a sample migrated form, and discussing technical and process details to identify further opportunities for collaboration and optimization.\n\n:todo_done: *",
    "created_at": "2026-01-25T16:46:08.313Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1768811097.368169"
  },
  {
    "id": "523e7b90-8736-4302-a7ba-ab652c47567a",
    "source": "slack",
    "text": ":customervivo:*Customer Name : LPL Financial*\n:clock2: *Date :* 2025-05-21\n:group-people: *Attendees :* <@W9QMZFR39>, <@W4R4VBWQG>, <@U0213T59LMN>, <@W4RU708G5>, <@W4RU5J3JR>, <@W4RRL6DDY>\n:loading-2248:*Notes*\n• Presented two major use cases for form pre-filling(from user entered data and from incoming persisted Json) and the current approach involving manual conversion and data binding, highlighting scalability issues. We got confirmation from the customer about pain points and workflow.\n• They discussed the challenges of converting forms from Word documents to AEM forms, emphasizing the time-consuming nature of the process. They also mentioned that incoming Form can be in word format also.\n• Demonstrated AFCS with its current capabilities and how these can be leveraged to address certain use cases in the existing implementation. Specifically, we showcased the flow: Acroform PDF → AF → Auto DoR.\n• Demonstrated the Forms Experience Builder, showcasing its ability to create and modify forms using natural language input and images.\n• We also demonstrated a PoC where Forms Experience Builder analyzes AFCS-converted Adaptive Forms for quality issues, aiming to enhance the accuracy of automated conversions. This is in Dev and we are working on it for improving its quality.\n:todo_done: *Next Action*\n• *AI Feature Access:* Check with the relevant team and enable AI feature access on LPL's sandbox account. (Adobe)\n• *Weekly Sync Setup:* Sync up with Naveen offline to set up weekly sessions starting next week. (Adobe)\n• *Priority Forms:* Share priority forms with Adobe for conversion and analysis. (LPL)\n• *Recording of Meeting:* Send the recording of today's meeting to Tian. (Adobe)",
    "created_at": "2026-01-13T09:07:22.148Z",
    "customers": [],
    "channel": "C08T43UHK9D",
    "thread_ts": null
  },
  {
    "id": "8b28526a-b1a1-4fd3-af87-6a7886d876b4",
    "source": "slack",
    "text": ":customervivo:*Customer Name : IRS*\n:clock2: *Date :* 2025-05-20\n:group-people: *Attendees :* <@W4XTCQ07J>, <@U0213T59LMN>, <@W4RU5J3JR>, <@W4R4S9FS4>, <@W5HEU5M7Y>, <@W4R5LUPK3>\n:loading-2248:*Notes*\nGenerated by AI.\n*IRS attendees* (_there were more attendees from IRS - but active participants were_):\n• JP Terry\n• Ande Vara Prasada Rao\n• Gower Andrew R\n*Meeting notes:*\n• *Automated Forms Conversion Service Demo:*\n• \n    ◦ *Automated Forms Conversion Service Configuration:* Gaurav demonstrated the configuration of the automated forms conversion service on a local setup, including adding developers, creating projects, and configuring the service on the AM instance.\n        ▪︎ *Service Configuration:* Gaurav explained that when the Automated Forms Conversion (AFC) service is provisioned for an organization, an administrator is assigned to add developers responsible for configuring the service on the AM instance. The administrator uses the admin console to add developers to the product profile.\n        ▪︎ *Developer Console:* After being added, developers need to create a project in the developer console, add an API, and configure server-to-server authentication. Gaurav demonstrated creating a new project and selecting the automated forms conversion API.\n        ▪︎ *Client ID and Secret:* Gaurav showed that after configuring the API, developers receive a client ID, client secret, scopes, and organization ID. These details are used to configure the AM local server by going to the security settings and Adobe IMS configurations.\n        ▪︎ *Health Check:* Gaurav performed a health check to ensure the configuration was correct, confirming successful token retrieval and authentication for the automated forms conversion service.\n    ◦ *Cloud Configuration for Automated Forms Conversion:* Gaurav explained the process of creating a cloud configuration for the automated forms conversion service, including selecting templates and themes for the converted forms.\n        ▪︎ *Cloud Services:* Gaurav navigated to the cloud services section to create a cloud configuration for the automated forms conversion service. He demonstrated selecting a contribution folder and naming the configuration.\n        ▪︎ *Endpoint and Template:* Gaurav explained that the endpoint for accessing the service and the template type (foundation-based or core component-based) are selected during the configuration. He showed how to choose a template and a theme for the converted form.\n        ▪︎ *Configuration Example:* Gaurav provided examples of configurations for both V2 (core component-based) and foundation-based templates, showing the IMS and cloud configurations already set up.\n    ◦ *Conversion of PDF to Adaptive Forms:* Gaurav showed how to upload a PDF and start the automated conversion process, resulting in an adaptive form with the same fields and structure as the original PDF.\n        ▪︎ *PDF Upload:* Gaurav demonstrated uploading a PDF document with fields such as date, reason, total amount, and text areas. He explained that the document is uploaded to the AM instance.\n        ▪︎ *Start Conversion:* Gaurav showed how to select the uploaded PDF, choose the desired configuration (V1 or V2), and start the automated conversion process. The configurations are prefilled with the selected template and theme, but can be overridden if needed.\n        ▪︎ *Conversion Process:* Gaurav explained that the conversion process involves sending a request to the AI/ML service, which processes the images and creates an adaptive form. He showed the converted output, highlighting that the fields and structure matched the original PDF.\n        ▪︎ *Foundation and Core Components:* Gaurav demonstrated the converted outputs for both foundation-based and core component-based forms, showing that the fields were correctly identified and configured in the adaptive forms.\n    ◦ *AI and Machine Learning in Forms Conversion:* Ande and Gaurav discussed the role of AI and machine learning in identifying widgets and fields in the PDF during the conversion process.\n        ▪︎ *AI Role:* Gaurav explained that AI helps identify widgets and fields in the PDF, such as captions and input fields, by analyzing the structure of the form. The AI models group related captions and fields to create adaptive form fields.\n        ▪︎ *Field Grouping:* Gaurav provided an example where the AI grouped a caption and input field to create a field for capturing the insured name. He also explained how sections and panels are identified and extracted from the PDF.\n        ▪︎ *Vision Models:* Gaurav mentioned that vision models and machine learning models are used to identify the structure, fields, sections, and captions in the PDF, enabling the creation of adaptive forms from straightforward PDF screenshots.\n    ◦ *Issues with Core Component Template:* Terry raised an issue with the core component template failing to convert forms, and Gaurav suggested providing the latest build and enabling a feature toggle to resolve the issue.\n        ▪︎ *Issue Raised:* Terry reported that while the foundation component template worked fine, the core component template failed to convert forms, displaying an error message suggesting retrying the conversion or contacting Adobe support.\n        ▪︎ *Latest Build:* Gaurav acknowledged the issue and suggested that the latest build and enabling a feature toggle could resolve the problem. He mentioned that the core component form conversion support was recently added.\n        ▪︎ *Configuration Steps:* Terry asked if any additional steps were needed on the server. Gaurav confirmed that once the latest code and feature toggle are enabled, creating a new configuration with the core component template should work.\n        ▪︎ *Service Pack:* Terry inquired about the required service pack version. Gaurav promised to confirm whether a new service pack or the existing one (6.5.22 or 6.5.23) would suffice and share the necessary details.\n    ◦ *Custom Components and Meta Model:* Gaurav explained how to use the meta model to map custom components to specific fields during the forms conversion process.\n        ▪︎ *Meta Model:* Gaurav introduced the concept of the meta model, which allows extending out-of-the-box configurations by mapping custom components to specific fields identified in the PDF during the conversion process.\n        ▪︎ *Custom Component Mapping:* Gaurav demonstrated how to map a custom component, such as an SSN field, by providing a mapping in a JSON file. This mapping ensures that the custom component is used instead of the default component during conversion.\n        ▪︎ *Configuration Path:* Gaurav showed that the custom meta model can be uploaded to the AM instance, and the path to the JSON file can be specified in the cloud configuration to apply the custom mappings during conversion.\n        ▪︎ *Form Level Validations:* Ande asked about including form-level validations in the meta model. Gaurav confirmed that properties such as required fields, default values, and validation rules can be added to the JSON file and applied during conversion.\n    ◦ *Security Concerns with Cloud-Based Conversion:* Ande asked about security concerns with cloud-based conversion, and Anurag assured that the communication is secure and within the IRS authenticated context.\n    ◦ *Popularity of Automated Forms Conversion Service:* Ande inquired about the popularity of the service, and Anurag confirmed that several customers have been using it since its release in 2017-2018.\n• *Generative AI Demo:* Gaurav demonstrated the capabilities of the Form Experience Builder, a conversational assistant that helps in authoring and creating form experiences using generative AI.\n    ◦ *Form Creation:* Gaurav demonstrated the Form Experience Builder, which uses generative AI to create forms based on user-provided intents. He showed how to enter an intent, select a template and theme, and create a form.\n    ◦ *Assistant Interface:* Gaurav explained the assistant interface, which provides commands for creating and updating forms. He demonstrated adding a panel, updating the layout, and creating business logic using the assistant.\n    ◦ *Rule Creation:* Gaurav showed how to create a rule for setting an email address based on the first and last names. The assistant generated the rule, and Gaurav confirmed its functionality in the preview mode.\n• *Cloud Sandbox for Generative AI:* Arun suggested setting up a cloud sandbox for the IRS team to use the generative AI technology for creating forms, as it is currently only available in the cloud version.\n:todo_done: *Next Action*\n• *Next Steps for Core Component Support:* Arun and Terry discussed the next steps for enabling core component support in the automated forms conversion service, including backporting changes and providing a hotfix.\n• *Impact on Form Digitization Plans:* Arun and Terry discussed how the new features and tools could expedite the digitization and modernization of IRS forms, with a focus on enabling core component support first.\nFollow-up tasks:\n\n    ◦ *Core Component Conversion Issue:* Confirm whether the latest code or service pack is required for core component conversion and share the necessary details with Terry. (Gaurav)\n    ◦ *Core Component Conversion Issue:* Provide Terry with the latest build or hotfix for core component conversion and enable the feature toggle. (Anurag)\n    ◦ *Core Component Conversion Issue:* Set up a new server dedicated to testing the core component conversion and ensure it is configured correctly. (Terry)\n    ◦ *Core Component Conversion Issue:* Submit a support ticket to enable the feature toggle for core component conversion on the IRS account. (Ande)\n    ◦ *Core Component Conversion Issue:* Discuss internally and provide an ETA for the hotfix and feature toggle for core component conversion. (Anurag)\n    ◦ *Core Component Conversion Issue:* Run a test on the core component conversion and report any additional requirements or issues. (Terry)\n    ◦ *Cloud Sandbox Setup:* Discuss and set up a cloud sandbox for testing the generative AI and other advanced features. (Arun)\n    ◦ *Form Conversion Sections:* Share the PDF form with Gaurav to review and ensure it converts into sections correctly. (None) - <https://www.irs.gov/pub/irs-pdf/f433aoi.pdf>",
    "created_at": "2026-01-13T09:07:22.143Z",
    "customers": [],
    "channel": "C08T43UHK9D",
    "thread_ts": null
  },
  {
    "id": "66de385f-9fe7-4682-b706-d77733e6658f",
    "source": "slack",
    "text": "Reminder: *Please send following updates in threaded view on slack*\n*1. Updates since the last sync up.*\n*2. Are you blocked on anything?*\n*3. What is the next milestone to be achieved.*",
    "created_at": "2026-01-13T09:07:22.142Z",
    "customers": [],
    "channel": "C08T43UHK9D",
    "thread_ts": null
  },
  {
    "id": "a6b0f1e7-be77-4f06-a564-c13e5c7706f1",
    "source": "slack",
    "text": ":customervivo:*Customer Name : NFCU*\n:clock2: *Date :* 2025-05-22\n:group-people: *Attendees :* <@W010NNJV7S8>\n:loading-2248:*Notes*\n• NFCU talked about expanding the adoption of IC Editor internally, subject to maturity of the product.\n• They have 2 projects coming up spanning across other departments in NFCU in the next quarter, that would start in mid June\n• The major requirement of the 1st project data binding from APIs\n• The requirements for the 2nd project is still being figured out, but based on the rudimentary details they currently have, it seems to make a good fit for Associate UI\n:todo_done: *Next Action*\n• NFCU will come back with more refined requirements in the next call\n• They are interested in seeing the current status of the IC Editor, and update it in their dev and stage environments\n• Adobe to showcase current status and share high level Roadmap",
    "created_at": "2026-01-13T09:07:22.141Z",
    "customers": [],
    "channel": "C08T43UHK9D",
    "thread_ts": null
  },
  {
    "id": "afe9600b-6699-49b6-959c-77150fbc4cae",
    "source": "slack",
    "text": "*<https://www.clarkcountynv.gov/|Clark County> Went live on Friday (16th May) !* :partying_face:\n\n• Clark County is the first forms customer to go-live on *forms-x-walk using Universal Editor*!\n• 24 forms went live delivering seem less form filling experience across the county site.\n• The VIP team used Experience Builder to create most of the content and rules. Authoring was completed in ~2 days.\n• All forms were configured to Power-Automate submission that triggered an email to the respective county department mailboxes.\nA huge shoutout to the VIP team: <@W4V7BFNKD> <@W4R4PH17S> <@W4ZA9ATAM>\nAnd thanks to forms engg team: <@U01G51VDXB8> <@U03QB0GK45Q> <@U06NF880220> <@U03N27GAZDZ> <@WLWHN4TV3> <@W6CBB4953> <@W6CBB6337> <@U04P75X4H1B>\n\nCongrats to everyone involved in making this a successful golive! :tada:\n\ncc: <@W4RU4N66R> <@W4RSW3ECC> <@W4R5LUPK3> <@U0213T59LMN> (edited)",
    "created_at": "2026-01-13T09:07:22.082Z",
    "customers": [],
    "channel": "C08T43UHK9D",
    "thread_ts": null
  }
]