[
  {
    "id": "397c43ec-cdbc-44d9-a0af-d7a4abb1564e",
    "source": "slack",
    "text": "*\n• The proposal was well received and we have moved to next stage of RFP. \n• A call with reference customer from Austria, Constantia Teich is scheduled on April 22, 2025. \n• Post this, we will move to next stage of RFP where we will have to present a custom demo of IC on CS to them. \n:todo_done: *",
    "created_at": "2026-01-30T06:27:38.396Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744716758.455559"
  },
  {
    "id": "30bd21a2-8f34-4f80-8778-efdcbf9353a4",
    "source": "slack",
    "text": "*\n• A general discussion happened around how would we handle DB’s migration from older CM to IC on CS. \n• We discussed about VIP engagement to to do a pilot migration of couple of letters. As an outcome of this VIP, these letters should be live on CS and we should have an approach in place to migrate rest of the DB assets block by block. \n:todo_done: *",
    "created_at": "2026-01-30T06:27:36.888Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744717007.197449"
  },
  {
    "id": "3f413e32-f0f1-4688-9971-d6fa02487e55",
    "source": "slack",
    "text": "*\n*Discussion on Accessibility Issues in INAIL Forms:*\n• We reviewed the accessibility issues related to the forms being created by INAIL.\n• The accessibility team provided several comments, which can be resolved if the correct structure is established by the form designer during the template creation phase in AEM designer\n• We discussed around how the checkboxes should be read by the screen reader when the state is checked or unchecked. This can also be handled if the template is created in the right way using AEM Designer.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:35.380Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744812451.729969"
  },
  {
    "id": "c0875f8b-19f1-405a-ba3b-a5cd9535ba74",
    "source": "slack",
    "text": "*\n*Major pain points for Customer that we need to handle in VIP Engagement:*\n• *Scalability Issues:* Scalability has been identified as a major challenge, it takes significant time and effort  to design and bind a large number of forms.\n• *Binding Steps:* The current process involves few steps like binding in XDP , changing in transformation code etc , making it inefficient and time-consuming.\n• *Framework Limitations:* The existing framework does not scale effectively for a large number of forms. Each new form requires manual mapping and binding, which is unsustainable for the 2,000-3,000 forms that need to be converted.\nWe need to provide the approach via which customer can successfully transform their pending forms is scalable manner (if possible via some automation)\n\n*Summary:*\n• The incoming JSON does not follow a standard schema and may change with new forms and fields.\n• Currently, for each new form, customers must manually design it in the Designer. If new fields are added, they also need to update the transformation code and XSD schema.\n• The customer mentioned that they have several mandatory forms for specific customers, implemented via Adaptive Forms for data capturing. Data from these forms will be included in the incoming JSON and used to generate PDFs via the Output Service. We plan to discuss this further in upcoming meetings.\n• Additionally, the customer mentioned that they still need to migrate 2,000-3,000 forms.\n*Topics for upcoming meetings:*\n• The usage of Adaptive Forms and their integration into the incoming JSON.\n• *Analyze Metadata Call:* Explain and show the process of retrieving form metadata and its necessity in the workflow.\n• *Review Custom Endpoint:* Discuss the custom endpoint of PDF generation and what additional steps are being performed in that.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:33.872Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744825792.076749"
  },
  {
    "id": "9c7bdc48-15da-4396-88a4-3802fd1ddd23",
    "source": "slack",
    "text": "*\n*Use-Case*\n\n• The current solution Unipol uses for generating PDFs is Pega. They have integrated it in their product and uses it to define the template for communications.\n• The template is composed of multiple sections and rules are defined on them for dynamic content. Rules are data based and data is coming from external service/database.\n• PDFs are generated on demand as well as in batches(1000letters).\n• The use-case is to migrate from Pega.\nCommunication Composer was presented to the Partner Reply and they showed interest and wanted to try it on their end.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:32.362Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744888036.289559"
  },
  {
    "id": "32055a06-5df0-4009-b7ed-4599ecdf0a1a",
    "source": "slack",
    "text": "*\nHad Meeting with NFCU Engineers (Ashish and Ashwairya).\n• NFCU is looking for dates for MVP features to their usecase primarily FDM, Render API, Basic Rules.\n• Informed them that by *May end* these features should be available, showcased that we are tracking the sheet where they shared their requirements.\n• They are creating use-case to showcase to their Business, after which go-live date would be decided.\n• Engineering sessions are helping and NFCU wants to get regular updates to their env.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:30.855Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744902425.184379"
  },
  {
    "id": "64458678-9b2c-4c18-bc62-cf2a69829eb9",
    "source": "slack",
    "text": "*\n• The customer explained their workflow for fetching the metadata required for e-signature and described the Output Service custom endpoint.\n• They are making two calls to the AEM repository: one to fetch metadata and another to fetch the template based on formID. This second call is redundant since the template path is already included in the metadata.\n• They confirmed that they start designing the forms from scratch, adding fields to create the XDPs (similar to the PDF forms they intend to migrate to AEM Forms). So far, they have designed around 50 forms.\n• They mentioned using fragments for common business logic across different workflows, such as new account openings.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:27:29.346Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1744912326.949669"
  },
  {
    "id": "28a7a6cd-5981-4f36-a340-68c4c40a922b",
    "source": "slack",
    "text": "*\n*Attendees:*\n• Adobe Engineering, Consulting &amp; License\n• Accenture Federal Technical, Program, and Account Resources\n*Agenda:*\n• Forms Categorization/Prioritization\n• Technology Approach\n• Core Components\n• Forms Converter Tooling – Forms Automation Resources\n*Key Discussions:*\n1. *Overall Customization* :\n    ◦ *Wizard Customization*: Extended to meet styling guides and JavaScript requirements. \n    ◦ *Summary Component*: Implemented to display errors as users move to the next section of the form. \n    ◦ *Review Component*: Generates a table listing all form fields before submission, leveraging the JSON model. \n    ◦ *Signature Component*: Custom component for signature, which includes a checkbox and hidden text boxes to meet specific data structure requirements. \n    ◦ *SSN Field*: Custom field for Social Security Number (SSN). \n    ◦ *Save as Draft*: Custom implementation using Postgres database, extending the default save as draft functionality. \n    ◦ *Multi-Signature Solution*: Custom solution for handling multiple signatures, including user verification and form ownership transfer. \n    ◦ *Templates*: There are three different templates used:\n        ▪︎ *No Authentication Template*: For forms that do not require user authentication.\n        ▪︎ *Single Signature Template*: For forms requiring a single signature.\n        ▪︎ *Multi-Signature Template*: For forms requiring multiple signatures.\n2. Current Process of PDF to AF\n    ◦ *XDP Source*: The forms are received as XDP files, which include the XML schema and data dictionary. \n    ◦ *Form Creation Process*: The process involves dragging the XML schema onto the form to create the initial structure. This is followed by implementing business logic and ensuring compliance with 508 requirements. \n    ◦ *Time-Consuming*: The creation of forms takes weeks due to the extensive setup, validation, and adjustments required. \n    ◦ *Business Logic and Validation*: A significant amount of time is spent on implementing business logic and validating the forms with form owners. \n    ◦ *508 Compliance*: Ensuring 508 compliance adds to the complexity and time required for form creation. \n3. *Challenges in current process*:\n    ◦ *Complex Customization*: The signature component, which was previously a fragment with multiple hidden text boxes and a checkbox, required significant setup and was prone to errors by authors. This complexity made it difficult to maintain and use consistently. \n    ◦ *Performance Issues*: The editor for the foundation components was slow and inefficient. For example, moving a panel to a different section often required reloading the entire editor, which significantly slowed down the form creation process. \n    ◦ *Business Logic Implementation*: Implementing business logic and ensuring compliance with 508 requirements (accessibility standards) added to the complexity and time required to create forms. Each component needed detailed configuration to meet these standards. \n    ◦ *Non-Deterministic Process*: The process of converting PDFs to digital forms involved continuous interaction with form owners to capture business rules and validations, making the process non-deterministic and time-consuming. \n    ◦ *Technical Debt*: Using foundation components for new forms would create technical debt, as the core components are seen as the future direction for better maintainability and performance.\n4. *Current Plan*:\n    ◦ Continue using foundation components to avoid uncertainties and risks.\n    ◦ Parallel effort to develop and test core components, including reworking \"save as draft\" and implementing JSON to XML conversion. \n\n:todo_done: *",
    "created_at": "2026-01-30T06:27:27.837Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745205293.573109"
  },
  {
    "id": "11f91901-7fc8-43f1-8e30-0102fc945ae9",
    "source": "slack",
    "text": "*\nDiscussion Summary with NFCU -\n1. *Font Subset Embedding:* NFCU requested the ability to embed font subsets during PDF preview. We clarified that this feature is available when generating PDFs using the output service with XCI. However, it is not currently supported for PDF previews.\n2. *Nested Table Support:* NFCU asked if nested table support would be included in the next release. We responded that this feature is currently not available.\n3. *Repeatable Subform Support in Tables:* NFCU inquired about adding dynamic capabilities to tables. We explained that this can be achieved using repeatable subforms, although this feature is not yet available in the editor.\n4. *Template as Reference:* NFCU requested the use of templates as references. We highlighted potential layout challenges with this approach and suggested trying it with fragments instead.\n5. *Web Hooks:* NFCU inquired about the possibility of implementing web hooks for customization purposes, either post-rendering or pre-rendering. We informed them that currently, we do not support any customization beyond the editor.\n6. *FDM-Related Queries for NFCU:*\n    a. Storage Data Source: We sought information about the storage data source.\n    b. API Details: We inquired about the availability of a Swagger endpoint or file for their REST API.\ncc: <@WQWCBV6NN> <@W4R5LUPK3> <@W9QMZFR39>\n:todo_done: *",
    "created_at": "2026-01-30T06:27:26.330Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745335041.678119"
  },
  {
    "id": "186f2b07-76f1-4d37-aa8e-77199c7b143a",
    "source": "slack",
    "text": "*\n• Demonstrated Forms Experience Builder for core components as well as for EDS forms.\n• Demonstrated Automated Test case generation capability for validating their forms .\n• Customer Queries - if assistant can work with custom components, if it can answer queries about integration with external sources etc. \n• Customer shared they have about 50 lead generation forms with a 3.5% conversion rate. They were interested in increasing the conversion rates and Success Studio was suggested as a project to improve conversion rates.\n• Customer explained their current manual process for form versioning by duplicating forms and using folder hierarchy but the versioning capabilities in forms was proposed since it can help the customer achieve this.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:24.823Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745378411.396529"
  },
  {
    "id": "a5262afc-6102-4582-90da-307c7dfbc619",
    "source": "slack",
    "text": "*\nGlidewell Dental's setup issue was resolved during the call.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:23.318Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745383802.651359"
  },
  {
    "id": "bca604f6-f1d1-49e7-97d0-e399681f0005",
    "source": "slack",
    "text": "*\nCustomers:\n• Martin, George\n• Muravitsky, Valerie\n• Petty, Michael\n• Teague, Stephanie\n• Kolluru, Abhishek\n• Paracka, Jacob J\n*Installation*: On Prem\n\n*Background:* We had a meeting with the customer at the summit and it was a follow up to that. They have XDP forms which are present as links in mutliple websites. The customers fill those forms , print it and post it. They want to digitalize this use case using HTML5 Forms and have some questions around that. During the summit they clearly mentioned they are not planning to move to Adaptive Form currently.\n\nThe team has shared the questions earlier in the mail and we had a discussion around the same.\n\nTheir current architecture that they have tried is that they have a custom servlet which forwards the request to the HTML5 Form rendition and returns that. Then they have an external website which either embeds the Form as iframe or redirects to the AEM Servlet which forwards to the HTML5 Form rendition profile.\n\n1. They wanted a validation of the above strategy and if possible to hide certain parameters from the request. _*Advised them to have sling mapping or some selector based notion to identify the xdp path in their servlet.*_\n2. They have another use case (non iframe), where they want to fetch the HTML from an application or a web app and then insert the HTML in that page. This is also possible with the way we do it for Adaptive Forms, but we need to implement it for HTML5 Forms as well. _*They have asked for a sample if possible.*_ \n3. They currently use an http url to fetch the data but want to hide that url. _*Advised them to provide a prefill service that can take an id and then use that service to fetch the data. Clearly mentioned that we do not store any data in AEM to ease out their security concerns.*_ \n4. They want to cache the HTML content in dispatcher. _*Mentioned that it needs to be supported on 6.5 and they need to raise a new Feature Request for the same.*_\n5. Discussed with them how complex their xdps are and they mentioned they only have some validation rules in the xdps.\n6. Arun asked about cloud migration and they asked for a write up from us on what are the differences between the on-prem version vs Cloud so that they can get a buy in from the higher management\n\n:todo_done: *",
    "created_at": "2026-01-30T06:27:21.811Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745387862.117089"
  },
  {
    "id": "7db50e56-3390-46cc-a959-c1cc46346437",
    "source": "slack",
    "text": "*\n*Use Case:*\n Abbvie intends to automatically save a draft whenever a form submission is triggered. They also want to implement a service that can query these drafts based on form type and timestamp and will process these drafts.\n\n*Discussion Summary:*\n• We proposed enhancing the \"Submit Form\" rule to include a \"Save Form\" action. A demo of this functionality was presented during the meeting.\n• For querying drafts, we have shown the metadata associated with each draft entry. This metadata can be used to filter and retrieve drafts as required.\n• Abbvie inquired about the draft retention policy, which was addressed during the session.\n• Abbvie also expressed the need to encrypt the draft data instead of storing it as plain text, due to the inclusion of PII data.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:27:20.305Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745389270.783369"
  },
  {
    "id": "6f1ecc92-31a2-4a1d-9144-9da40a348f25",
    "source": "slack",
    "text": "*\nUse case:\nACS team reaches out to us to review their custom function regarding for previous and next button in tab. As, they were not aware of using globals and were not sure how to pass field object to custom function.\n\nWhile reviewing their custom code, I recommended them to use three latest features of Visual rule editor which are:\n1. Enhanced invoke service to use condition in success handler.\n2. Add condition with button click.\n3. Add valid/invalid condition at panel level in when.\nAfter using these features, they were able to reduce almost 100 lines of custom code from their js (total lines were 268).\n\ncc: <@W4R5LUPK3> <@U02DW7JLT62>\n:todo_done: *",
    "created_at": "2026-01-30T06:27:18.795Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745390825.395479"
  },
  {
    "id": "ba0842a3-ec9b-4df9-9ad0-754c98616ddf",
    "source": "slack",
    "text": "*\nTFS - Existing IC customer on AMS had connect with Arun during Summit, where they are interested in Cloud based IC, as part of moving to Cloud.\n• 30% of their usecase is PDF generation - No issues in this flow\n• 70% of their usecase is AgentsUI, where TFS Customer representatives fill in the data in static form and generated PDF.\n• They have shared list of issues in existing IC which they want an ETA.\n• Also looking for Roadmap of IC on cloud.\ncc: <@W9QMZFR39>\n:todo_done: *",
    "created_at": "2026-01-30T06:27:17.288Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745465972.890959"
  },
  {
    "id": "0507ec60-3d7d-4511-bc18-76c8811cade6",
    "source": "slack",
    "text": "*\n*Support of `$record` and `$data` API in HTML5 Forms*\n• The customer has tested *hundreds of forms* using the `resolveNodes()` API and *thousands of XDP-to-HTML5 form conversions*.\n•  ➤ All issues observed are either *known* or *minor*, and *do not impact form functionality*.\n• The *go-live* for the first batch of forms is scheduled in *6 weeks*.\n•  ➤ Rollouts will continue across *different departments throughout the year*.\n• The customer is using *third-party fonts* in HTML5 forms.\n•  ➤ The *font specified in the XDP template is not present on client machines*, so the browser defaults to another font (e.g., Arial).\n•  ➤ This *default font sometimes renders random characters*, which is *not aligned with expected rendering* from AEM’s server-side engine.\n• Suggested approach: ➤ Create a *custom HTML5 profile* that:\n    ◦ Includes your *own fonts* as web resources\n    ◦ Loads fonts via CSS using `@font-face`\n    ◦ Applies fonts to the rendered form using *CSS overrides*\n\n:todo_done: *",
    "created_at": "2026-01-30T06:27:15.781Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745490235.841839"
  },
  {
    "id": "ad9930ce-6a4f-48e5-b852-cec058e20433",
    "source": "slack",
    "text": "*\nCustomer: Sreedhar, Ashish, Monika and others\n• :tada: After almost 2 years of VIP engagement, NFCU has gone live with AEM Forms Output (with their custom implementation), with one of their departments (DSC) with a small Subset. \n• Another Department (Admin services) there is workshop/demo meeting where the NFCU team wants to showcase IC on Cloud capabilities and looking forward for the MVP features targeted by May end.\n• NFCU is also looking for support of dynamic Tables which currently is out of May end target.\n• All the changes should be behind FT and we need to make it part of the release, as after validation, NFCU wants to take it to other envs (Stage, Prod)\ncc: <@W4RSW3ECC> <@W5HEU5M7Y> <@W9QMZFR39> <@WQWCBV6NN>\n:todo_done: *",
    "created_at": "2026-01-30T06:27:14.272Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745508620.418529"
  },
  {
    "id": "6c52799e-d7b4-494f-b363-7efbd1cc6f51",
    "source": "slack",
    "text": "*\n*Agenda:*\n• IRS is in the process of migrating a couple of their multi-signer forms to Core Components and time line is end of June.\n• Accenture is acting as the implementation partner for this migration.\n• Accenture wanted to discuss following topics in this call.\n1. *Save as Draft Functionality:*\n    a. Accenture was unable to locate documentation related to the \"Save as Draft\" feature for Core Component-based forms in the on-premise setup.\n    b. We clarified that the draft functionality is currently not available for Core Component-based forms on 6.5 and will need to be back ported.\n    c. A tentative timeline of 4–5 weeks was provided for the availability of this functionality.\n    d. We also clarified that once the draft capability is back ported, Accenture will need to rewrite their customization for PostgreSQL accordingly.\n    e. Accenture highlighted the need for draft functionality in their multi-signer process, as they update the owner information when the second signer logs in. We confirmed that similar functionality will be achievable with the new implementation.\n2. *Custom Submission:*\n    a. Accenture inquired whether request header information can be accessed in custom submission service, as their backend logic depends on it.\n    b. We confirmed this needs to be checked, and if not feasible, Accenture may proceed to implement a custom servlet for submission.\n3. *Core Component JSON to XML Conversion:*\n    a. Accenture asked if there is any OOTB (Out-of-the-Box) utility available to convert Core Component JSON data to XML, as their current services are designed to consume XML and if not present, then they would need to implement their own custom converter.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:12.763Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745595895.634119"
  },
  {
    "id": "ca7aebd9-8cce-4cfb-b785-50591cad82f0",
    "source": "slack",
    "text": "*\n• *PDF Import Demonstration: W*e demonstrated the process of importing a PDF(customer legacy form) into the designer, highlighting the options available and that can produce the XDP. we also explained how it can address text overlapping issue. It should reduce their manual work to 80-90%.\n• *Manual Adjustments -* some manual adjustments will still be necessary, such as missing images during import.\n• We discussed the success criteria and key performance indicators (KPIs), with the customer agreeing to provide performance and form migration metrics.\n• We also reviewed the priority order of the identified tasks.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:11.255Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745635974.062459"
  },
  {
    "id": "b90b47e3-f0c2-4682-8fdf-d0de0cd442a3",
    "source": "slack",
    "text": "*\n• We demoed IC to 4point - Eric and Dave. \n• They greatly appreciated it. \n• They want it to work to import/export XDPs for existing customers using Output Service and would like to continue using it.\n• They will now use it and share their feedback.\n• They have 2 prospects who were shown IC on 6.5 and would be further interested to use IC on cloud.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:09.748Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745935569.585889"
  },
  {
    "id": "3848a2d5-396c-4ba2-9546-54cbffeb9820",
    "source": "slack",
    "text": "*\n*Meeting Summary*\nWe had a productive discussion regarding the issues NFCU is facing and their use cases. Below are the key discussion points:\n1. *Data Binding Workflow:*\n    ◦ Provided a detailed explanation of the data binding workflow and scenarios for using the data reference option.\n    ◦ Discussed the functionality of @notation and drag-and-drop features in detail.\n    ◦ Identified the need for improved UX to show different data binding options for text boxes and other dynamic fields.\n2. *PDF Preview Issues:*\n    ◦ NFCU reported issues with PDF previews in specific scenarios involving documents with multiple fragments and fields.\n    ◦ Noted the lack of access to NFCU's dev2 environment, which is necessary to resolve the issue.\n    ◦ Requested templates and fragments to investigate the issue further as well.\n3. *Rich Text Editor Misalignment:*\n    ◦ NFCU is experiencing misalignment of text contents, particularly data bindings, when editing using the edit workflow (save the document, go to forms manager, select edit option).\n4. *Conditional New Line in Text Box:*\n    ◦ NFCU has a use case requiring the avoidance of new lines if certain data is not present.\n    ◦ Example scenario: In a text box containing @userfirstname, @usermiddlename, and @userlastname, if @usermiddlename is not present, the generated PDF should not include a new line between @userfirstname and @userlastname.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:08.238Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1745993504.479779"
  },
  {
    "id": "61d8c9a0-c04b-4ea6-8550-e459a4a33d3e",
    "source": "slack",
    "text": "*\n• Customer discuss about mandatory and option forms.\n• The customer mentioned that, in addition to generating an XDP from the legacy PDF, they also need to create an Adaptive Form.\n•  They mentioned that that binding needs to be performed twice— once in the XDP and again in the Adaptive Form.\n•  Due to certain legal requirements regarding the format of the generated PDFs, they are using XDP to ensure compliance.\n• Publishing Issues: They reported intermittent issues with form publishing, where the updated version doesn’t always reflect on the publish instance, requiring manual unpublish and republish actions. I requested them to share a specific form where this happened; they will provide it when the issue occurs again.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:06.729Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746420576.656299"
  },
  {
    "id": "a05c93f6-4641-452f-931d-490c1211c658",
    "source": "slack",
    "text": "*\nDiscussed mostly around submissions and capabilities available in core component based forms.\nThere are a few queries, and ask for support for additional capabilities.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:05.222Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746424327.367189"
  },
  {
    "id": "77f0d200-c028-4abc-8b93-4975a6c1c407",
    "source": "slack",
    "text": "*\n• 4Point is the implementation partner for the net new customer 4Point. \n• It is first customer for 4Point on Cloud servicer and OSGI side as well. \n• The customer’s use case is data capture using AFs followed by review and approval process and subsequent likely DoR generation.\n• They had general questions around how things work in Forms Cloud Service and the OSGI world, how environments work, etc. \n:todo_done: *",
    "created_at": "2026-01-30T06:27:03.713Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746507668.048259"
  },
  {
    "id": "a8542d59-bc1d-43d7-bc2e-3188075d5761",
    "source": "slack",
    "text": "*\n• The customer was provided with a demo showcasing IC Cloud Editor and its capabilities in comparison to the existing on-premises editors.\n• The customer expressed positive feedback regarding the enhanced user experience and streamlined functionality offered by the cloud editor.\n• The customer requested information regarding the migration strategy for their portfolio of 500-600 letters to the cloud platform. The team provided an overview of the VIP engagement program to facilitate this transition.\n• The customer was asked to explore the new editor and share honest feedback with the team for improvements.\n:todo_done: *",
    "created_at": "2026-01-30T06:27:02.205Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746508900.112879"
  },
  {
    "id": "a3ce7cfe-877b-4ec0-af9b-1772be13996a",
    "source": "slack",
    "text": "*\nSummary of Discussion with NFCU -\nWe had a discussion regarding the challenges NFCU is facing and their specific use cases. Below are the key points discussed:\n1. *PDF Preview Issues*:\n    ◦ NFCU reported issues with PDF previews in scenarios involving documents with multiple fragments and fields.\n    ◦ NFCU will provide access to the dev2 environment, which is necessary to resolve this issue.\n2. *Conditional New Line in Text Box*:\n    ◦ NFCU has a use case requiring the avoidance of new lines if certain data is not present.\n    ◦ Example scenario: In a text box containing @userfirstname, @usermiddlename, and @userlastname, if @usermiddlename is not present, the generated PDF should not include a new line between @userfirstname and @userlastname.\n    ◦ NFCU will provide an existing XDP to better demonstrate this use case.\n3. *FDM-Related Queries for NFCU*:\n    ◦ Storage Data Source: We sought information about the storage data source.\n    ◦ API Details: We inquired about the availability of a Swagger endpoint or file for their REST API. As per current information, they will be using the REST API.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:27:00.697Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746543262.415969"
  },
  {
    "id": "e2553643-c11c-4132-b2ab-e65028e97763",
    "source": "slack",
    "text": "*\nTom Sonntag (TAM) reached out: FirstBank team reached out to me to continue working towards their migration of Forms to CC.\n\nI have requested details on number of forms, and if possible the URLs of these forms. This could be a good opportunity to leverage the migration utility to ease the migration. Tom is checking with the customer and will be sharing the updates soon.\n\nThis is from internal slack discussion - no meeting scheduled yet.\ncc: <@U03BKR6K3R8>\n:todo_done: *",
    "created_at": "2026-01-30T06:26:59.187Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746604170.340579"
  },
  {
    "id": "8403f13e-f013-407f-a351-569793d9d9f2",
    "source": "slack",
    "text": "*\nCharles Shwab is an old AEM Forms customer (originally LiveCycle customer -&gt; moved to OSGi). They are using XDP Forms and want to migrate to HTML5 Forms.\n• They are on-prem - 6.5.22\n• 800-900 forms\n• Font issue - is currently a blocker: <https://aemcs-workspace.adobe.com/bot/conversation/fd1a2149-f976-41e0-b135-8bbba0ebc139|E-001631249>\n• *HTML Extension for Caching:* Sudhanshu, Devendra, and Abhishek Kolluru discussed the recent change to cache HTML (.html extension is not coming on 6.5 and was added recently on 6.5) on the cloud service and the possibility of backporting this enhancement. Abhishek emphasized the importance of this feature for their large number of forms and server capacity. <@W6CBB4953> they mentioned about caching implemented and then removed (from last meeting discussion) - due to some issues on mobile - could you provide more details.\n• *Embedding HTML Forms:* Devendra demonstrated how to embed HTML forms in external sites using an iframe and dispatcher settings. Sudhanshu clarified that this method can be applied to any external site.\n• *Static vs Dynamic HTML Forms:* Abhishek Kolluru and Sudhanshu discussed the caching of static HTML forms and the challenges with dynamic forms. Abhishek highlighted the importance of not caching forms with query parameters and the need for static forms to be cached.\n• *Font Issue on Mac:* Abhishek Kolluru raised a font issue with HTML5 forms on Mac, which works fine on Windows. Devendra suggested creating a custom CSS profile to address the issue. Sudhanshu requested the support ticket ID to review and confirm the issue.\n• *JSON Payload for Prefilled Forms:* Abhishek Kolluru explained their process of using JSON payloads to prefill forms and the challenges faced with CSS and JS references in the HTML forms (_currently relative path - need absolute path_). Sudhanshu noted the need to identify and document the steps to address this issue.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:57.679Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746695260.441729"
  },
  {
    "id": "b8048882-b841-4a40-ae92-2e7892119161",
    "source": "slack",
    "text": "*\nPrep meeting with Busch Group and eggs Unimedia to discuss the agenda for the demo scheduled on 13th May.\n\nPrimary customer concern is around simplification of templates.  They have 185 templates in all and they operate in many countries. Adapting a template to a small change in one region affects elsewhere.\n\nReusable fragments and multi-language localization are definite areas of interest. Can also use the occasion to showcase the new Composer.\n\nAttendees from customer side will be mostly IT, the commercial aspect will be followed up later.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:56.171Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746715636.940739"
  },
  {
    "id": "2c1881df-f87c-43ef-b08a-bda4485ad5e3",
    "source": "slack",
    "text": "*\n*NFCU*: Sharmila, Sreedhar, Aishwarya\nCurrent Communication Journey (DSC) that is live is a failover letter generation capability where a scheduled batch is run twice a day which picks up the failed entries one by one and generated PDF.\n\nMany other departments are interested in Forms Communication and one department (Standardization team) is very much focused on Quadient tool and Sharmila and team might need our help in demoing our product to that team if required. (Post May end, when we deliver MVP committed features)\n\nSharmila mentioned about New usecase, where they want to create a 4 fields of independent AF (Credit Card disclosure Form - unauthenticated form)\n• last 4 Credit card number\n• Re-enter\n• Access No\n• Confirm\n• Submit -&gt; Call Muelsoft API - Pega Platform\nTheir Program is internal where the URL is whitelisted only within NFCU, but for this form they want a Public URL.\nThey wanted to understand any Risk for this usecase.\nMentioned that its very straight forward usecase and we can have a POC to fizzle out any concerns and NFCU should check with their Security team on how to allow an internal specific URL publicly.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:54.663Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1746717036.454589"
  },
  {
    "id": "7f13292f-1483-4a0d-b4db-5d04d2cd680d",
    "source": "slack",
    "text": "*\nSummary of Discussion with NFCU\nWe had a brief discussion with NFCU regarding the challenges they are currently facing and their specific use cases. The key points from the conversation are outlined below:\n1. *PDF Preview Issues*\n    ◦ NFCU has yet to provide access to their DEV2 environment, which is essential for further investigation and resolution of the issue.\n    ◦ Alternatively, they may share the relevant XDP file via a support ticket to facilitate further analysis.\n2. *Conditional New Line in Text Box*\n    ◦ NFCU will share an existing XDP file via a support ticket to better illustrate this use case.\n3. *Template as Reference Support*\n    ◦ NFCU is currently exploring the use of fragments on their end to determine if it addresses their requirements.\n    ◦ We noted that using templates as references may not fully resolve their use case, as users would still need to review all referenced documents individually to verify layout consistency.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:53.154Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747148174.123909"
  },
  {
    "id": "d853bc5a-cf1f-44e3-abad-b147ed28afa8",
    "source": "slack",
    "text": "*\nProposal meeting to Busch Group in response to their RfP for Communications.\n\nThe meeting kicked off with Nick Maerlender setting the context and briefly introducing the Adobe team. He then handed over to Dominik Emmert who presented the overall AEM and Forms story + capabilities.\n\nThis was followed by 6 mini-demos from <@W4R5WN6LR> primarily showcasing template authoring via Desktop Designer, each with a particular theme (fragments, localization via data/scripting etc.) mapping to their requirements and (inferred) pain-points shared earlier. After partly presenting the 7th demo, handed over to <@WE163TH43> who focused on the authoring experience in Cloud Designer by demo'ing live the creation of a Communication template and document with fragments. <@W010NNJV7S8> then wrapped up the Adobe side of things by sharing the roadmap and exciting things ahead for Forms and Communications.\n\nAt this point, approximately 10 minutes remained out of the 90 allotted for the meeting, when Martin Grimm from eggs Unimedia began explaining their development strategy as a 15+ yr. old Adobe partner experience, primarily in AEM Forms since the LiveCycle days. There were pointed questions about integration with SAP, to which both Martin and <@W9QMZFR39> replied.\n\nWe then ran out of time and the Busch attendees could not extend so it was agreed that Nick would connect again with them by the end of this week to discuss commericals and gather consolidated feedback.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:51.645Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747149273.555789"
  },
  {
    "id": "d07b4ad5-8dde-40b8-8256-a6cdc37c7f01",
    "source": "slack",
    "text": "*\nFolks for ACS team also attended this meet.\n\n- The customer was provided with a demo showcasing IC Cloud Editor and its capabilities in comparison to the existing on-premises editors.\n- The customer expressed positive feedback regarding the enhanced user experience and streamlined functionality offered by the cloud editor.\n- The customer requested information regarding the following:\n\t- Support for FDM/JSON data - Team informed that it is in development and will be available soon.\n\t- Availability of Agent UI on cloud - Team informed that it is planned for next phases.\n\t- Migration of (100s of) on-premise 6.5 ICs - Team informed about the VIP engagement to facilitate the migration.\n\t- Availability of PDF generation APIs corresponding to IC - Team provided a brief overview of the render API.\n\t- Nested fragments use-case - Initial analysis of the collateral revealed that nested fragments (Document Fragments inside Layout Fragments) were created due to lack of FDM support in designer and layout support in IC Editor. This requires further evaluation from both teams.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:50.137Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747375576.560709"
  },
  {
    "id": "781b8165-f1af-499d-8da4-8e3cd290ae3c",
    "source": "slack",
    "text": "*\n*Meeting notes* _(AI generated - updated for corrections/details)_\n_Attendees included folks from IRS (None from Accenture)_\n• Ande Vara Prasada Rao\n• Gower Andrew R\n*Details:*\n• *Adaptive Form Conversion Tool Demonstration:* Shivam demonstrated the adaptive form conversion tool, explaining the process of converting forms, selecting directories, and scheduling jobs. They highlighted performance issues and showed a pre-converted form.\n    ◦ *Custom Components and Conversion Limitations:* ~Shivam and Sudhanshu discussed the challenges with custom components created by IRS, which the utility cannot convert due to lack of information~. Sudhanshu mentioned that the utility is available on GitHub and can be extended to include custom component transformations.\n    ◦ *Open Source Utility and Compatibility:* Sudhanshu and Ande clarified that the utility is open source, supports on-premises installations, and requires minor changes in build steps for different setups _(we shared steps to run the utility on a 6.5 setup)._\n    ◦ *Schema Conversion and Binding:* Shivam explained the need to convert XML schemas to JSON schemas for AF2, and how the utility handles binding automatically. Ande inquired about automation tools for schema conversion (_we clarifies that there is no OOTB tool/API to convert XML Schema to JSON Schema - but there are multiple tools in public domains - and it would require verification of the generated output_).\n    ◦ *Fragment Conversion and Custom Libraries:* Shivam highlighted the need to manually convert fragments and update references. ~They also mentioned issues with custom libraries and functions not supported in AF2.~\n    ◦ *Visual Rule Editor and Business Rules:* Sudhanshu discussed the need to redefine business rules in AF2, emphasizing improvements in the visual rule editor for easier rule definition _(clarified that the rules need to be re-defined after conversion)._\n    ◦ _*Feedback -* Vara (IRS) appreciated the tool, and found it quite useful. He mentioned that it would save a lot of effort during migration._\n• *Performance Comparison (FF vs CC):* Ande requested a performance comparison before and after conversion. Shivam showed that the performance more than doubled after conversion (_Lighthouse score doubled - from ~ 36 to 75. Low score due to large number of fields in the form)._\n    ◦ *Form Conversion Process:* Shivam demonstrated the form conversion process again, explaining how to select source and target folders, and schedule jobs. Ande asked about converting multiple forms at once (_which is supported_)\n        ▪︎ *Error Logs and Custom Logs:* Shivam and Sudhanshu discussed error logs and the possibility of configuring custom logs for better tracking of conversion issues.\n• *Local Conversion vs. Cloud API:* Ande and Sudhanshu compared the local conversion tool with the cloud-based *Afcs*, highlighting the differences in processing and security.\n    ◦ *Adobe Support for Conversion Tool:* Ande confirmed that Adobe supports the conversion tool and can provide assistance with any issues during the conversion process.\n        ▪︎ Clarified that the tools are for different purpose\n        ▪︎ Concern - Migration tool does not support taking Template/Theme during conversion - as AFCS does\n        ▪︎ Clarified that the migration tool is supported - and Adobe would help investigate/resolve any issue they report with the tool.\n• *Save Draft Functionality:* Ande raised concerns about the lack of save draft functionality in core components, which is critical for IRS use cases. Sudhanshu acknowledged the issue and shared that he would discuss internally and share an update in the next call.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:48.626Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747794719.921269"
  },
  {
    "id": "f9789e0a-e57d-40d2-8298-bd18a6110d63",
    "source": "slack",
    "text": "*\nGenerated by AI.\n*IRS attendees* (_there were more attendees from IRS - but active participants were_):\n• JP Terry\n• Ande Vara Prasada Rao\n• Gower Andrew R\n*Meeting notes:*\n• *Automated Forms Conversion Service Demo:*\n    ◦ *Automated Forms Conversion Service Configuration:* Gaurav demonstrated the configuration of the automated forms conversion service on a local setup, including adding developers, creating projects, and configuring the service on the AM instance.\n        ▪︎ *Service Configuration:* Gaurav explained that when the Automated Forms Conversion (AFC) service is provisioned for an organization, an administrator is assigned to add developers responsible for configuring the service on the AM instance. The administrator uses the admin console to add developers to the product profile.\n        ▪︎ *Developer Console:* After being added, developers need to create a project in the developer console, add an API, and configure server-to-server authentication. Gaurav demonstrated creating a new project and selecting the automated forms conversion API.\n        ▪︎ *Client ID and Secret:* Gaurav showed that after configuring the API, developers receive a client ID, client secret, scopes, and organization ID. These details are used to configure the AM local server by going to the security settings and Adobe IMS configurations.\n        ▪︎ *Health Check:* Gaurav performed a health check to ensure the configuration was correct, confirming successful token retrieval and authentication for the automated forms conversion service.\n    ◦ *Cloud Configuration for Automated Forms Conversion:* Gaurav explained the process of creating a cloud configuration for the automated forms conversion service, including selecting templates and themes for the converted forms.\n        ▪︎ *Cloud Services:* Gaurav navigated to the cloud services section to create a cloud configuration for the automated forms conversion service. He demonstrated selecting a contribution folder and naming the configuration.\n        ▪︎ *Endpoint and Template:* Gaurav explained that the endpoint for accessing the service and the template type (foundation-based or core component-based) are selected during the configuration. He showed how to choose a template and a theme for the converted form.\n        ▪︎ *Configuration Example:* Gaurav provided examples of configurations for both V2 (core component-based) and foundation-based templates, showing the IMS and cloud configurations already set up.\n    ◦ *Conversion of PDF to Adaptive Forms:* Gaurav showed how to upload a PDF and start the automated conversion process, resulting in an adaptive form with the same fields and structure as the original PDF.\n        ▪︎ *PDF Upload:* Gaurav demonstrated uploading a PDF document with fields such as date, reason, total amount, and text areas. He explained that the document is uploaded to the AM instance.\n        ▪︎ *Start Conversion:* Gaurav showed how to select the uploaded PDF, choose the desired configuration (V1 or V2), and start the automated conversion process. The configurations are prefilled with the selected template and theme, but can be overridden if needed.\n        ▪︎ *Conversion Process:* Gaurav explained that the conversion process involves sending a request to the AI/ML service, which processes the images and creates an adaptive form. He showed the converted output, highlighting that the fields and structure matched the original PDF.\n        ▪︎ *Foundation and Core Components:* Gaurav demonstrated the converted outputs for both foundation-based and core component-based forms, showing that the fields were correctly identified and configured in the adaptive forms.\n    ◦ *AI and Machine Learning in Forms Conversion:* Ande and Gaurav discussed the role of AI and machine learning in identifying widgets and fields in the PDF during the conversion process.\n        ▪︎ *AI Role:* Gaurav explained that AI helps identify widgets and fields in the PDF, such as captions and input fields, by analyzing the structure of the form. The AI models group related captions and fields to create adaptive form fields.\n        ▪︎ *Field Grouping:* Gaurav provided an example where the AI grouped a caption and input field to create a field for capturing the insured name. He also explained how sections and panels are identified and extracted from the PDF.\n        ▪︎ *Vision Models:* Gaurav mentioned that vision models and machine learning models are used to identify the structure, fields, sections, and captions in the PDF, enabling the creation of adaptive forms from straightforward PDF screenshots.\n    ◦ *Issues with Core Component Template:* Terry raised an issue with the core component template failing to convert forms, and Gaurav suggested providing the latest build and enabling a feature toggle to resolve the issue.\n        ▪︎ *Issue Raised:* Terry reported that while the foundation component template worked fine, the core component template failed to convert forms, displaying an error message suggesting retrying the conversion or contacting Adobe support.\n        ▪︎ *Latest Build:* Gaurav acknowledged the issue and suggested that the latest build and enabling a feature toggle could resolve the problem. He mentioned that the core component form conversion support was recently added.\n        ▪︎ *Configuration Steps:* Terry asked if any additional steps were needed on the server. Gaurav confirmed that once the latest code and feature toggle are enabled, creating a new configuration with the core component template should work.\n        ▪︎ *Service Pack:* Terry inquired about the required service pack version. Gaurav promised to confirm whether a new service pack or the existing one (6.5.22 or 6.5.23) would suffice and share the necessary details.\n    ◦ *Custom Components and Meta Model:* Gaurav explained how to use the meta model to map custom components to specific fields during the forms conversion process.\n        ▪︎ *Meta Model:* Gaurav introduced the concept of the meta model, which allows extending out-of-the-box configurations by mapping custom components to specific fields identified in the PDF during the conversion process.\n        ▪︎ *Custom Component Mapping:* Gaurav demonstrated how to map a custom component, such as an SSN field, by providing a mapping in a JSON file. This mapping ensures that the custom component is used instead of the default component during conversion.\n        ▪︎ *Configuration Path:* Gaurav showed that the custom meta model can be uploaded to the AM instance, and the path to the JSON file can be specified in the cloud configuration to apply the custom mappings during conversion.\n        ▪︎ *Form Level Validations:* Ande asked about including form-level validations in the meta model. Gaurav confirmed that properties such as required fields, default values, and validation rules can be added to the JSON file and applied during conversion.\n    ◦ *Security Concerns with Cloud-Based Conversion:* Ande asked about security concerns with cloud-based conversion, and Anurag assured that the communication is secure and within the IRS authenticated context.\n    ◦ *Popularity of Automated Forms Conversion Service:* Ande inquired about the popularity of the service, and Anurag confirmed that several customers have been using it since its release in 2017-2018.\n• *Generative AI Demo:* Gaurav demonstrated the capabilities of the Form Experience Builder, a conversational assistant that helps in authoring and creating form experiences using generative AI.\n    ◦ *Form Creation:* Gaurav demonstrated the Form Experience Builder, which uses generative AI to create forms based on user-provided intents. He showed how to enter an intent, select a template and theme, and create a form.\n    ◦ *Assistant Interface:* Gaurav explained the assistant interface, which provides commands for creating and updating forms. He demonstrated adding a panel, updating the layout, and creating business logic using the assistant.\n    ◦ *Rule Creation:* Gaurav showed how to create a rule for setting an email address based on the first and last names. The assistant generated the rule, and Gaurav confirmed its functionality in the preview mode.\n• *Cloud Sandbox for Generative AI:* Arun suggested setting up a cloud sandbox for the IRS team to use the generative AI technology for creating forms, as it is currently only available in the cloud version.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:47.115Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747795668.100629"
  },
  {
    "id": "25dac51f-2b10-4040-8780-c9932b24e239",
    "source": "slack",
    "text": "*\n• Presented two major use cases for form pre-filling(from user entered data and from incoming persisted Json) and the current approach involving manual conversion and data binding, highlighting scalability issues. We got confirmation from the customer about pain points and workflow.\n• They discussed the challenges of converting forms from Word documents to AEM forms, emphasizing the time-consuming nature of the process. They also mentioned that incoming Form can be in word format also.\n• Demonstrated AFCS with its current capabilities and how these can be leveraged to address certain use cases in the existing implementation. Specifically, we showcased the flow: Acroform PDF → AF → Auto DoR.\n• Demonstrated the Forms Experience Builder, showcasing its ability to create and modify forms using natural language input and images.\n• We also demonstrated a PoC where Forms Experience Builder analyzes AFCS-converted Adaptive Forms for quality issues, aiming to enhance the accuracy of automated conversions. This is in Dev and we are working on it for improving its quality.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:45.606Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747890714.682129"
  },
  {
    "id": "7ddc5159-c5cf-48ff-ba06-1738498816b3",
    "source": "slack",
    "text": "*\n• NFCU talked about expanding the adoption of IC Editor internally, subject to maturity of the product.\n• They have 2 projects coming up spanning across other departments in NFCU in the next quarter, that would start in mid June\n• The major requirement of the 1st project data binding from APIs\n• The requirements for the 2nd project is still being figured out, but based on the rudimentary details they currently have, it seems to make a good fit for Associate UI\n:todo_done: *",
    "created_at": "2026-01-30T06:26:44.099Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1747926414.351989"
  },
  {
    "id": "8d95a672-db71-490b-b894-84108b599a95",
    "source": "slack",
    "text": "*\n*Discussion Summary*\nWe had a brief discussion covering the following key issues:\n• *PDF Preview Issue:* NFCU will provide access to their DEV2 environment to support further investigation and resolution.\n• *Non-IC Issue:* Themes are not loading correctly in the App Framework (AF) across consecutive updates. We have advised logging a support ticket to address this behavior.\n• *Release Update:* NFCU has requested a status update once the release is completed at the end of May.\ncc: <@WQWCBV6NN> <@W4R5LUPK3> <@W9QMZFR39>\n:todo_done: *",
    "created_at": "2026-01-30T06:26:42.592Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748358042.108359"
  },
  {
    "id": "695e934e-10da-4ed7-9b98-c1ccdd82c37b",
    "source": "slack",
    "text": "*\n*Issues they reported:*\n    ◦ In order for this to work I need to add Access-Control-Allow-Origin header to <https://main--forms--ociostateofnebraska.aem.live/> which is fine, and I am able to do this. However, it seems that once the header is present on this domain the Universal Editor stops working. The paths it tries to pull block scripts from are all adjusted/broken. I can show this on the call today.\n        ▪︎ _Resolved in the meeting._\n    ◦ This form sends an email. The email template editor is a rich text editor, and the email is plain text, so the raw html is in the email body. When trying to use the external template field to point to a template I put in the DAM, it does not work, and I get an empty email body.\n        ▪︎ _Resolved within 30 mins of the meeting_ - luckily we had the feature for CC in EA - and Ravi helped enable on their EDS environment by updating their dialog quickly - <https://github.com/OCIOStateOfNebraska/stateofnebraska-aem/pull/84>\n    ◦ If we have time, I’d like to discuss the “persist to spreadsheet” form action to see if it is viable for a new requirement.\n        ▪︎ They wanted to submit form to a excel in different Org which is not supported - <@W4R5Y3YHX> please correct me if I got this wrong :sweat_smile:\n        ▪︎ They decided not to try to do excel at launch. But we are clear on how if and when they choose to do it _*(got this latest update from Jeff today)*_\n    ◦ _*Open item:*_ They have GoogleReCaptcha v2 license and EDS supports v3 - customer thought they needed a Google enterprise account to use v3  _*(got this latest update from Jeff today)*_ - I don't they that is the case - <@U0213T59LMN> are you aware?\n<@W012PACNGHJ> <@U02P8T2L0R5> <@W4R5Y3YHX> please share/update in case I missed something.\n\nPS: The customer dev was really happy with the meeting - and especially appreciated the fact that we resolved 2 of the issues within the meeting.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:41.083Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748458168.953069"
  },
  {
    "id": "76a17fbb-1def-4c03-819c-3ce5d4ff70d4",
    "source": "slack",
    "text": "*\nProvided a demonstration of the fixes implemented in SP23 within AEM Designer. The issues addressed during the session included:\n<https://jira.corp.adobe.com/browse/LC-3921997>\n<https://jira.corp.adobe.com/browse/LC-3922619>\n<https://jira.corp.adobe.com/browse/LC-3922633>\n\nWells Fargo is looking forward to the availability of the SP23 release.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:39.575Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748528852.502609"
  },
  {
    "id": "3f30c8a5-dc54-40e3-844c-c41e7db46315",
    "source": "slack",
    "text": "*\nMOM of today's call with GM\n• The 403 issue for the forms is resolved , it was related to allowing the edge domain in the referrer filters of publish. Now submission is getting processed to aem publish.\n• There is an issue in their author instance where the Universal Editor content tree is not listing down the components inside AdaptiveForm Container and hence they are not able to edit anything. I checked the logs and initially there was an NPE because of component-models file was incorrect. I got that resolved. Now that NPE is gone but still content tree is not rendering. We need to resolve this on priority. \ncc:- <@W012PACNGHJ>, <@U01G51VDXB8>, <@U0213T59LMN>, <@W4RSW3ECC>\n:todo_done: *",
    "created_at": "2026-01-30T06:26:38.068Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748534490.934949"
  },
  {
    "id": "6b6877e5-2503-4c11-bc15-13dff3685c20",
    "source": "slack",
    "text": "*\n• NFCU had a requirement where a 4 field form needs to submit to a Mulesoft API. During the call they shared that the requirement is that API is authenticated. <@U03Q109GQMT> quickly demonstrated the form and also showcased the API integration tool which can be used as Invoke Service. This feature has been enabled on their dev2 environment and they would be testing it. Sharmila (NFCU) emphasised the criticality and wants to take live this form by mid june.\n• NFCU also shared requirement of converting PDF to HTML and it would be used in multiple sites. They want to ensure that user has scrolled to bottom of all the Terms and Conditions then provide consent and Submit the Form. We showcased PDF link and PDF viewer component but they want HTML version of PDF only. We mentioned that future of IC where both Print and Web channel are available would be helpful, but currently that have lots of PDFs which they want to show as HTML in AF.\n• Also they have requirement to print empty AF\n• Another requirement is to have unmapped data to be part of Submit. Hidden fields is not an option due to security concerns. This feature is already being worked upon for HDFC and will enable for NFCU as well.\n• Good news Sharmila shared that Admin Services department handling logistics and having 3000 Letters who were inclined towards Quadient have now been convinced with AEM Forms, based on future of IC and their current custom fragment implementation.\n• Highlighted to NFCU team, there is a delay in IC due to Architecture level changes, and ETA we are targeting is 12th June.\nKudos to <@U03Q109GQMT> for quickly preparing the demo and showcasing Authoring of various Rules/Validation. This provided confidence to NFCU team that we are equally invested in their go live.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:36.562Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748540270.904549"
  },
  {
    "id": "f2ac4a61-f3e2-415d-9265-f898661d54cf",
    "source": "slack",
    "text": "*\n*Forms Conversion Challenges:* Naveen (LPL) discussed the challenges faced in converting forms into the AEM side, mentioning that previous attempts either failed or did not meet the standard. They sought assistance from the team to resolve these issues. Also enabling Adobe AI capabilities, specifically for editing adaptive forms.\n*Forms Conversion Demonstration:* <@W4R4VBWQG> demonstrated the conversion of forms from afcs to adaptive form v2, showing the workflow and the output PDF generated with filled information. They addressed issues with headers and repeated fields.\n\n*Forms Conversion Milestones:* We offered a VIP offering to them and asked for their commitment , go LIVE dates , internal milestones , success criteria and number of go LIVE forms.\n\n*JSON Structure Support:* Naveen Sharma requested support for JSON structure in form binding, as it would save time and increase API performance. They discussed the challenges faced in converting forms and how Gen AI could help overcome them.\n\n*Implementation Partner:* Naveen Sharma mentioned that their implementation partner, Proficient, was helping with migrating user forms into AM forms. They discussed the timeline for going live with the forms(700-800forms), targeting July-August.\n\n*Optimised Web Forms:* We discussed the possibility of optimising web forms by converting textual data into terms and conditions. They considered the business requirements and user experience on the web.\n.\n*Forms Sharing Process:* Naveen Sharma asked about the best way to share a large number of PDFs for conversion. We suggested using a sandbox environment or sharing through email or Slack or Teams, and creating categories for forms to target.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:35.054Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748586355.857299"
  },
  {
    "id": "002b099a-a4df-477d-b429-96d49724ba00",
    "source": "slack",
    "text": "*\n*Questions for IRS/AF meeting*\n1. Are they using same UI for listing both AF1 and AF2 forms? *Yes (Not applicable as they are not using lister component)*\n2. Are they using draft and submission lister for submissions also? *Do not use this component - No use-case now..*\n3. If same UI, then recommendation is to use Listing (V1) else Listing (V2) would require styling changes  - *Not applicable*\n4. Local SDK testing for customisations (which we can provide by Monday) - *Need to share Local SDK with Accenture. Accenture to share the customization code,*\n5. \n    a. Postgress storage ( can we get the impl code, to assit you better for converter implementation)\n    b. Large Attachment support ( Custom Core component)\n    c. Multi - Signer\n6. Any other customisations that have done for Save As Draft/ Listing? - *Yes - they are using a custom component.*\n7. HF on SP22 or SP23? They are on SP21 - *No plans for 23 right now.. Accenture would confirm. - Will not have clarity by Tuesday - will need more time. Currently they are on SP21*\n:todo_done: *",
    "created_at": "2026-01-30T06:26:33.546Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748614555.198939"
  },
  {
    "id": "9c87cc30-efa1-48e9-9445-3217f762a66f",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Adaptive Forms Creation:* Ellen explained the process of creating adaptive forms, highlighting the need to support multiple languages and brands for KBC websites. They discussed the challenges faced due to the differences in content and the advantages of using core components for translation and embedding within the KBC mobile app.\n    ◦ *Adaptive Forms Process:* Ellen described the process of creating adaptive forms, which involves using the usual method of going into forms and documents to create sites. These forms are used across KBC brands and websites, supporting four languages: Dutch, French, English, and German.\n    ◦ *Language and Brand Support:* Ellen highlighted the need to support multiple brands and languages for KBC websites. KBC has three sub-brands: KBC for Dutch-speaking audiences, CBC for French-speaking audiences, and KBC Brussels. Each form shares functionality but may have slight content differences.\n    ◦ *Core Components Advantages:* Ellen explained the advantages of using core components, which include the ability to use translation features and embed forms within the KBC mobile app. This reduces the workload for authors, as translation partners handle translations, eliminating the need for manual input.\n• *Document of Record Requirement:* Ellen detailed the requirement for a document of record in adaptive forms, which is crucial for pre-filling data and processing it through the KBC workflow. They mentioned the current limitation of embedding adaptive forms within websites and the need to migrate forms from foundation components to core components.\n    ◦ *Document of Record:* Ellen explained that the document of record is essential for pre-filling data and processing it through the KBC workflow. This document is used for GDPR and legal purposes, ensuring records are maintained for submissions.\n    ◦ *Embedding Limitation:* Ellen mentioned the limitation of embedding adaptive forms within websites, which currently does not support the document of record functionality. This is a critical requirement for migrating forms from foundation components to core components.\n• *Custom Development for Document of Record:* Ellen and Tim discussed the custom development they implemented to add a document of record to the adaptive form container. They highlighted the need for this functionality to be included in the Adobe Root code to avoid future issues and reduce workload.\n    ◦ *Custom Development:* Ellen and Tim described the custom development added to the adaptive form container to include the document of record functionality. This development was necessary due to the missing feature in the current setup.\n    ◦ *Adobe Root Code:* They emphasised the need for this functionality to be included in the Adobe Root code to prevent future issues and reduce the workload for their team.\n• *Current Status and Future Needs:* Anurag and Tim clarified that the custom development for the document of record is not fully functional and needs to be more extensive. They discussed the need for both the document of record configuration and schema selection to be available out-of-the-box.\n    ◦ *Current Functionality:* Anurag and Tim clarified that the current custom development for the document of record is only partially functional and requires further development to meet their needs fully.\n    ◦ *Out-of-the-Box Needs:* They discussed the necessity for both the document of record configuration and schema selection to be available out-of-the-box to streamline their processes and avoid custom development.\n• *Form and Document of Record Specifics:* Sudhanshu and Ellen discussed the specifics of the document of record for different logins and locales. They explained the need to configure the document of record properties for each locale and the challenges faced due to the current inability to select it.\n    ◦ *Locale-Specific Configuration:* Sudhanshu and Ellen explained that the document of record needs to be configured for each locale, with properties specific to each language and brand variant.\n    ◦ *Current Challenges:* They highlighted the challenge of not being able to select the document of record at the moment, which is a significant issue for their workflow.\n• *Form Submission and Page Configuration:* Ellen and Anurag clarified that there is typically one form per page with one submit action. They discussed the potential confusion for end users if multiple forms were present on a single page and the preference for a single submit action.\n• *Timeline and Impact:* Ellen and Anurag discussed the timeline for implementing the required functionality, with Ellen mentioning the urgency due to ongoing projects. Anurag assured that they would provide an ETA by Friday after internal analysis and planning.\n    ◦ *Urgency of Implementation:* Ellen emphasised the urgency of implementing the required functionality due to ongoing projects and the need to maintain momentum in converting components to core components.\n    ◦ *ETA Assurance:* Anurag assured Ellen that they would provide an ETA by Friday after conducting internal analysis and planning to determine the feasibility and timeline for the required development.\n• *Future Plans and Conversion:* Ellen explained the goal of converting existing forms and building new ones using core components to reduce workload on KBC local offices. They mentioned the planned timeline for this conversion and the importance of providing the required functionality to meet their targets.\n    ◦ *Conversion Goals:* Ellen outlined the goal of converting existing forms to core components and building new ones using the same technology. This conversion aims to reduce the workload on KBC local offices by automating processes currently done manually.\n    ◦ *Planned Timeline:* Ellen mentioned the _*planned timeline for this conversion, aiming to complete it within one to two months. The urgency is driven by the need to meet targets and improve efficiency.*_\n• *Next Steps:* Anurag assured Ellen and Tim that they would conduct internal analysis and provide an ETA for the required functionality by Friday. _*They emphasised the importance of addressing the product gap and unblocking the team as soon as possible.*_\nFollow-up tasks:\n• *Document of Record Functionality:* Conduct internal POC and discussions to assess the effort required to implement the document of record functionality for adaptive forms. (Anurag)\n• *Timeline Assessment:* Check with the product owner to determine the feasible timeline for implementing the document of record functionality. (Ellen)\n:todo_done: *",
    "created_at": "2026-01-30T06:26:32.036Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748619979.759109"
  },
  {
    "id": "216d0f3a-8af6-4c71-8bb2-2001c8829a06",
    "source": "slack",
    "text": "*\n*Meeting notes:*\n• *Edge Delivery Services Training:* Daniel inquired about the team's understanding of Edge Delivery Services and whether there are any learning paths available. Tom confirmed that a preliminary coaching session has been conducted and a more advanced session is in the pipeline.\n    ◦ *Preliminary Coaching:* Tom confirmed that the team has already had one preliminary 101 coaching session on edge delivery services, which was not specific to forms.\n    ◦ *Advanced Session:* Tom mentioned that a more advanced session on edge delivery services is currently in the pipeline and will be conducted soon.\n• *Forms and Marketing Involvement:* Daniel discussed the involvement of the marketing team in form sessions, suggesting that they should be included in basic form sessions for landing pages. Glorianne agreed that forms might be more advanced for marketing, and it will be managed by their team.\n    ◦ *Marketing Inclusion:* Daniel suggested that the marketing team should be included in basic form sessions for landing pages, as they might need to add basic forms to landing pages.\n    ◦ *Advanced Forms:* Glorianne agreed that forms might be more advanced for the marketing team and stated that their team would manage the more advanced form sessions.\n• *Core Components Migration:* Sudhanshu questioned Felix and Fabian about the necessity of migrating to core components if their existing foundation forms are working fine. Felix and Fabian agreed that there is no pressing need to migrate unless there are critical errors.\n    ◦ *Migration Necessity:* Anurag asked if there was a pressing need to migrate to core components if the existing foundation forms were working fine. Felix and Fabian agreed that there was no immediate need to migrate unless there were critical errors.\n    ◦ *Support Tickets:* Anurag mentioned that if there were any support tickets raised, they could address those issues without needing to migrate to core components.\n    ◦ *Future Considerations:* Daniel added that while there was no current need to migrate, they should consider edge delivery services for new forms and pages.\n• *Financial Core Migration:* Daniel asked Felix about the migration of the financial core to cloud services. Felix confirmed that the migration has already happened, but they do not have Azure services like Azure storage or Azure SQL yet.\n    ◦ *Migration Status:* Felix confirmed that the financial core migration to cloud services has already been completed.\n    ◦ *Azure Services:* Felix mentioned that they do not yet have Azure services like Azure storage or Azure SQL, but there are plans to integrate these services in the coming months.\n• *Sensitive Data Automation:* Daniel proposed automating the process of capturing sensitive data from prospects using progressive forms and integrating with cloud services. Felix explained that they are looking into connecting foundation components to Azure storage or Salesforce.\n    ◦ *Current Process:* Daniel described the current process of capturing sensitive data from prospects, which involves generating an Excel file and manually calling each lead to capture additional data.\n    ◦ *Proposed Automation:* Daniel proposed using progressive forms with AEM forms to automate the data capture process and integrate with a system that can securely store sensitive data.\n    ◦ *Integration Plans:* Felix explained that they are exploring ways to connect foundation components to Azure storage or Salesforce to facilitate the automation and secure storage of sensitive data.\n• *Improving Site Performance:* Daniel emphasized the need to improve site performance and suggested using Edge Delivery Services for new sites. Felix proposed using a new landing page project to build and test Edge Delivery Services.\n    ◦ *Performance Emphasis:* Daniel stressed the importance of improving site performance and suggested that new sites should use Edge Delivery Services to achieve better performance ratings.\n    ◦ *Landing Page Project:* Felix proposed using a new landing page project with its own domain as a test case for building and implementing Edge Delivery Services.\n• *Migrating Drupal Site:* Daniel and Felix discussed migrating a new site from Drupal to Edge Delivery Services. Anurag suggested getting in touch with the AEM sites product management team for assistance.\n    ◦ *Migration Discussion:* Daniel and Felix discussed the plan to migrate a new site, \"Uno con El Ambiente,\" from Drupal to Edge Delivery Services: <https://www.unoconelambiente.com/>\n    ◦ *Product Management Assistance:* Anurag suggested contacting the AEM sites product management team, specifically Cedric Huesler or Gabriel, for assistance with the migration process.\n• *Creating Forms with Universal Editor:* Anurag demonstrated how to create forms using the Universal Editor in Edge Delivery Services, highlighting its ease of use and capabilities like generative AI for form creation.\n    ◦ *Universal Editor:* Anurag demonstrated the Universal Editor interface in Edge Delivery Services, showing how to create forms within a page using a simple drag-and-drop method.\n    ◦ *Generative AI:* Anurag highlighted the generative AI capabilities that allow users to create forms by expressing their intent in plain English, which the AI then translates into form fields and configurations.\n    ◦ *Form Creation:* Anurag showed how to add various components to the form, configure fields, and set up submission endpoints, emphasizing the ease of use and flexibility of the Universal Editor.\n• *GitHub Requirement for Edge Delivery:* Fabian inquired about the necessity of hosting code on GitHub for Edge Delivery Services. Sudhanshu confirmed that GitHub is required and will reconfirm if GitHub Enterprise is supported.\n    ◦ Relevant doc: <https://www.aem.live/docs/faq#:~:text=Does%20Edge%20Delivery%20Services%20support%20private%20GitHub%20repositories?,be%20installed%20on%20the%20repository>. <@W4RU4N66R> could you review and confirm. cc: <@W4R4S9FS4> \n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:30.526Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748620867.753629"
  },
  {
    "id": "03d0b4af-8c1e-40e2-9173-644bebd3ba39",
    "source": "slack",
    "text": "*\nCodePA raised an issue that below issues were critical and blocking development of some of their new forms:\n1. Scribble signature with DoR + Accessibility fixes\n2. Delete operation for files in SharePoint Doc\nThe team had been working on some of the additional features reported by them, and we tried to include the below features fixes - to get early feedback. The plan is to provide a buddy build to them to verify with localSDK - before creating a private build. We want to provide a private build - as waiting till July will impact development of new forms.\n\nCurrently we are targeting the below changes in the build (subject to build/validation next week):\n1. Scribble signature with DoR + Accessibility fixes (FPR)\n2. Date Time input component (FPR)\n3. Malicious file detection - server side mime-type detection (FPR)\n4. Option to exclude hidden fields from DoR (FPR)\n5. Excluding disabled fields from DoR (supporting rules to identify the disabled fields at runtime) (Bug)\n6. Enter key not working in multi-line TextInput field (Bug)\n7. Rules in nested repeatable panel  (FPR)\n8. Delete operation for files in SharePoint Doc (Story)\n:todo_done: *",
    "created_at": "2026-01-30T06:26:29.018Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1748622521.802589"
  },
  {
    "id": "63dfb432-51c2-4870-9299-699d142e1328",
    "source": "slack",
    "text": "*\nCS customer interested in following capabilities:\n1. Exp Builder\n2. Multi-modal\n3. Optimizer\n<@W4R4S9FS4> showcased Exp Builder and Multi-modal capabilities.\nThey mentioned CASE #E001266661 is troubling with preview. Product team to check.\n\n1. Bill enquired if Ex Builder can reuse fragments. We told it is in works.\n2. Bill enquired if adding the chat button/conversational interface is an authoring activity or dev work required. We explained it is targeted to be authoring component/config unless custom requirements from them for components, styling etc.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:27.482Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749102631.064399"
  },
  {
    "id": "25d5f834-e247-471d-b95a-49c430d07601",
    "source": "slack",
    "text": "*\nIn multiple meetings with NFCU, engineering, we provided option for their requirement of calling 2 Authenticated API and custom payload data.\n1. Invoke Service - API Integration with Variable and Dispatch envent\n2. FDM - Data Source integration with Authenticated Rest endpoint and pre-processor fucntion\nBut it seems NFCU went ahead with custom implementation, where in AF form submits to MuleSoft API and rest is taken care at their intermediatory layer.\nWe highlighted to NFCU that this requirement was possible through OOTB implementation and they would consider it for other Forms.\n\n<@U0213T59LMN> - Do we have an sample video showcasing FDM with Authenticated Rest endpoint + Pre-processor functionality? Couldnt find any public documentation related to FDM Pre-processor.\n\nPost 17th June, NFCU is looking for IC Editor implementation and we would need to update their Dev envs. Mentioned that currently its EA and we need to deliver it via private release, which later would be available publicly.\n\nAlso need to explore their requirement of showcasing PDF to HTML, there are 3 options\n1. Show as PDF link with consent checkbox ( demo showcased)\n2. Display PDF in the same tab ( Demo showcased with PDFViewer component, thanks to Sakshi. <@W4SG81T9C> Can you confirm if additional Doc Cloud license required for the same?)\n3. Convert PDF to HTML and show case in Form - <@W4RU4N66R> Anything done similar for HDFC?\n:todo_done: *",
    "created_at": "2026-01-30T06:26:25.973Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749186736.205649"
  },
  {
    "id": "b3f9e6e7-4468-4350-b3f1-4225a609af0b",
    "source": "slack",
    "text": "*\nGo Live Dates:\n17 June for one form\n5 July for another form\n\nThey had multiple issues, for which we delivered a private build.\nThey had additional queries, some of which were resolved, other are a few issues related to repeatability rules via rule editor.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:24.466Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749187159.174409"
  },
  {
    "id": "f414b07c-fc94-4e3d-8459-108d973a2f07",
    "source": "slack",
    "text": "*\n• *Sandbox Environment Access:* Mayank requested access to the sandbox environment for himself, Satya Deep, and Yash. Raciel agreed to provide access to the dev environment and asked for their email addresses.\n• *Form Migration Timeline:* Mayank inquired about the timeline for migrating 700 to 800 forms by July. Michelle confirmed that the timeline has not changed and the forms are currently in DocuSign and another internal system.\n• *Access to Forms:* Mayank asked if the forms are available in the dev environment. Michelle and Raciel clarified that only a sample of 30 to 50 forms is available, and the actual forms are in another tool.\n• *Form Conversion Process:* Mayank and Arneh discussed the process of converting forms into adaptive forms. Arneh mentioned the need to execute the pipeline before adding the forms to the environment.Andy informed Arneh that the pipeline would kick off in the next 15 to 20 minutes and take about 30 to 40 minutes to fully deploy. Arneh planned to do manual steps to enable components on the templates.\n• *Form Testing and QA Cycle:* Mayank asked about the next steps after converting a form into an adaptive form. Andy explained the QA cycle, which includes cleaning up the form, generating a PDF, and running end-to-end tests.\n• *Speed and Efficiency Concerns:* Michelle expressed concerns about the speed and efficiency of AEM in handling forms with many fields. She emphasised the need for a speedy editing cycle and the ability to quickly replace forms.Mayank suggested increasing the frequency of meetings to speed up the form conversion process. He proposed meeting more often to ensure the quality of converted forms and address any issues.\n• *Form Selection for Conversion:* Andy and Arneh discussed selecting a specific form from the box account for conversion. Andy randomly picked a form, and Arneh planned to convert it and share the results.Satya Deep proposed using the Teams channel for rapid communication and feedback on form conversion. Andy and Michelle agreed to try using the Teams channel for notifications and updates.Satya Deep and Raciel discussed the need for access to the box and SharePoint accounts to upload and download forms. Raciel planned to grant access to the team members.\n*Next Steps:* Mayank summarised the next steps, including increasing meeting frequency, using the Teams channel for communication, and ensuring access to box and SharePoint accounts. The team agreed to proceed with these plans.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:22.956Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749191283.815329"
  },
  {
    "id": "ede1be5e-04fb-4eed-9657-63027d6ee914",
    "source": "slack",
    "text": "*\n*Partner* - Ghost Dynamics\n\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Manu, Vijay Kumar, Pritam, and Deepti discussed the New Zealand Ministry of Social Development project, which aims to onboard professionals and provide employment search services to a significant portion of the New Zealand population. The project involves creating forms and sites for job listings and user profiles. \n• *Customer and Partner Involvement:* Manu confirmed that the customer has involved Ghost Dynamics as a partner for development, with PwC managing the project from a management point of view. The technical team from Ghost Dynamics will be directly interacting with the project team. \n• *Support Channels:* Manu mentioned that the team is interacting with the customer through Microsoft Teams, and there is no dedicated Slack channel created for support yet. \n• *Forms and Sites:* Manu and Pritam discussed the forms and sites being developed for the project. The initial phase involves creating a single form for job listings and user profiles, with potential for multiple forms in the future. \n• *Technical Issues:* Manu and Vijay Kumar reviewed several technical issues related to the forms, including repeatable panel validation, asset visibility, and rule editor problems. They discussed potential solutions and workarounds for these issues. \n• *Asset Sharing:* Deepti raised a concern about sharing assets across multiple sites, as the current configuration only allows assets to be visible in one site. Vijay Kumar suggested a potential solution involving relative paths and CDN configuration. \n• *TinyMCE Extension:* Manu mentioned the customer's request for extending TinyMCE to include custom classes. Vijay Kumar suggested discussing this with the Universal Editor team for potential solutions. \n• *AI Assistant:* Vijay Kumar proposed onboarding the customer to the AI Assistant to help create forms more efficiently. Manu agreed to arrange a demo session with the customer to showcase the AI Assistant's capabilities. \n:todo_done: *",
    "created_at": "2026-01-30T06:26:21.448Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749577815.398139"
  },
  {
    "id": "91733fb2-6ed6-4019-8cc2-6b3a05d90af4",
    "source": "slack",
    "text": "*\nThey had some client library configuration issues, which were resolved in the call.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:19.937Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749622522.831489"
  },
  {
    "id": "bfc1d60a-be04-49e7-be56-d2d9e669e9bc",
    "source": "slack",
    "text": "*\nThey had some queries around their customizations. A few of their issues were fixed. A private release was handed for testing\n:todo_done: *",
    "created_at": "2026-01-30T06:26:18.429Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749622682.475799"
  },
  {
    "id": "bd031dae-f3b8-41ff-8ea0-3a76ef13ed28",
    "source": "slack",
    "text": "*\nIssue with custom error response was discussed. Where default AEM error page HTML was being returned instead.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:16.920Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749622835.922449"
  },
  {
    "id": "7de1069e-ded9-4140-a358-03c151f47650",
    "source": "slack",
    "text": "*\nThey had queries around one of the customizations, they wanted to achieve around standardisation of errors.\nVarious approaches with pros and cons were discussed.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:15.412Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749623308.307489"
  },
  {
    "id": "dd9d9164-50ca-47e3-a9fe-37be61ffca3f",
    "source": "slack",
    "text": "*\nTheir custom headerlibs and footerlibs were rectified with correct client library configurations.\nThey had some issues with private build, which were discussed.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:13.904Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749623438.956329"
  },
  {
    "id": "8e8cee21-9dfb-454f-acb2-23a171b7e8c8",
    "source": "slack",
    "text": "*\nGenerated by AI (manually reviewed and udpated).\n\nMeeting notes:\n• *IRS Acrobat Sign Implementation:* Emily summarized the IRS's purchase of Acrobat Sign and their IT team's collaboration with Adobe Acrobat Sign team to roll out phase one of their signature modernization, focusing on internal forms.\n    ◦ *Purchase Details:* Emily mentioned that the IRS purchased Acrobat Sign either earlier this year or at the end of last year, and it was different from the ad math contract. They purchased a separate large enterprise contract for Acrobat Sign.\n    ◦ *Collaboration:* The IRS IT team has been working with Adobe Acrobat Sign team to roll out phase one of their signature modernization, focusing on internal forms. The internal forms team is the same team working on the DMAF side, with similar leadership but different form developers.\n    ◦ *Forms Usage:* The form developers use designer and output XFA forms, with most forms being static due to browser challenges. The phase one involves taking these XFA forms and applying Acrobat Sign, which includes challenges like stripping away accessibility tags.\n• *Challenges with XFA Forms:* Emily discussed the challenges of applying Acrobat Sign to XFA forms, including the stripping away of accessibility tags, and invited questions and comments from the team.\n    ◦ *Accessibility Tags:* Emily highlighted the challenge of applying Acrobat Sign to XFA forms, which involves stripping away accessibility tags. This issue raises questions about the best tool for form development and editing moving forward.\n    ◦ *Team's Input:* Lauren asked whether the signatures are being applied to a PDF document or within the web interface of Acrobat Sign. Emily responded that she would need to review the recorded demo to clarify this.\n    ◦ *Third-Party Tool:* Emily mentioned that the IRS found a third-party tool for form development, which works but is rudimentary. The IRS is asking Adobe if they should use this tool, and the Acrobat Sign team is questioning whether Adobe could create something similar.\n• *Third-Party Tool for Form Development:* Emily mentioned that the IRS found a third-party tool for form development and asked if Adobe could create something similar, leading to a discussion on the best way forward.\n    ◦ *Tool Discovery:* Emily explained that the IRS did their own research and found a third-party tool for form development. She asked if anyone on the team had heard of this tool, but no one had.\n    ◦ *Tool Evaluation:* The IRS tried the third-party tool and found that it works, but they are asking Adobe if it is okay to use it. The team is hesitant to bless the tool due to lack of knowledge about it.\n    ◦ *Adobe's Capability:* The Acrobat Sign team at the IRS asked Emily if Adobe's engineering team could create something similar to the third-party tool. This led to bigger questions about the most effective way forward, whether to continue with acro forms or transition to adaptive online forms.\n• *Adaptive Forms vs. Acro Forms:* Emily and the team debated whether to continue with acro forms or transition to adaptive online forms, considering the level of effort and the investment in adaptive forms for Dmath.\n    ◦ *Form Development:* Emily discussed the challenge of deciding whether to continue with acro forms or transition to adaptive online forms. She emphasized the need to be thoughtful about the level of effort involved and the skill set of the individuals.\n    ◦ *Investment Consideration:* Emily highlighted the investment in adaptive forms for DMAF and the need to consider why different approaches are being recommended for internal versus external forms. She wanted to ensure the team is aligned on the best approach.\n    ◦ *Team's Input:* Lauren mentioned the automated forms conversion service as a possible solution, which Emily clarified was her own idea. The team discussed the pros and cons of using adaptive forms versus Acro forms.\n• *Automated Forms Conversion Service:* Lauren inquired about the possibility of using an automated forms conversion service to turn XFA forms into accessible forms, which Emily clarified was her own idea.\n• *Accessibility and Form Conversion:* Sudhanshu explained the process of converting XFA forms to tagged PDFs using the output API, and the team discussed the potential need for remediation to meet accessibility requirements.\n    ◦ *Conversion Process:* Sudhanshu explained that the form conversion service can convert XFA forms into code compliance-based adaptive forms, focusing on accessibility for the web rendition. He mentioned that the final output can be merged back to a PDF document of record.\n    ◦ *Tagged PDF:* Sudhanshu described the output API, which can generate tagged PDFs from XFA forms, making them accessible. He suggested verifying the output from the third-party tool to ensure it meets accessibility requirements.\n    ◦ *Remediation Needs:* Emily raised concerns about whether alternative text, tabbing orders, and other accessibility features would be retained in the new tagged PDF. Sudhanshu recommended creating sample PDFs to confirm compliance with their requirements.\n• *Licensing and Output Service:* Emily and the team discussed the licensing requirements for using the output service to convert XFA forms to tagged PDFs and confirmed that the IRS contract allows for this.\n• *Multiple Signatures Challenge:* David highlighted the challenge of using adaptive forms with multiple signatures, explaining that the integration between adaptive forms and Acrobat Sign is not seamless.\n    ◦ *Signature Issue:* David explained that adaptive forms fall apart after one signature when using Acrobat Sign, making the integration between adaptive forms and Acrobat Sign not seamless, especially in a multiple signature scenario.\n    ◦ *Team's Input:* Sudhanshu mentioned that core components do not support multiple signers, but he would check with the team to see if there is an option for multiple signers in foundation forms (with support to update fields). Emily and David discussed the challenges and the need for a seamless integration.\n    ◦ *Current Process:* David described the current process where adaptive forms are signed, converted to PDF, and then routed to the next person for signature. He highlighted the complexity and maintenance challenges of this approach.\n• *Next Steps and Internal Alignment:* Emily outlined the next steps, including obtaining XFA form samples, reviewing recordings of previous demos, and having an internal conversation to align on the best approach for the IRS.\n    ◦ *Action Items:* Emily outlined the next steps, including obtaining XFA form samples to run through the output service, reviewing recordings of previous demos, and having an internal conversation to align on the best approach for the IRS.\n    ◦ *Team Collaboration:* Emily emphasized the need for internal alignment and collaboration with the Acrobat Sign PM team. She planned to regroup with Molly and Daniel, the PMs leading the project, to ensure a unified approach.\n    ◦ *Pros and Cons:* Phillip suggested creating a list of pros and cons for each option (maintaining XFA, converting to acro forms, or transitioning to adaptive forms) to present to the customer. Emily agreed and planned to articulate these options clearly.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:12.393Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749664800.222199"
  },
  {
    "id": "fdf5c9eb-21f5-46f8-b63f-60ff5ef1417b",
    "source": "slack",
    "text": "*\nDiscussed some of their customisation issues.\nWe have formalized scribble signature contract, the same was communicated.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:10.885Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749708197.434919"
  },
  {
    "id": "b4d2af16-c891-4707-b57b-d5e63610f193",
    "source": "slack",
    "text": "*\nPrivate release was pushed on their sandbox environment, customer has validated it on sandbox. Now they want the private release to be deployed on their production environment.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:09.377Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749708406.933019"
  },
  {
    "id": "fcbc670f-efe1-4cbc-ad24-b02e8d9f78a2",
    "source": "slack",
    "text": "*\nMeeting notes:\n• *Troubleshooting Call Update:* Arneh provided an update on a troubleshooting call with Andy and Rachael, mentioning that Core components are now enabled on the dev instance and that they are tracking an issue with a PDF where fields are repeated. The Xfas team is investigating the issue, and Arneh is following up daily.\n    ◦ *Core components enabled:* Arneh mentioned that Core components are now enabled on the dev instance. Andy identified and resolved a transient issue that prevented Arneh's pull request from being processed.\n    ◦ *PDF field repetition:* Arneh explained that a PDF exhibited a behaviour where certain fields were repeated when a specific flag was set to true. The Xfas team is investigating this issue, and Arneh is following up daily to track their progress.\n• *Conversion Errors and New Approach:* Arneh discussed the errors and mistakes in the binding during conversion shown by Andy in previous calls. They have prototyped a new approach that includes generative AI and is expected to be more scalable. \n• *Demo of Experience Builder:* Arneh demonstrated the Experience Builder, showing how to import a form, select a template, and provide additional guidance. The demo included converting a PDF to a form and addressing issues such as field detection and mapping to binding.\n    ◦ *Importing forms:* Arneh demonstrated the process of importing a form using the Experience Builder. This involved selecting a document, choosing a template, and providing additional guidance in natural language.\n    ◦ *PDF conversion:* Arneh showcased the conversion of a PDF to a form, highlighting the ability to detect fields and map them to the appropriate bindings. The demo included examples of single-page and multi-page PDFs, as well as real forms with previously identified errors.\n    ◦ *Manual steps:* Arneh noted that there is currently one manual step required after the form is created, which involves configuring the document of record. This step is expected to be automated in the future.\n• *Field Duplication Issue:* Naveen and Andy discussed an issue where fields like client name and e-mail address were showing up twice in the form. Arneh explained that the fields are named differently but map to the same client name, and the headers are now part of the form.\n• *Manual Edits and Errors:* Arneh highlighted some manual edits and errors in the conversion process, such as missing titles and errors in checkbox groups. They also mentioned issues with transitions between pages and the need for manual edits to address these issues.\n    ◦ *Missing titles:* Arneh pointed out that some titles, such as \"Advisory Account Review Form,\" were not identified during the conversion process, resulting in missing titles in the converted forms.\n    ◦ *Checkbox group errors:* Arneh noted errors in checkbox groups, where additional fields were created incorrectly, and some fields were missed. These errors require manual edits to correct.\n    ◦ *Page transitions:* Arneh mentioned issues with transitions between pages, where fields were included but created new sections incorrectly. Manual edits are needed to address these transition errors.\n• *Handling Repeated Fields:* Andy and Arneh discussed the issue of repeated fields on each page and the need to hide fields on certain pages. Arneh suggested using the Experience Builder to toggle visibility or automate the process.\n• *Incremental Updates and Rules:* Vijay Kumar and Arneh discussed the possibility of making incremental updates using the Experience Builder or predefined rules to apply during the conversion process. This approach aims to help scale the generation of forms.\n• *Concerns and Next Steps:* Andy expressed concerns about the new approach, particularly in handling tables. Naveen suggested providing a list of 30-40 forms for conversion, and Andy proposed a meeting to test the conversion process end-to-end.\n    ◦ *Handling tables:* Andy raised concerns about the new approach's ability to handle tables effectively. He noted that tables are a common point of difficulty in the conversion process.\n    ◦ *Form list:* Naveen proposed providing a list of 30-40 forms that need to be converted in the coming days. This would help prioritise the forms for conversion and testing.\n    ◦ *End-to-end testing:* Andy suggested scheduling a meeting to test the conversion process end-to-end. This would ensure that the new approach works effectively and addresses any issues that arise during the conversion.\n• *Feedback and Automation:* Satya Deep emphasised the importance of active feedback to reduce manual steps and automate the conversion process. Naveen agreed, highlighting the goal of reducing manual work and increasing automation.\n• *Handling Tables in Forms:* Arneh asked about customisations for tables in web forms and suggested using sections instead of tables for better accessibility. Andy confirmed that they do not use special components for tables and agreed to share forms with tables for testing.\n• *Digitalisation and Repeatable Fields:* Vijay Kumar recommended using repeatable fields instead of tables for better digitalisation. Naveen mentioned that their current focus is on converting forms to Adobe and then enhancing them for digital platforms.\n    ◦ *Repeatable fields:* Vijay Kumar suggested using repeatable fields instead of tables to improve digitalisation. This approach would allow for better functionality on digital platforms.\n    ◦ *Current focus:* Naveen explained that the current focus is on converting forms to Adobe to move away from DocuSign. Enhancements for digital platforms will be considered in the future.\n• *Meeting Cadence and Schedule:* The team discussed increasing the frequency of meetings to twice a week and adjusting the meeting time to accommodate different time zones. Naveen agreed to the changes.\n• *Appreciation and Next Steps:* Naveen expressed appreciation for the work done so far and agreed to share PDFs for the next batch of forms. The team planned to continue refining the process and enabling it on the environment for testing.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:07.866Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749716313.847859"
  },
  {
    "id": "dcbfa635-026a-4d7c-8e67-a92eca6df156",
    "source": "slack",
    "text": "*\nINPS\n\n• *Positive Stakeholder Feedback &amp; Contract Renewal:*\nINPS stakeholders are pleased with the team’s work on various products and are likely to renew the consulting contract until the end of summer.\n• *Adaptive Form Pilot:*\nA new pilot project is being launched for an adaptive form, which will be editable in the private area for customers. This aims to simplify the INPS feedback module.\n• *Phased Implementation Plan:*\nThe adaptive form will be rolled out in phases:\n1. Add a button for redirection to the form.\n2. Allow users to save and resume forms.\n3. Integrate the form’s submit function with the system.\n• *Partner Involvement:*\nThe partner will handle the full implementation of the adaptive form pilot, while the team will deliver a proof of concept.\n• *Batch Processing Implementation:*\nThe batch processing implementation (C# project) is nearly complete, with a final development call scheduled.\n\n*INAIL*\n\n• User Acceptance Testing (UAT) for the batch with the private endpoint is complete.\n• The project is moving into the preproduction phase.\n• The team plans to go live with batch processing by the end of this week or next week (exact date to be confirmed).\n• Emanuele needs to collect data on the expected volume and frequency of batch executions to ensure the system can handle the workload.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:26:06.356Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1749720426.586519"
  },
  {
    "id": "9aef3149-eb4e-4fbf-bc4d-a02d712b2f8b",
    "source": "slack",
    "text": "*\nThere is an enhancement required to propagate http error code from custom submit action.\nAdditionally there is an issue where the response header which is used to bypass default error pages of CDN, is being stripped off.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:04.846Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750165142.385789"
  },
  {
    "id": "3c24bb27-2b28-457a-8cac-82959a532fb1",
    "source": "slack",
    "text": "*\nWorked with SOP in resolving the issues they were facing with the newer deployment.\nGave a workaround to them to solve nested repeatable panel by custom function. There is an issue in CC based model, where stale indexes  get cached for repeatable panels.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:03.336Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750222234.719259"
  },
  {
    "id": "563b6fee-f28c-40ee-bc74-2f03b42ccbd5",
    "source": "slack",
    "text": "*\nHelped them with their review component custimization.\nHelped them to debug and figure out what went wrong in their environments, seems like their customization of page component was breaking including of custom functions added by customer.\n:todo_done: *",
    "created_at": "2026-01-30T06:26:01.827Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750333142.219459"
  },
  {
    "id": "e4320f95-19ad-4648-aee3-7379bff34e51",
    "source": "slack",
    "text": "*\nGave customer an alternate so that they are un-blocked on error on their Cloudflare CDN. Customer will confirm if that works for them.\nAlternate: check on \"content-type: application/problem+json\" and form submit request url regex\n:todo_done: *",
    "created_at": "2026-01-30T06:26:00.314Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750333392.763649"
  },
  {
    "id": "ae6cbdc8-d31c-4a03-8d7c-eba207b4b1ff",
    "source": "slack",
    "text": "*\n*IDRS Platform Scope*\n\n1. *Pre-processing: Classification &amp; Validation*\n    a. Perform validation checks\n    b. Identify document type\n    c. Apply predefined rules\n2. *Data Extraction*\n    a. Extract structured data\n    b. Perform channel-specific extraction\n3. *Document-Based Data Validation*\n    a. Signature matching\n    b. Stamp data recognition\n    c. Language translation\n    d. Crop signatures and stamps from documents\n    e. Identify handwritten text\n    f. *Example -* Validate if a document includes 3 months of payslips\n4. *Supported Document Types*\n    a. *OVD (Officially Valid Documents):*\n        i. PAN\n        ii. Passport\n        iii. Aadhaar\n        iv. Driving License\n        v. Voter ID\n        vi. RC Book\n5. *Income Documents:*\n    a. Bank Statement\n    b. Salary Slip\n    c. P&amp;L Statements\n    d. Annual Reports\n    e. ITR\n6. *Trade Documents:* (Note: This section was titled but content is not visible)\n    a. Invoice \n    b. CRF\n    c. Transport Doc\n    d. 15CACP\n7. Other Docs\n    a. Shop images\n    b. Invoice\n    c. Cheque \n    d. Margin Money\n    e. Debit note\n    f. Insurance Copy\n    g. Udhyam registration\n    h. Land record\n*CIO/Bank Direction*\n1. Support for both *Assisted* and *Unassisted* journeys\n2. *Shift Left* Strategy via IDRS:\n    ◦ Reject invalid submissions at the earliest stage\n    ◦ Validate all documents upfront\n3. Re-targeting with Agentic AI:\n    ◦ Identify user drop-offs\n    ◦ Use Gen AI to re-engage users\n*Gen AI Lighthouse Program*\n• A distinct initiative running across all major use cases\n*Observability*\n• Enable better observability by standardizing on a common ID\n*5. Account Aggregator Integration*\n\n• Phase 1 of Lead Engine (LE) not adopted\n• KYC engine integrated with multiple backend partners\n• Internal usage of KYC engine continues\n\n\n*API Design Principles*\n• Orchestration APIs will return consistent request/response formats\n• Direct API calls may continue to have varied formats\n*New Project - Sangam*\n\n• Introduce one standard API for:\n    ◦ Prefilling\n    ◦ NTB (New-to-Bank) account creation before offering any product\n• Additional use case under consideration:\n    ◦ For ETB (Existing-to-Bank) users, identify missing data and prompt for it\n• Emphasis on aligning *business (digital product)* teams with *technical* teams\n*Marketing Focus*\n• Personalized targeting\n• Real-time streaming capabilities\n• Adoption of a unified observability platform\n*Offer Decisioning (OD)*\n\n• Shift offer decision latency from *minutes* to *milliseconds (ms)*\n\n:todo_done: *",
    "created_at": "2026-01-30T06:25:58.802Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750334579.794159"
  },
  {
    "id": "d36ac2cc-3a4f-4e36-958d-ec941f410502",
    "source": "slack",
    "text": "*\n*Key Topics:*\n• *Introduction:* James, Elisa, Vijay Kumar, and Nitesh discussed the Jet2 account, focusing on the misalignment in expectations and the use of Adobe solutions. They aimed to address the escalation caused by issues with AEM forms and EDS forms. \n• *Jet2 Account Issues:* James and Elisa explained that Jet2 has been experiencing pain points with multiple Adobe solutions, leading to a serious escalation. The main issue was a call around AEM forms where expectations were not met, and the expertise from their side was lacking. \n• *Forms Expertise:* James mentioned that Nitesh was brought in to help with the conversation around EDS forms and the differences between EDS and AEM forms. They aimed to have someone from the product team articulate the differences and recommend the best approach based on Jet2's use cases. \n• *Jet2 Use Cases:* 4 category of forms\n    ◦ Simple data entry forms\n    ◦ Competition forms\n    ◦ Customer service forms, and\n    ◦ Compensation forms. \n         They evaluated the feasibility of using EDS document-based authoring, EDS universal editor, and AEM adaptive forms for each use case.\n• *Recommendation for Jet2:* Vijay Kumar recommended using EDS universal editor for Jet2's forms, as it provides a more intuitive authoring experience and supports various submission types. He also mentioned the possibility of using the Forms Experience Builder, an AI-based tool, to create forms quickly. \n• *Next Steps:* James proposed scheduling a call with Jet2's technical team to present the recommended solutions and address their concerns. They agreed to have an internal regroup before the call to ensure the talk track is spot on. \n\n:todo_done: *",
    "created_at": "2026-01-30T06:25:57.293Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750394587.424799"
  },
  {
    "id": "5fa739f1-0108-42c2-afac-557e19aa7c04",
    "source": "slack",
    "text": "*\n*Lighthouse Program Overview:*\n• Amritabha provided an overview of the Lighthouse program initiated by the MD and CIO, Ramesh, which includes 16 programs, some of which involve Gen. AI use cases. \n*AI Use Cases in Liability Section:*\n• Dhiraj discussed the need for chat and voice-based support for users on the HDFC portal, including automatic AI bot assistance for users stuck during the account opening journey. \n• The AI bot should offer both chat and voice support, depending on customer preference, and assist with form filling or resume journey in case of drop-offs. \n• The AI should also handle vernacular support for voice interactions. \n*Product Selection and Recommendations:*\n• The AI should help users select the best product variant based on factors like gender, income, etc., and provide detailed features and recommendations without cross-selling other products.\n• The AI should be able to explain product features and answer FAQs based on a feature master. \n*Address Auto-Population:*\n• The AI should auto-populate customer addresses from government documents and prompt users to manually select from a drop-down if the city does not match the master list. \n• The AI should capture the third location for video KYC if the customer is not at their permanent or communication address, and provide a reason for the same. \n*Fraud Detection:*\n• Fraud detection will be handled by the bank's BRE, and AI is not required for this part. \n*Drop-off Assistance:*\n• The AI should assist users who drop off during the journey by initiating a call and connecting them to an RM to complete the onboarding process. \n*Cross-Sell Recommendations:*\n• The AI should recommend cross-sell products like credit cards and insurance based on the user's profile and journey inputs. \n*Use Case:*\n• The primary use case involves enabling chat and voice-based AI support for users during the account opening journey on the HDFC portal, including assistance with form filling, product selection, address auto-population, video KYC, fraud detection, drop-off assistance, and cross-sell recommendations. \n\n:todo_done: *",
    "created_at": "2026-01-30T06:25:55.782Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750433143.352389"
  },
  {
    "id": "33851d23-bef3-40bd-8bf0-0d8f15ba6f50",
    "source": "slack",
    "text": "*\n*Meeting Objective*\nTo resolve connectivity issues between Carpenter’s Adobe Experience Manager (AEM) instance and their Azure SQL Server database, and to clarify the correct integration approach.\n\nKey Discussion Points\n• Current Issue: Carpenter is unable to connect AEM to their Azure SQL Server. The “Sources” option in Adobe Experience Platform (AEP) was not provisioned for their account, leading to confusion about the correct integration path.\n• Clarification from Adobe:\n    ◦ The AEP “Sources” feature is not the correct method for connecting AEM to Azure SQL.\n    ◦ Instead, the connection should be established using Form Data Models (FDM) within AEM.\n    ◦ Configuration must be done via code (Git/VSTS), as there is currently no UI for this setup.\n• Technical Demonstration:\n    ◦ Adobe demonstrated how to configure the Azure SQL connection using environment code, connection strings, and pipelines.\n    ◦ Once configured, the database can be accessed through FDM and used in adaptive forms for CRUD operations.\n• Security Considerations:\n    ◦ Discussion around whether the Azure SQL Server should be accessible via public IP or through more secure means (e.g., private IP, API wrapper).\n    ◦ Carpenter prefers not to expose the database via public IP.\n• Alternative Options:\n    ◦ Adobe suggested using SharePoint Lists for simpler data like picklists.\n    ◦ Wrapper APIs over Azure SQL were also discussed as a way to limit data exposure.\n• Environment Setup:\n    ◦ Carpenter is still setting up their local dev environment.\n    ◦ They expressed a preference to work entirely in the cloud if possible.\n    ◦ Adobe explained that front-end development can be done in the cloud using Edge Delivery Services, but back-end customization still requires a local environment.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:25:54.274Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750752425.872629"
  },
  {
    "id": "2db86d8d-b268-4e10-916a-1b0558ea8621",
    "source": "slack",
    "text": "*\n• The call centred on 3 tech approaches:\n    a. EDS Document-based Forms\n    b. EDS Universal Editor Forms \n    c. AEM Adaptive Forms – Core Components (Cloud)\n• Vijay (forms product team, Adobe) gave a demo on each before including Form Experience Builder, Nitesh (field engineering, Adobe) shared a like for like comparison of compatibility against each of your 4 use cases.\n• Recommendation (clear winner) was adoption of EDS universal editor forms.\n• Recommended Jet2 to join Forms Experience AI Beta program – Jet2 to confirm (no commercial implications whilst in BETA phase) \n• Offered VIP programme partnership on forms – dependency on a clear go live date (alternative is a one-time workshop with the product team/ongoing Ultimate support)\n:todo_done: *",
    "created_at": "2026-01-30T06:25:52.755Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750753537.226489"
  },
  {
    "id": "8a7f9f30-197a-4556-9ccb-e33f5584540f",
    "source": "slack",
    "text": "*\nGuided them over, how to achieve their targeted usecases in DoR.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:28.891Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750755873.674919"
  },
  {
    "id": "f2301066-fa3d-4b86-8cb1-f284e0a6f3aa",
    "source": "slack",
    "text": "*\nForms overview, including \"Forms Experience Builder\" and \"Forms Optimizer\" was shared by Arun.\nDemo was given for Core Component based AF version of their current forms. Rule, DoR, FDM capabilities were highlighted.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:27.381Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750756047.370239"
  },
  {
    "id": "cd63f698-43f8-4831-8ff6-ae4938ef91ec",
    "source": "slack",
    "text": "*\n• *Forms Conversion Progress:* Satya Deep provided an update on the conversion of 15 out of 19 forms, noting that some manual work is required to address gaps in the automated conversion process. They aim to reduce the manual effort needed after form conversion.\n• *Binder and Dor Binder Requirement:* Satya Deep mentioned that the team is working on a PR to implement changes for the binder and door binder requirement. They need input from Naveen's team to understand what should be populated into the attribute groups.\n• *Adobe AI Capabilities:* Naveen inquired about leveraging Adobe AI capabilities, and Satya Deep confirmed that it is enabled and can be tried out. However, some manual intervention may be required to make the forms fully functional.\n• *Guide Bridge Change:* Satya Deep mentioned an open item related to the guide bridge, which has been merged and is available for use.\n• *Forms Conversion Demonstration:* Mayank demonstrated the conversion of forms, highlighting that 15 out of 19 forms were converted successfully. The remaining forms were too large and require the implementation of async functionality.\n• *Dark Theme Issue:* Mayank addressed the dark theme issue, explaining that the theme depends on the system settings. If the system is set to dark mode, the form will appear in dark mode.\n• *Form Conversion Flakiness:* Satya Deep and Mayank discussed the flakiness in form conversion, noting that retrying the conversion process usually resolves the issue.\n• *Adobe Sign Integration:* Naveen confirmed that the forms will use Adobe Sign for e-signatures. The user will fill out the form in HTML, and the form will be sent for e-signature using Adobe's API.\n• *Manual Effort in Form Conversion:* Raciel and Mayank discussed the manual effort required to delete repeated fields like account numbers. They suggested providing guidance during the import process to avoid manual deletion.\n• *Repeatable Panels Limitation:* Mayank mentioned a limitation in converting repeatable panels, where the same rows are converted multiple times instead of being implemented as repeatable panels.\n• *Multisigners Issue:* Mayank reported an issue with multisigners, which is being investigated by the internal team. They hope to provide an ETA for the solution by the end of the week.\n• *Testing and Feedback:* Naveen and Raciel agreed to test the converted forms and provide feedback. They will also share additional forms for conversion and testing.\n• *Future Plan:* Naveen mentioned that they have approximately 1500 forms to test with Adobe AI capabilities. They aim to address manual tasks using AI to meet tight timelines.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:22:25.872Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750777388.779649"
  },
  {
    "id": "140987a1-7e5f-41a5-abe3-be7fbf1c0626",
    "source": "slack",
    "text": "*\n• Vijay showcased the latest innovations of IC on cloud with new structural change of json based storage and highlighted that most of the requested features by NFCU being delivered.\n• Showcased the features like \n    ◦ Fragments\n    ◦ FDM integration\n    ◦ Font support\n    ◦ Formatting support like strikethrough\n    ◦ Rule Editor, data based show/hide of fragments\n    ◦ PDF preview using IC rendering API\n• NFCU was really happy to see the progress with comments from Sharmila \"This is good progress and we are now confident to use IC for more usecases of other departments\" \"Thanks for all the support and partnership\"\n• There were few other requirements from NFCU like\n    ◦ Locking the Template editing by Letter Authors\n    ◦ Associate UI usecase\n    ◦ Role based access\n    ◦ When this would be GA\nThanks to <@WE163TH43>, <@U03Q109GQMT> and team for presenting the demo\nOverall *team-IC* which has put on tremendous effort for past few months with multiple Architectural meetings, multiple canvases being created to track the dependencies, completion of work, testathon, etc. Its great to see the outcome and positive feedback from the customer.\ncc: <@WQWCBV6NN> <@W9QMZFR39> <@W4RSW3ECC>\n:todo_done: *",
    "created_at": "2026-01-30T06:22:24.361Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750784775.811059"
  },
  {
    "id": "08c7cdb6-8b7b-4ada-aff0-cdaa00615b54",
    "source": "slack",
    "text": "*\n• TravelPort wants to modernize their forms - and highlighted the concerns:\n    ◦ Do we have an immediate solution to avoid the IE11 requirement (they render the XDP as PDF currently)\n    ◦ Do we have a long term solution - which is responsive and path to AF\n• Mentioned that if we do not have a solution - they would proceed to evaluate other options.\n• They are also open to movement to Cloud (technically - but separate Sales discussion has not happened) - currently on 6.3 - On-prem.\n• After thought - would cache work with prefill in MF - I guess no - so need to check performance with prefill - and we may need to work on it on CS (since their form is very large and mostly prefilled) - <@W6CBB4953> any thoughts.\nProposal shared:\n• Move to MF for now - highlighted that memory requirements may be high - and needs to be verified with:\n    ◦ Data\n    ◦ on CS\n• Need to review and share forms with them (MF - with Form &amp; Fragments) - so they can evaluate on their side\n• We would be sharing the build on 6.5\n• We would review some of the scripts they share - and review the changes that are required (manually) - for migrating these to Adaptive Forms.\nThey have a very large form - with lots of fragments and cannot split the form - and the form is like an application which does a lot of analysis and then the complete flow is the form itself to identify the best deals for the customer.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:22.853Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750895536.860659"
  },
  {
    "id": "fea5a1cf-548f-421d-a514-e7a6ac4e533a",
    "source": "slack",
    "text": "*\nPresenter: *Ken Woodward*\nProject Lead: *Andrei Bogdan*\n\n• Ken introduced Sites Optimizer - since some of the participants had not seen the UI earlier, and were not aware of the capabilities. It was a short 30 mins call - do most of the time was spent on introducing the Sites Optimizer to them.\n• They were quite interested in the SEO, Broken backlinks and related opportunities and were especially interested in the auto-fix part of the opportunities.\n• The various opportunity categories were shared with the customer, and they have access to the UI now. They would be reviewing and identifying the specific stakeholders for each opportunity to continue the discussion (engagement plan for 3 weeks).\n• They asked for more fine grained control for the UI - allowing specific stakeholders to have access to specific opportunities (to ensure wrong persona does not mark an opportunity as invalid) - since they have specific teams for different opportunities.\nFrom forms side - we have identified and updated the ASO UI with 2 opportunities:\n• Newsletter form having low views\n• Forms Accessibility opportunity (identified from AXE-Core)\ncc: <@W4RSW3ECC> <@W6CBB4953> <@W4RT1B152>\n:todo_done: *",
    "created_at": "2026-01-30T06:22:21.344Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750903648.194029"
  },
  {
    "id": "7a2f80e2-a651-4d67-861d-f3d4713572d1",
    "source": "slack",
    "text": "*\n• Pankaj showcased the Save As Draft along with USC customisation demo to IRS and Accenture Federal team.\n• Additionally, we highlighted two *enhancements* made while delivering this feature, specifically to address IRS requirements:\n    ◦ *Support for Request Object in Save Data API:* During our analysis of the IRS codebase, we noticed they had implemented additional code to support the request object in the Save Data API for Foundation-based forms. We have now added this support out-of-the-box, so no custom implementation is needed from their side. This will reduce the effort to create new servlet for core component based form to request attribute. ( Reducing ~300 lines of Code)\n    ◦ *Reusable Sample Implementation:* The shared sample implementation converts Core Component-based POJOs into Forms Foundation-compatible POJOs and calls Metadata and Data APIs. This aligns with IRS’s existing customization, so they can use it as-is without requiring further modifications.\n• Demo was well received and all the collaterals have been shared.\n• Vara (IRS) was also present and highlighted concerns regarding multiple Feature Toggle, which we clarified that Adobe will support the same and all these enhancements will be part of subsequent Feature Pack release and this HF needs to be validated on non-production environment first.\nThanks <@U04P75X4H1B> and <@WLWHN4TV3> for great work in delivering this feature backport on 6.5 for CoreComponents along with support of customisation on priority basis which was very critical for IRS.\ncc: <@W4RU4N66R> <@W4RSW3ECC>\n:todo_done: *",
    "created_at": "2026-01-30T06:22:19.836Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750928837.106899"
  },
  {
    "id": "778d04fa-156e-43aa-a6e4-d696d7be4267",
    "source": "slack",
    "text": "*\nIn the meeting, we provided a comprehensive walkthrough of the newly introduced features and discussed each in detail. The key features covered include:\n• Template creation workflow\n• Fragments &amp; Converting fragment as Object\n• FDM Integration &amp; corresponding data binding\n• Font Support to generate pixel perfect PDF\n• Formatting Enhancements (e.g., font size adjustments)\n• Rule Editor – including data-driven show/hide setvalueof , setPropertyof,clearValueof etc... functionalities.\n• PDF Preview using the IC Rendering API\nIn addition to feature demonstrations, we also discussed:\n• *Archetype Updates* – including new bundle versions\n• *Template Generation Workflow* *Updates*– with guidance on incorporating these changes into the client environment\n• *Importing Existing XDPs* – steps and best practices were shared\n*Client Feedback and Requests:*\n• *Template Locking Feature:* NFCU requested the ability to lock template editing for Letter Authors.\n• *Custom Font Size Requirement:* NFCU expressed the need for more flexible font size settings (i.e custom font size) beyond the current dropdown options.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:22:18.325Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1750997599.648709"
  },
  {
    "id": "d54c3bd0-fc88-4ef6-9af0-fea829bd9d7e",
    "source": "slack",
    "text": "*\nDebugged their issues. Identified a product issue along with their customization issues.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:16.818Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1751041007.075779"
  },
  {
    "id": "e1c1d20b-c385-48ca-99e5-d34ed8c72c15",
    "source": "slack",
    "text": "*\n• Answered queries regarding implementation of custom components in EDS via UE. They had implemented a few but without following the right approach which caused a lot of issues in the code for them.\n• Helped them with discovery of functionalities within rule editor for their use cases.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:15.312Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1751351277.366189"
  },
  {
    "id": "a3f9ea0b-a91f-4f7d-b67c-8be2e7885eb4",
    "source": "slack",
    "text": "*\n• *Local Test Harness Setup*: Satya Deep and Raciel discussed the local test harness setup. Satya mentioned that they had set it up and tested a couple of forms. They observed that all fields were populated for one form, but some fields were missed for another. Yash has been working on a fix, and the PR is already merged. Once deployed, the issue should be resolved.\n• When Raciel tried the same form which was working for Satya and Yash, for him the pdf was coming blank.\n• *Code Review and Updates*: Mayank and Satya Deep reviewed the code and identified that the latest changes were not reflected in the JavaScript for the URL. They suggested updating the code to the latest develop branch and redeploying the test harness.\n• *Local Code Check*: Raciel was advised to check the local code and ensure it was running the latest develop branch. This involved pulling the latest changes and redeploying the test harness.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:13.805Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1751426323.910069"
  },
  {
    "id": "2fd78c2d-0862-4327-9d95-469c9ef38adc",
    "source": "slack",
    "text": "*\n1. NFCU has successfully completed the archetype changes on top of their existing Archetype version 52, *enabling full* use of the IC Editor.\n2. Harish and Adarsh from NFCU reported a 401 error while accessing the editor. Upon checking Splunk logs on the call, we found that they were not part of the `forms-user` group. This was communicated to their team. Shubham Nilkanth had the permissions, was there in the call, we checked the *whole flow* was working fine for him.\n3. A few issues were observed while importing XDPs created using the legacy Designer into the IC Editor:\n    ◦ Text appeared vertically aligned. This is due to feature differences between the legacy Designer and IC Editor. \n    ◦ A 500 error occurred when attempting to save the imported XDP. We clarified that the Import XDP feature is primarily intended to support reuse of XDPs created using the IC Editor, not legacy Designer XDPs.\n4. NFCU requested to increase the meeting frequency to four times a week. While we questioned the necessity of this, they were persistent in their request. The frequency has been increased to three meetings per week :slightly_smiling_face:\n:todo_done: *",
    "created_at": "2026-01-30T06:22:12.296Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1751434842.598499"
  },
  {
    "id": "d3baa12e-1709-4c5b-b361-d19ce6fa1116",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Bindings Issue:* Satya Deep and Raciel discussed the bindings issue, with Satya suggesting reimporting the form with a different name to ensure the bindings work. Raciel agreed to try this approach.\n    ◦ *Reimporting Forms:* Satya Deep explained that reimporting the form with a different name might resolve the bindings issue. He mentioned that the backend code queries the JCR to find the form, and if the form is reimported with the same name, it might find the old one, causing the problem to persist. Raciel agreed to try reimporting the form with a different name.\n    ◦ *Testing Imported Forms:* Raciel asked if he could delete the converted forms if they were to be imported again. Satya Deep confirmed that it was possible and suggested testing the already imported form in the Adobe Yash folder. Yash confirmed the location of the form, and Raciel agreed to test it.\n• *Test Harness Changes:* Andy and Raciel examined the test harness changes, with Andy confirming that the data looks decent and the bound data is coming across fine.\n• *Special Characters in Bindings:* Andy, Yash, and Raciel discussed the issue of special characters in bindings, with Yash confirming that special characters should be enclosed in quotes. Andy suggested checking if the fields with special characters are causing the issue.\n    ◦ *Quotes in Bindings:* Andy and Yash discussed the need for enclosing special characters in quotes for bindings. Yash confirmed that for AF2, special characters in the bind reference should be enclosed in quotes. Andy mentioned that document of record bind references do not need quotes, but previous bind references had a dollar period, and they need to check if quotes are causing the issue.\n    ◦ *Checking Field Names:* Andy asked Raciel to check the field names in the adaptive form to ensure they match. Raciel found small changes, such as a dash, that might be causing the issue. Andy suggested checking if the fields with special characters are causing the problem.\n    ◦ *Testing Fields:* Yash suggested filling other fields to check if all fields are not coming or just a few. Andy noted that fields without special characters showed up correctly, while those with special characters did not. Raciel confirmed that fields with underscores in the table were not working.\n• *Comparing XML Data:* Satya Deep and Andy suggested comparing the XML data being sent in cases where it works and where it doesn't to identify any differences. Andy provided the XML data for comparison.\n    ◦ *XML Comparison:* Satya Deep suggested comparing the XML data being sent in cases where it works and where it doesn't to identify any differences. Andy provided the XML data for comparison and asked Raciel to paste the XML data for Satya Deep to review.\n    ◦ *Exporting XML Data:* Andy explained that the XML data used was generated from the adaptive form and no changes were made to it when sending it to the communication service. He suggested checking if the XML data needs to be converted back to JSON before sending it to the communication service.\n• *Communication Service Issue:* Andy and Satya Deep discussed the issue with the communication service, where the XML data works in the adaptive form but not when generating the PDF. Satya suggested checking the XML being sent to the communication service.\n    ◦ *Generating PDF:* Andy noted that the XML data worked in the adaptive form but not when generating the PDF. Satya Deep suggested checking the XML being sent to the communication service to identify any issues. Andy confirmed that the XML data was not different and suggested checking if any changes were needed in the generate PDF servlet.\n    ◦ *Communication Service:* Andy explained that the Java API calls the communication service and sends the XML data. He noted that bindings with special characters were not getting picked up when generating the PDF, and suggested checking the XML data being sent to the communication service.\n• *Error Toast Issue:* Satya Deep provided an update on the error toast issue, stating that the internal authoring team is looking into it and will follow up with a solution.\n• *Sign Field Issue:* Satya Deep updated that the team has figured out a solution for the sign field issue and is working on a fix, which should be deployed by 11th July.\n• *Manual Step for Door Bindings:* Satya Deep mentioned that the team is working on automating the manual step of associating the PDF with the adaptive form to ensure the door bindings work.\n• *Team Availability:* Satya Deep informed that the team had been occupied with hackathon activities, but they should be back next week, which will help in making progress on the issues.\n• *Adobe AI Capabilities:* Naveen inquired if the Adobe AI capabilities will be useful after 11th July, Team decided to reconnect on 8th July to assess the progress.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:22:10.786Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1751867523.769939"
  },
  {
    "id": "2ebce8e6-b226-4b5b-86ec-853052d6be91",
    "source": "slack",
    "text": "*\n• *PDF Conversion Issues:* Darshan and Andy discussed the issues related to converting Word documents to PDFs, including formatting problems and the need for cleanup. They also explored options for retaining signature fields in the converted PDFs.\n    ◦ *Conversion Process:* Darshan and Andy discussed the process of converting Word documents to PDFs, highlighting the use of a tool to convert Word to PDF. Andy mentioned that the converted PDFs received have acro fields, which are then opened with a designer for further modifications.\n    ◦ *Formatting Issues:* Andy explained that selecting the second option during conversion often leads to significant cleanup due to formatting issues. This problem persists even with the regular flow layout, necessitating retesting to address the formatting challenges.\n    ◦ *Interactive Forms:* Andy demonstrated how to create an interactive form with fixed pages to maintain the visual layout. This approach helps prevent the flow from getting messed up during the conversion process.\n• *Retaining Signature Fields:* Darshan and Andy examined the workaround for retaining unsigned signature fields in PDFs, noting that the current implementation checks if the template is XDP and sets the retain flag accordingly.\n    ◦ *Workaround Implementation:* Andy explained the workaround implemented to retain unsigned signature fields. The system checks if the template is XDP and sets the retain flag to true only for XDP templates. This ensures that the signature fields are retained in the converted PDFs.\n    ◦ *Signature Field Retention:* Andy clarified that the workaround involves setting the retain flag to true for XDP templates, which prevents the removal of acro field signature fields during conversion. This approach ensures that the original signature fields are preserved in the final PDF.\n• *PDF Types and Issues:* Darshan explained the different types of PDFs and the issues caused by converting Word documents to PDFs and making changes in Designer. Engineering is investigating the issue and will provide a fix.\n    ◦ *PDF Types:* Darshan discussed the various types of PDFs, including those converted from Word documents and those modified using Designer. He highlighted that PDFs converted from Word documents and then modified in Designer become a special kind of PDF, leading to specific issues.\n    ◦ *Engineering Investigation:* Darshan mentioned that the engineering team is investigating the issues related to these special PDFs. The team is working on identifying the root cause and will provide a fix to address the problems encountered during the conversion and modification process.\n• *Adaptive Forms and Signature Fields:* Mayank and Andy discussed the process of converting PDFs into adaptive forms and the need to remove signature fields from the adaptive forms to ensure proper signing after PDF generation.\n    ◦ *Conversion Process:* Mayank and Andy discussed the process of converting PDFs into adaptive forms. They emphasised the importance of removing signature fields from the adaptive forms to ensure that signing occurs after the PDF is generated, rather than during the form-filling process in the browser.\n    ◦ *Signature Field Removal:* Andy agreed with the suggestion to remove signature fields from the adaptive forms. This approach prevents the end user from signing the form in the browser, ensuring that the signing process is completed after the PDF is generated and merged with the filled form data.\n• *Text Tagging for Fields:* Andy and Manu explored the use of text tagging for fields in PDFs, including name, initials, and date signed, to automate the population of these fields during the signing process.\n    ◦ *Text Tagging:* Andy and Manu discussed the use of text tagging for fields in PDFs, such as name, initials, and date signed. This approach automates the population of these fields during the signing process, ensuring that the correct information is filled in automatically.\n    ◦ *Field Automation:* Andy explained that the current implementation uses text tagging to automatically populate fields like initials and date signed. This reduces the need for manual entry and ensures that the fields are correctly filled during the signing process.\n• *Acro Forms and Authoring Team:* Andy explained the process of tagging signature fields in acro forms and the role of the authoring team in selecting and configuring these fields before sending the PDF to Adobe Sign.\n    ◦ *Tagging Process:* Andy described the process of tagging signature fields in acro forms. The authoring team selects the signature fields and configures them based on the requirements. The system then automatically detects and tags these fields before sending the PDF to Adobe Sign.\n    ◦ *Authoring Team Role:* Andy highlighted the role of the authoring team in selecting and configuring signature fields. The team uses an authoring UI to specify the fields, and the system automatically adds the necessary tagging for these fields before the PDF is sent to Adobe Sign.\n• *End-to-End Testing:* Mayank and Raciel discussed the challenges faced during end-to-end testing of the converted forms, including issues with special characters and bindings that prevented successful signing in Adobe Sign.\n    ◦ *Testing Challenges:* Mayank and Raciel discussed the challenges encountered during end-to-end testing of the converted forms. They identified issues with special characters and bindings that prevented successful signing in Adobe Sign, highlighting the need for further investigation and resolution.\n    ◦ *Special Characters:* Raciel mentioned that the presence of special characters in the forms caused binding issues, which in turn prevented successful signing in Adobe Sign. The team is working on addressing these issues to ensure smooth end-to-end testing.\n• *Retaining Signature Fields for All PDFs:* Mayank suggested removing the XDP check and setting the retain flag to true for all types of PDFs to avoid issues with signature fields appearing twice or not being clickable.\n    ◦ *Retain Flag:* Mayank suggested removing the XDP check and setting the retain flag to true for all types of PDFs. This approach aims to avoid issues with signature fields appearing twice or not being clickable, ensuring that the signature fields are correctly retained in all PDFs.\n    ◦ *Implementation Plan:* Andy agreed to prepare for the change suggested by Mayank. Until the fix is implemented, the team will continue checking the template type to determine whether to set the retain flag to true or false.\n• *Sharing Source Documents:* Darshan requested Andy and Raciel to share the source Word documents and the original PDFs to help investigate the issues further. They agreed to check with their team and share the required documents.\n• *Table Component Issues:* Mayank explained the issue with table components in adaptive forms, where the fields in the table are not properly mapped, causing data to be missing in the generated PDF. They are investigating the solution.\n    ◦ *Table Component:* Mayank explained that the table component in adaptive forms is not properly mapped, leading to missing data in the generated PDF. The issue arises because the table fields are converted into individual fields, causing a mismatch in the field names and bindings.\n    ◦ *Investigation:* The team is investigating the solution to the table component issue. They are exploring the possibility of converting table fields into repeatable panels, allowing users to add entries dynamically and ensuring that the field names are correctly mapped.\n• *Testing Without Table Components:* Mayank suggested testing the conversion and data population process with PDFs that do not have table components to ensure that other fields are correctly filled in the generated PDF.\n    ◦ *Testing Approach:* Mayank suggested testing the conversion and data population process with PDFs that do not have table components. This approach aims to ensure that other fields are correctly filled in the generated PDF, helping to isolate and address the table component issue.\n    ◦ *Field Population:* Mayank recommended focusing on PDFs without table components to verify that all other fields are correctly populated in the generated PDF. This step will help identify any remaining issues and ensure that the conversion process works as expected for non-table fields.\n• *Async Feature for Large Forms:* Mayank mentioned the implementation of an async feature for converting large forms, which will allow the conversion of forms with 40+ pages. This feature is expected to be available soon.\n• *Next Steps:* Vijay summarised the next steps, including identifying fixes for the two ongoing issues, converting large PDFs, and testing the entire process except for signing. Andy will test a new form and report back.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:22:09.272Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752054189.826009"
  },
  {
    "id": "a943dd4d-a7da-43da-bf29-c54215cef693",
    "source": "slack",
    "text": "*\n*Deskside Coaching - AEM Translation*\nAgenda:\n• Sites\n    ◦ *Overview AEM Translation Framework* : Learn how AEM handles multilingual content using Translation Projects and integration with translation providers.\n    ◦ *Executing Translation for Sites (with Demo)* : Hands-on session on translating AEM Sites using translation workflows and automation.\n    ◦ *Translating Content Fragments (with Demo)* : How to localize structured content using Content Fragments and manage their translation lifecycle.\n    ◦ *Translating Digital Assets (with Demo)* : Managing asset metadata and visual content across multiple languages using AEM Assets workflows.\n    ◦ *Setting Up New Languages for Sites :* Guidance on enabling new locales: creating language roots, language copies, and configuring translations.\n• Forms:\n    ◦ *Using Translation in AEM Adaptive Forms :* Overview of translating AEM Forms using built-in i18n support and custom resource dictionaries.\n    ◦ *Setting Up New Languages for AEM Forms :* How to configure new language options specifically for Forms — including resource files and locale setup.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:22:07.762Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752144477.243999"
  },
  {
    "id": "eb74076a-403e-4a9d-b413-c1832347fb5a",
    "source": "slack",
    "text": "*\nNFCU went live with their first AF usecase\n<https://www.navyfederal.org/forms/lending/ccdr/ccdr.html>\n\nIn the meeting NFCU, highlighted few other requirements and they mentioned that there is good traction among other departments after the success of AF and IC.\n• Deploy IC latest build on Dev2 and QA env\n• Need closure on ongoing Theme issue - Issue is pending with CloudManager team\n• Automated Custom Metadata which is readonly\n• Manual Letter generation - It appeared to be Associate UI usecase, Chris shared the mocks and we shared 6.5 AgentUI documentation\n• Sharmila also wanted to have discussion around AEM Projects, for which we re-directed to reach out to TAM.\n• NFCU also showed a list of other requirements around IC\nWe emphasised in the meeting that, it would be helpful to share all such requirements over email, with detailed usecase and in priority order, so that we can discuss the solution in the meeting.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:06.254Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752203443.361069"
  },
  {
    "id": "546124af-f5f3-46f2-a90a-a671187c0e83",
    "source": "slack",
    "text": "*\n*PDF Conversion Issues:* Mayank and Andy discussed the issues with PDF conversion, specifically the multiple sign-up fields and the XML generated with respect to the table component. Andy confirmed that the previously converted forms are live and they are continuing to use the other process while trying to get the AI going.\n\n*Table Component Issue:* Mayank and Andy discussed the issue with the table component in the forms. Andy explained that they have not implemented any table as of such in the current round for RIA forms and are using specific field names instead of repeating field names.\n.\n*Conversion to Core Components:* Mayank confirmed that for the new set of forms using AI, they are OK to convert them into core components. Andy agreed as long as it works.\n\n*XML Notation for PDF Service:* Mayank shared the updates on the table component issue and explained that they have tried with a specific XML notation and it is working for them. Andy confirmed that if the XML is not converted to this particular format, it requires PDF processing at the service level.\n\n*Changes in Workbench Standalone and Optional Code Bases:* Andy mentioned that the changes required for the table component issue would need to happen in the Workbench standalone and optional code bases. Michelle suggested taking up the decision with Naveen.\n.\n*Effort for Changes:* Andy estimated that the effort for the changes would be one point and it would have to go through a release cycle. Michelle agreed and mentioned that they would need to coordinate with other teams on timing.\n\n*Testing and PR Creation:* Mayank and Andy discussed the testing and PR creation process. Mayank mentioned that Yash would create a PR and share it in the teams channel for review. Andy confirmed that he would handle the PR and all of that.\n\n*End-to-End Testing:* Mayank requested Andy to try end-to-end testing of any form that does not have a table component to see if they are facing any other issues. Andy mentioned that he has not had time to do that in the last two days.\n.\n*Multiple Signer Part:* Mayank mentioned that the team would be able to share the release for the multiple signer part by 16th July and they would pass on the release to Andy for testing.\n.\n*Coordination for Testing:* Andy and Mayank discussed the coordination for testing the release for the multiple signer part. Andy mentioned that they would need to remove their workaround for testing.\n.\n*Uploading Word Document:* Andy mentioned that he would find a place in assets to upload the Word document and ping the link in AM. Satya Deep suggested using the teams channel as well.\n.\n*Next Meeting:* Mayank mentioned that they would share the PR by today or tomorrow and requested Andy to share the update on whether the things are working end-to-end before the next meeting.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:04.747Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752227720.519739"
  },
  {
    "id": "0cfa51f9-f315-42b3-bfe5-53924bec74b7",
    "source": "slack",
    "text": "*\nAttendees\n• *Colin Vlasak* – Marketing Owner, Stericycle &amp; Shred-it\n• *Dillon Sorensen* – Colin’s Manager, Waste Management (parent company of Stericycle)\n\n*Meeting notes*\n\n*Explained Site Optimizer:*\n• Demonstrated how Site Optimizer uses operational telemetry and AI analysis to surface accessibility and conversion opportunities.\n• Clarified the Early-Access “Forms Optimization” program: our team will both run experiments and implement fixes, given that we have required access.\n*Discussed the Opportunities present in Shredit and Stericycle Domains:*\n• Colin understood the opportunities and mentioned that they have been doing that in the past but did not have the bandwidth to do the same after the acquisition. Though he mentioned two important things: \n    ◦ Quality of leads is more important but was open to experimentation given that the sales agrees to it.\n    ◦ For _Forms Navigation_, success will be measured by the combined conversion uplift of the source page *and* the form page, not the form page alone.\n    ◦ Confirmed that experiment data can be integrated with their analytics server.\n*Business KPIs and CPL:* Colin explained that the main KPI for form submissions is the conversion rate, which is monitored to identify trends and trigger deeper analysis if needed. Though shredit has a similar form across all the pages, Stericycle has different measure for different forms.\n\nThey measure CPL from the paid traffic and Colin will supply current *cost-per-lead (CPL)* figures for paid traffic in a follow-up note.\n\n*Experimentation Framework:* Vijay cleared the doubts regarding licensing and availability of experimentation framework in their environment\n\n*Access to Site Optimizer:* Colin  inquired about access to the Site Optimizer, explained that portal access with only Form specific Opportunities is forthcoming; meanwhile, form-specific insights will be shared as documents.\n\nNext Steps:\n\n*Share the Data for Review:* (Colin)\nThey will review the form optimization insights and discuss with the sales team or senior leaders to determine the feasibility of implementing the suggested changes.\n\n*VIP Program Participation:* They will Discuss internally and confirm participation in the VIP program for form optimization testing.\n\n*Follow-up Meeting:* Schedule a follow-up meeting for the week of July 28th to discuss the form optimisation opportunities and next steps.\n\n*Document Authoring (Separate topic than Forms Optimizer)*\nVijay and Colin discussed Document Authoring (Dark Alley) and how they can leverage it for Forms. Vijay will be setting up a separate meeting with them demonstrate those capabilities\n:todo_done: *",
    "created_at": "2026-01-30T06:22:03.235Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752571527.287109"
  },
  {
    "id": "7ea4f2ec-f75d-44ed-9c37-0933b50b4470",
    "source": "slack",
    "text": "*\n• Model bump and some other improvements radio button getting detected correctly and all options coming in for the radio buttons. \n    ◦ *Action item - Engineering team (changes have been done some test failures did not allow for deploy, targetting this for tomorrow)*\n• Double sign field coming\n    ◦ *Action item - Engineering team has done the fixes, will make it available on LPL environment by 17th July*\n• Once these changes are done end to end testing.\n    ◦ *Action item - LPL team to test the forms end to end.*\n        ▪︎ In this regenerate the form which every you want to test using /import-form\n        ▪︎ Verify the fields are correct and the corresponding bindrefs are correct.\n        ▪︎ Testing the for data coming fine in filled pdfs and signing also working fine on the generarted pdf.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:22:01.726Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752590518.203729"
  },
  {
    "id": "65fb0ab6-e699-4a92-be4f-c91f93a9b1ed",
    "source": "slack",
    "text": "*\nAttendees\n• Shameem Gouse Lazam Sayyad\n• Shivendra Vikram Singh\n• Kevin Ausburn\nMeeting Notes:\n\n*Introduction:* The team had some knowledge of Sites Optimizer and gave them an introduction of the Forms Opportunities. Shivendra mentioned that it is good that Form Opportunities are also presented within a single tool. They were earlier confused with what Forms is doing vs Sites.\n\n*Sampling in Optel*\nWe emphasised that the analysis and opportunity suggestion is AI driven but since they had low traffic it takes time to collect enough data. There was a question if we can change the sampling rate. We confirmed that it is done during experimentation but generally it is 1% of all site visits\n\n*Opportunities*\nThey wanted to look at the examples of different type of opportunities and we shared with them the drop off analysis and Form Navigation.\nThe Form Navigation Opportunities made total sense to them while it was mentioned that suggestions for the drop off hypothesis has to be proven by an experiment.\n\n*Business KPIs*\nThe team shared the details of the KPIs they currently monitor via an agency which includes navigations within the site pages, field drop offs, conversion rate.\nThey are also interested in time taken to fill a form which they are not able to measure currently\n\n*Integration during development cycle*\nAs they are in the process of modernizing their forms, they wanted to identify certain opportunities before going live as well. They wanted to understand if the tooling can integrate during the development phase (figma designs etc) as they have a huge development process (business justification, processes etc) if something needs to be changed on prod.\n\nWe mentioned that we would be creating a knowledge base once we have proven hypothesis and use that to suggest best practices or common pitfalls during the design phase as well.\n\n*Next Steps*\nThe team liked the idea and wanted to try it out on their environment. We need to enable the FT on their environment. They are also in talks to get a trial version of Sites Optimizer.\n:todo_done: *",
    "created_at": "2026-01-30T06:22:00.217Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752601935.879449"
  },
  {
    "id": "eb7a5a85-1859-47f4-8ef8-fa21b2b156c3",
    "source": "slack",
    "text": "*\nWe had a connect with 4Point for customer Carpenter to identify the issues they are facing with their could environment.\n• The environments were provisioned around April, and their pipeline is failing since.\n• They have created the pipeline for dev environment - but seems the repo is corrupt/empty - they may have tried to make changes to it.\nEnvironment: <https://aemcs-workspace.adobe.com/customer/program/154535>\nPipeline executions (14th/15th July) - after initial environment creation failed with the error:\n```Executing command mvn --batch-mode org.apache.maven.plugins:maven-dependency-plugin:3.1.2:resolve-plugins\n18:16:58,565 [main] [INFO] Scanning for projects...\n18:16:58,786 [main] [ERROR] [ERROR] Some problems were encountered while processing the POMs:\n[ERROR] Child module /build_root/build/carpentercompanyforms-p154535-uk18879/core of /build_root/build/carpentercompanyforms-p154535-uk18879/pom.xml does not exist @ \n[ERROR] Child module /build_root/build/carpentercompanyforms-p154535-uk18879/ui.apps.structure of /build_root/build/carpentercompanyforms-p154535-uk18879/pom.xml does not exist @ \n[ERROR] Child module /build_root/build/carpentercompanyforms-p154535-uk18879/ui.config of /build_root/build/carpentercompanyforms-p154535-uk18879/pom.xml does not exist @ \n[ERROR] Child module /build_root/build/carpentercompanyforms-p154535-uk18879/ui.content of /build_root/build/carpentercompanyforms-p154535-uk18879/pom.xml does not exist @ \n[ERROR] Child module /build_root/build/carpentercompanyforms-p154535-uk18879/it.tests of /build_root/build/carpentercompanyforms-p154535-uk18879/pom.xml does not exist @ \n[ERROR] Child module /build_root/build/carpentercompanyforms-p154535-uk18879/dispatcher of /build_root/build/carpentercompanyforms-p154535-uk18879/pom.xml does not exist @ ```\nwhich suggests some corruption/mis-configuration in the Repo/Pipeline.\n\nWe shared the documentation around the same.\n• <https://experienceleague.adobe.com/en/docs/experience-manager-cloud-service/content/onboarding/journey/overview>\n• <https://experienceleague.adobe.com/en/docs/experience-manager-cloud-service/content/onboarding/journey/developers>\n:todo_done: *",
    "created_at": "2026-01-30T06:21:58.708Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752635902.692879"
  },
  {
    "id": "9333e66e-d05d-46d5-bc20-9cbc6e8ab3eb",
    "source": "slack",
    "text": "*\n*Meeting Summary* – NFCU Requirements Review\n\nNFCU has shared an Excel sheet outlining their requirements and identifying gaps in the current Interactive Communication (IC) Editor. The we have reviewed the document and sought clarification on the following use cases:\n1.  *Data Mapping*\n    ◦ *Requirement*: Support for data binding using a JSON data model and XSD schema during communication document creation.\n    ◦ *Discussion Summary*: NFCU clarified that they require support for JSON schema only.\n    ◦ *Recommendation*: It was suggested to utilize FDM (Form Data Model) which is a JSON schema, without connecting to an external data source. NFCU can manually create entities within FDM, which should address their use case effectively.\n2. *Batch PDF Generation in Background*\n    ◦ *Requirement*: Generate PDFs in batch/background by authoring IC with a schema and merging data using XML.\n    ◦ *Discussion Summary*: NFCU confirmed that they intend to use JSON as the data format, not XML.\n3. *Content Generation and Formatting Rules*\n    ◦ *Requirement*: Use of a rule editor to apply conditional content rendering (e.g., `if` conditions).\n    ◦ *Discussion Summary*: The rule editor is currently functional on NFCU’s end. They plan to explore it further.\n4. *Render API Integration*\n    ◦ *Requirement*: NFCU has requested guidance on using the Render API as an interface from their servlet.\n    ◦ *Action Item*: Provide documentation for the IC APIs, including usage instructions for the Render API.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:57.196Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752641688.566379"
  },
  {
    "id": "dde5e70e-72bf-4980-923b-6d82a61c3c9e",
    "source": "slack",
    "text": "*\nIn last night meeting with NFCU, they highlighted 2 requirements which are critical for their upcoming golive plans in Oct\n1. Support of IC rendering API to take data.json as input, they want similar experience that of Output API. Their upstream function doesnt allow any API to fetch data due to security concerns, rather they provide they payload of json data which they want to provide to IC rendering API.\n2. Manual letter usecase: where few of the data would be fetched from the system, but few data would be inserted manually and then invoke a workflow. This is exactly Associate UI usecase, where we showcased existing 6.5 documentation and they agreed.\nThey had shared a big list of features, which we asked should be prioritised based on the Journey thats going live, to which Shubham and team from NFCU acknowledge and would provide a list in the timeline order, though all of them are required.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:55.687Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752741694.640899"
  },
  {
    "id": "b2930313-93b4-4601-a9d8-a0d52450f720",
    "source": "slack",
    "text": "*\n• *PDF Conversion and Sync Code:* Mayank and Andy discussed the recent fixes and updates related to PDF conversion, including the need to keep the browser open during the process. Mayank mentioned that the async code for long PDFs has been pushed, and Andy acknowledged the update.\n• *Extra Sign Field Fix:* Mayank informed Andy that the fix for the extra sign field has been deployed and prioritised for their program. Andy confirmed understanding and discussed the need for a code reversion in Dev to test the fix.\n• *Radio Buttons and Bindings:* Mayank recommended a workaround for issues with radio buttons and their data bindings. Andy acknowledged the recommendation and mentioned that they have already pulled the code for review.\n• *Forms Versioning and Audit Logs:* Michelle inquired about new features for managing forms from a versioning and restoration perspective. Mayank shared documentation on versioning and audit logs, and Andy requested similar features for PDFs and XDPS.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:54.177Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752818519.768909"
  },
  {
    "id": "4642b17b-48cb-4c11-9b3d-d2420cb441ef",
    "source": "slack",
    "text": "*\nIssues of SOP with latest private release were discussed.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:52.667Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1752823507.804559"
  },
  {
    "id": "20fc0800-62ea-4afa-b7b1-171def945a5b",
    "source": "slack",
    "text": "*\n*Usecase:* On-demand creation of company related presentation by internal and external users\n*Volumes:* ~100/month (Tom said it might be more, he will confirm later)\n*Current solution:* MS Office, SharePoint, SFDC marketing cloud storage and user journeys, Siesmic (3rd party tool) for data merge in PPT (<https://www.seismic.com/blog/introducing-seismic-for-powerpoint/>)\n*Languages:* 4 (English, Simplified Chinese, Japanese, Korean)\n*Use-case flow:* \n1. Author\n    a. Create a PPT with static content including text, graphs, images and dynamic placeholders for currency symbols, region and associated data elements like total AUM for a region. \n    b. Create an excel with currency symbols and associated data.\n    c. Enter Siesmic data placeholders using their Powerpoint plugin.\n    d. SFDC user journeys are setup in parallel to trigger PPT generation using Siesmic using input params.\n2. End user: \n    a. There is a form with first name, last name, email and a section to select what all info to include in the final document e.g. about the company, performance in specific regions, currency etc.\n    b. User selects what all to include in the final presentation and their name/email.\n    c. Internal users complete form filling on a SharePoint site and do not have to enter email id - the final presentation is displayed to them within the browser. \n    d. External users complete on a web site and have to provide email id to receive the link of document.\n    e. For requesting non-english versions, they generate the EN version and then go to separate links on main page to download the language specific version which is based on EN content.\n    f. On submitting the EN request, the data is sent to SFDC storage with fist name, last name, email and link of the generated document.\n    g. A user journey is triggered in SFDC to call Siesmic to generate the merged and assembled document PPT.\n    h. Customer was not sure whether PPT was stored by Siesmic or generated on the fly using data in URL. We have observed document can be generated by clicking the link in email received by external users even after sometime.\n    i. The final output is PPT - generated dynamically and data merged into placeholders in the original PPT template.\nCustomer is decommissioning SFDC marketing cloud and want to reimagine this journey as they begin adopting AJO. They mentioned that final PPT generation may be crucial for internal teams as they may use few slides from it during customer discussions but are open to other approaches like PDFs if those slides can be extracted. They asked us to send proposal of what's possible closest match even if use-case cannot be completely retained as-is.\n\nNo requirement to password protect PDF for final output as it is PPT.\n\nOther use-cases for Forms can be explored once this solution is in place.\n\nThey have AEM Sites CS so marketing SKU can also be pitched for external user data capture in addition to core Communications SKU.\n\n<@W4RSW3ECC>, <@W9QMZFR39>, <@W4R5LUPK3>, <@W4RU4N66R> Need thoughts on the final proposal to support authoring in PPT, data merge, disassembly, dynamic assembly and final PPT generation.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:51.159Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753077095.280959"
  },
  {
    "id": "804bd256-51b2-43db-8fe8-db7d8faf090f",
    "source": "slack",
    "text": "*\n1. The customer has not started creating forms yet; they were attempting to enable the Forms Core Component on their development environment.\n2. Their pipeline was failing because they had removed most of the content from the `artifact` project.\n3.  We reverted the corrupt commit and re-ran the pipeline — forms are now enabled on their dev environment.\n4. The customer is also trying to start a local SDK instance, but AEM is not launching for some reason. We recommended using the latest SDK jar, which is working on our local setup.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:49.651Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753167461.480999"
  },
  {
    "id": "cb56f39d-60c2-4c3c-9d37-7357b6f2831e",
    "source": "slack",
    "text": "*\n*Meeting notes (AI generated)*\n\n*Custom File Attachment Component Demo*: Shivam and Pankaj demonstrated the custom file attachment component, explaining its functionality and how it uploads files directly to Amazon S3. They showed the codebase and the process of uploading files, validating them, and saving the URLs in the submission data, also explained how would it work with customization.\n\n*Save and Draft Functionality*: Christopher shared his screen to discuss questions about the save and draft functionality. He demonstrated the process of saving a form and rendering drafts, and Pankaj confirmed the correct paths and data references.\n\n*Draft Prefill Service:* Pankaj explained the draft prefill service, which checks for drafts and retrieves data from the unified storage connector to render the form with the saved data.\n\nPankaj offered to review the customization code once Christopher is done with the updates. Christopher agreed and mentioned that he would share the code for review if needed.\n\ncc: <@W4R5LUPK3> <@W4XTCQ07J>\n:todo_done: *",
    "created_at": "2026-01-30T06:21:48.142Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753186886.780639"
  },
  {
    "id": "7383f2b4-8fcf-45b5-890a-0babedbf0440",
    "source": "slack",
    "text": "*\n*Introduction to Adobe Forms Team and Demo Agenda:* Deep introduced themselves as an engineer in the Adobe Forms team and outlined the agenda for the demo, which included understanding the authoring of forms using Clark County forms and demonstrating the authoring experience with generative AI features.\n\n*Demonstration of Forms Editor Interface:* Deep demonstrated the forms editor interface, explaining the content tree, properties, and forms experience builder tabs. They showed how to use the generative AI features to author a form using a screenshot of a Clark County form.\n\n*Generating Form Using Generative AI:* Deep demonstrated how to generate a form using a screenshot and the generative AI features. They explained the limitations, such as the need to manually add images and adjust the layout, but highlighted the ease of generating the majority of the form components.\n\n*Dynamic Behaviour and Rule Editor:* Deep explained the concept of repeatable panels and demonstrated how to dynamically add or remove fields using the rule editor. They showed how to delete components and make a panel repeatable, allowing users to add or remove instances of a panel as needed.\n\n*API Integration for Dynamic Form Fields:* Deep demonstrated how to integrate an API to dynamically fill form fields based on user input. He explained the  ability to set required fields, minimum and maximum values, patterns, and custom error messages, as well as the default error messages provided by the system.\n\n*Multi-Step Forms and Wizard Layout:* Deep and Vijay Kumar discussed the concept of multi-step forms using the wizard layout. They demonstrated how to convert a panel to a wizard layout, allowing users to fill out form fields in a step-by-step manner.\n\n*Styling and Custom Components:* Talmiz demonstrated how to change the styling of forms and create custom components. They showed how to use the AEM CLI tool to create a custom component based on an out-of-the-box component and how to manipulate the DOM structure and add custom JavaScript and CSS.\n.\n*Deployment and Testing of Changes:* Talmiz and Vijay Kumar explained the process of deploying and testing changes. They recommended creating a branch for new features, testing the changes using the Universal Editor, and then merging the branch to the main branch for deployment. They also highlighted the importance of ensuring no impact on live forms during deployment.\n.\n*Future Plans and VIP Programme:* Vijay Kumar discussed the future plans for migrating PDF forms to EDS forms and the possibility of participating in the VIP programme. Michael expressed interest in gradually migrating forms and empowering departments to create and manage their own forms.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:46.632Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753244811.341089"
  },
  {
    "id": "032c0c41-dc05-4216-9168-3ead9ea6b8cd",
    "source": "slack",
    "text": "*\n• *Double sign field issue* - Andy tested and said the issue of double sign field is not coming now. Adobe team to verify if the fix is done in the stage environment as well.\n• *BindRefs for table fields -* Andy tested this as well and this also is fixed after the changes in the VSTS repo in adobe/develop branch.\n• *JSON Data Binding -* Adobe team will ask relevant team internally and get back to LPL.\n• *End-2-End form conversion testing -* \n    ◦ *Action item -* Andy and Naveen to test on other forms end to end if the AI conversion is running fine or not and the filled pdf in test harness is having the filled data or not. Expectation is for most of the fields the \"bindrefs\" and \"enums\" will be set fine and for a few there have to be some changes manually.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:45.124Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753263610.334209"
  },
  {
    "id": "8e5e84ad-c89a-4f3b-92a1-fc12281d3e3e",
    "source": "slack",
    "text": "*\nWe are currently in discussion with the customer _*Medtronics*_, who is looking to integrate *AEM with Workday*.\nWe had recommended using *custom authentication* for this purpose. After implementing the custom authentication and providing the required details, the customer was successfully able to connect to Workday.\nRecently, we received a query via email from the customer regarding support needed during *form authoring*.\n\n*Use Case:*\nThey would like to implement an *autocomplete textbox* that fetches data from the *Form Data Model (FDM)* by invoking a service using the *Rule Editor*, triggered on *keypress*.\nCurrently, the customer is using *foundation components* for form creation. We have suggested switching to *core components* for greater flexibility.\nAs also recommended by <@W4R5M9P4H> and <@U02DW7JLT62>, this use case can be achieved using a *custom component*.\n\nWith a custom component, we can *trigger a change event on keypress*, and then create a rule on that change event to *invoke the service*.\nA similar implementation has already been done for *HDFC*.\n\nAdding <@W4XTCQ07J> to help us unblock the customer for form authoring.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:43.618Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753268464.031949"
  },
  {
    "id": "6be41f3d-ae84-4176-bb16-f2792800e4eb",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Arun, Ben McKnight, Vijay Kumar, Andy, and Sarah discussed the discovery work on the platform team, focusing on the requirements for Marketo form components shared across all brands. The meeting aimed to review the findings and confirm the requirements with Sarah's team. \n• *Marketo Form Requirements:* Ben McKnight presented the high-level requirements for the Marketo form component, which includes ease of use, custom scripts for analytics, collecting location data, configurable form names, and campaign tracking. The document covers all EBG and Marine forms. \n• *Form Customisation and API Integration:* Vijay Kumar and Andy discussed the static values in the forms and the potential need for API integration for dynamic data. They also talked about the possibility of introducing custom components for Google Places autocomplete and other dynamic behaviours. \n• *Form Creation Process:* Ben McKnight explained the current process for form creation, which involves the Marketo team building the form and the author adding it to the page. Andy mentioned the recent changes towards more component-based styling and the need for documentation on dynamic setups for country and language. \n• *Project Timeline and Collaboration:* Sarah and Andy discussed the project timeline, aiming for an August go-live date for the European group. Arun suggested setting up a Teams channel for collaboration and weekly meetings to track progress and address any blockers. \n• *Marketo Integration and Access:* Arun and Andy discussed the need for access to Marketo and AEM instances for the team. They also talked about the possibility of using hidden fields to segment data by region and the need for further discussions on Edge delivery services. \n:todo_done: *",
    "created_at": "2026-01-30T06:21:42.110Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753289795.262769"
  },
  {
    "id": "ffd959c5-6097-4e10-86aa-670baac694f0",
    "source": "slack",
    "text": "*\n• *Sites Team Demo:* Presented a demo on Experience Fragment translation.\n• *Forms Team Demo:* Showcased form embedding within site pages and demonstrated language navigation for forms on the site.\n*Customer Use Cases (Forms):*\n• Previewing XDP with data as a PDF (XFA form).\n• Adaptive Forms with the *“Generate Document of Record”* option.\n• Using *Associate Template* in Adaptive Forms, where a *multi-locale template issue* was encountered.\n*Multi-Locale Template Issue:*\n• The customer has a requirement to generate a specific template based on the selected locale at the time of form submission.\n• Currently, this use case is *not supported out of the box (OOB)* in the product.\n• A *custom implementation* was proposed to dynamically select the template based on locale.\n• However, the customer is looking for a *product-level (OOB) solution* to address this requirement.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:40.601Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753338485.392099"
  },
  {
    "id": "abcf7d45-690f-4ee4-8a36-d849f3b20a6d",
    "source": "slack",
    "text": "*\nExisting AEM Forms JEE customer inherited from LiveCycle days, on-prem, ~178K product + 80K paid support renewal upcoming. Field team targeting as-is renewal for now.\n\nCustomer is exploring to implement a new use-case (details below) in JEE by deploying a new server and looking for our guidance for the same.\n\nMy understanding is they should do following to reduce complexity:\n1. End user to open XFA PDF, enter data and submit to JEE workflow exposed over REST. Add a field in form data to send email confirmation.\n2. In workflow, extract data using process form submission, add a unique identifier, submit XML data to Oracle DB, store PDF with data into Documentum and send confirmation email for successful processing else log error.\nIn my mind, they don't need to submit to email endpoint, then monitor via IBM MQ and send to AEM server to achieve their use-case.\n\nRequesting JEE experts to confirm. Need to revert to customer by Tue 07/29.\n\nMeeting recording: <https://teams.microsoft.com/l/meetingrecap?driveId=b%21CtcLxeV1REG58cDoQgQrbdtap5Dhs9pBr6uC3_2FeyLqlgY_n1S7TpknV52fuUYs&amp;driveItemId=01GJG53GJUW77K6WY6KBCJR7ARG5XE5FHL&amp;sitePath=https%3A%2F%2Fadobe-my.sharepoint.com%2F%3Av%3A%2Fp%2Fmasmal%2FETS3_q9bHlBEmPwRN25OlOsB3mDAwTgFZOi4tWbRckV_mg&amp;fileUrl=https%3A%2F%2Fadobe-my.sharepoint.com%2F%3Av%3A%2Fp%2Fmasmal%2FETS3_q9bHlBEmPwRN25OlOsB3mDAwTgFZOi4tWbRckV_mg&amp;iCalUid=040000008200E00074C5B7101A82E00800000000FADAD7D66CF5DB01000000000000000010000000D312109A76880D4590439E6BCBA450B2&amp;threadId=19%3Ameeting_ZjYzMjVjZjAtNjg2Yi00MWFlLWFlYzAtYTg3YmIwNTJiMzc1%40thread.v2&amp;organizerId=7c1a8d2d-7d21-481e-94ff-ba71d8a1a6d2&amp;tenantId=fa7b1b5a-7b34-4387-94ae-d2c178decee1&amp;callId=2ce5c01b-c47d-40fe-968c-26411bb9fbc9&amp;threadType=Meeting&amp;meetingType=Scheduled&amp;subType=RecapSharingLink_RecapChiclet|Recap: SAPS Incident Shooting Use Case Discusison 23 July | Meeting | Microsoft Teams>\n==================================================\nUse Case: End-to-End Submission Workflow in Adobe Workbench 6.5\n1. Overview\nThis document outlines a workflow built in Adobe Workbench 6.5, connected to AEM Forms JEE server, for managing PDF submissions, XML processing, ECM storage, and IBM MQ integration. The workflow leverages:\n- Dynamic XFA PDF templates\n- XSD-based XML validation\n- Documentum for ECM\n- IBM MQ for inter-system communication\n- Email (SMTP/POP3/IMAP) for notifications\n2. Actors &amp; Systems\n- Submitter: User sending a form via email.\n- AEM Forms Server (Workbench 6.5): Core process orchestration.\n- IBM MQ: Transmits base64-encoded PDFs.\n- Documentum ECM: Stores final PDFs.\n- Email Server: Receives input and sends acknowledgments.\n3. Input Artifacts\n- XFA PDF (dynamic template)\n- XML schema (XSD)\n- Email with attached PDF (user submission)\n- IBM MQ message (base64-encoded PDF)\n- Submitter’s email address\n4. Workflow Steps\nStep 1: New Application and Process Initialization\nA new AEM Forms application is created in Adobe Workbench. Process template includes: Email configurations, Java services for MQ and ECM, Signature processing (optional).\nStep 2: Receive Email &amp; Extract PDF Attachment\nUse email server configuration to receive PDFs extracted from emails.\nStep 3: IBM Picks Up the PDF\nIBM MQ reads from the Email server, pick up the PDF XML data.\nStep 4: Extract XML from PDF &amp; Convert to Base64\nExtract XML from PDF, (validate against XSD), and generates (UID) send base64-encoded string via MQ to Adobe server.\nStep 5: Adobe Receives Base64 via MQ (Java Service)\nReceives MQ message base64 with embedded UID.\nStep 6: Convert Base64 to PDF Document\nDecode base64 and create a Document variable (To store to Documentum).\nStep 7: Export Form Data (XML)\nExtract form data as XML and validate against XSD.\nStep 8: Embed Digital Signature into XML (Optional/TBC)\nEmbed digital signature using XMLDSIG (if required).\nStep 9: Generate GUID and Inject into XML\nGenerate UUID and inject into XML.\nStep 10: Inject Submitter Email Address\nInject user’s email into XML for tracking and Acknowledgment email.\nStep 11: Store PDF in Documentum (ECM)\nStore PDF via SendDocToDocumentum component and return ECM UID.\nStep 12: Send Acknowledgment or Failure Email\nNotify user of success or failure with UID/logs.\nStep 13: Log the Submission\nLog metadata in DB, file, or XML store.\nStep 14: End Process\nCleanup and terminate process.\n\n5. Technical Notes\nEmail server Configuration\nIBM Monitor directory for `.pdf` files.\nIBM MQ Integration\nCustom Java component using JMS API. Handles queue read/write with secure credentials.\nDocumentum Integration\nUses AEM Forms Documentum connector or Web Service.\nEmail Configuration\nSMTP for outgoing, IMAP/POP3 for incoming (optional).\nXML Validation\nImport XSD into Workbench. Use Validate XML service activity.\n\n6. Attachments &amp; Dependencies\nResource                                                                   Type                                         Required\nform-template.xdp                                             XFA PDF                                      :white_check_mark:\nschema-definition.xsd                                      XSD Schema                         :white_check_mark:\nmq-config.properties                                        Config                                       :white_check_mark:\nSendDocToDocumentum                               AEM Add-on                         :white_check_mark:\nemail-template.html                                          HTML                                   Optional\n7. Success Criteria\n- Email received and processed.\n- PDF successfully extracted and converted.\n- XML validated and signed (if required).\n- Data stored in Documentum with confirmation.\n- User receives email acknowledgment.\nCurrent server spec\nOS Name:                        Microsoft Windows Server 2022 Standard\nOS Version:                    10.0.20348 N/A Build 20348\nOS Manufacturer:          Microsoft Corporation\nOS Configuration:         Member Server\nOS Build Type:                Multiprocessor Free\nSystem Manufacturer: VMware, Inc.\nSystem Model:                VMware7,1\nSystem Type:                  x64-based PC\nProcessor(s):                 2 Processor(s) Installed.\nBIOS Version:                 VMware, Inc. VMW71.00V.18227214.B64.2106252220, 2021/06/25\nTotal Physical Memory: 32 767 MB\nVirtual Memory: Max Size: 37 631 MB\nHotfix(s):                4 Hotfix(s) Installed.\n*Type/name of database that will be used: View, Update, Retrieve, etc…?*\nORACLE\n\n*Expected number of submissions for the shooting reports?*\nWeekly: UNKNOWN, but shouldn’t be a high number\nMonthly: UNKNOWN, but shouldn’t be a high number\nYearly: UNKNOWN, but shouldn’t be a high number\n:todo_done: *",
    "created_at": "2026-01-30T06:21:39.091Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753341197.855709"
  },
  {
    "id": "ed2afa6b-8cd8-44e6-a691-c50de3d5de3b",
    "source": "slack",
    "text": "*\n*Below is the meeting summary:*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n• Currently using Smart Com to generate print-ready PDFs.\n• Possesses a large set of Smartform templates and seeks to migrate to IC Templates.\n<@W5HEU5M7Y> shared the previous engagement summary and set the context and also helped in access their environment. Customer reiterated their requirements -\n*Major Requirements:*\n1. *System/global variables for custom data binding:* We need to explore.\n2. *Reusable Components:* Requesting support for reusable components.\n3. *Data Fetching from AEP:* Need support for fetching data from AEP at runtime. Detailed discussion required.\n4. *Communication Channels:* Email communication using AEP/AJO and print communication using AEM Forms. Detailed discussion required.\n5. *Bulk PDF generation:* We need to explore.\n6. *Locale Support:* Need to support localization in IC Editor.\n7. *Versioning Support:* Require versioning capabilities.\n8. *Migration Required*\n    a. *Template Migration:* Migration from Smartform templates to IC templates.\n*Demonstration:*\n<@WE163TH43> conducted a comprehensive demonstration of the Interactive Communication (IC) Editor, showcasing the following capabilities:\n• Template Creation Workflow\n    ◦ Illustrated the end-to-end process of creating templates.\n• *Data Source Integration*\n    ◦ Demonstrated how to create custom data sources and integrate them with FDM, including FDM’s ability to generate entity models and sample test data for preview purposes.\n• *Fragment and Document Creation*\n    ◦ Showcased the workflow for creating and managing fragments and documents.\n• *IC Editor Features*\n    ◦ Highlighted the editor’s capabilities, including:\n        ▪︎ *Data Binding*: Using FDM data schema.\n        ▪︎ *Fragment Support*: Overview of available fragments and their use cases.\n        ▪︎ *Rule Editor*: Demonstrated rule creation and it's impact.\n        ▪︎ *Font Support*: Displayed available fonts and discussed custom font integration.\n        ▪︎ *PDF Preview*: Showcased preview functionality using FDM sample test data.\nCC: <@W4R5LUPK3> <@WQWCBV6NN> <@W9QMZFR39>\n:todo_done: *",
    "created_at": "2026-01-30T06:21:37.583Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753341462.752029"
  },
  {
    "id": "2e9a2c6b-866e-407b-8a50-229c7a00c4c4",
    "source": "slack",
    "text": "*\nMeeting Summary: Key Issues Raised by NFCU and Our Responses\n\nBelow is a summary of the key concerns raised by NFCU during the meeting, along with our corresponding responses:\n*1. FDM JSON Format Issue*\n    ◦ *Issue*: FDM is not generating sample data due to discrepancies in the JSON format.\n    ◦ *Response*: Vijay suggested initiating the process with a simplified Swagger JSON to manually construct the required structure.\n*2. Template Selection &amp; Page Preset*\n    ◦ *Issue*: Unclear behavior observed in template and page preset configurations.\n    ◦ *Response*: Vijay confirmed that the relevant changes are currently under PR review. These updates will enable paper size selection after template creation.\n*3. Font Rendering in PDF Preview*\n    ◦ *Issue*: Fonts are not rendering as expected and are defaulting to fallback fonts.\n    ◦ *Response*: Vijay clarified that fonts must be available on the server. If a font is missing, the system defaults to a fallback font.\n*4. Custom Font Upload*\n    ◦ *Issue*: Requirement to upload custom fonts to the server.\n    ◦ *Response*: Prateek confirmed that this is feasible via the AEM workflow and offered to share the relevant Adobe documentation.\n*5. Content Overflow Limitation*\n    ◦ *Issue*: Text content is being truncated within text boxes.\n    ◦ *Response*: Vijay explained that only element-level overflow is currently supported; content overflow functionality is not yet implemented.\n*6. Template vs. IC Editor Restrictions*\n    ◦ *Issue*: The IC Editor permits layout and font changes that are restricted by templates.\n    ◦ *Response*: Vijay acknowledged the inconsistency and confirmed that efforts are underway to align IC Editor behavior with template constraints.\n*7. Pagination &amp; Master Page Settings*\n    ◦ *Issue*: Need to validate pagination across multiple pages.\n    ◦ *Response*: Vijay and the NFCU team jointly tested and confirmed that pagination is functioning correctly. These settings are applied through the master page configuration.\n*8. Subform &amp; Content Area Deletion*\n    ◦ *Issue*: Inability to delete subforms and content areas.\n    ◦ *Response*: Vijay acknowledged the issue and committed to investigating further.\n*9. Documentation for IC Editor*\n    ◦ *Issue*: Absence of official documentation for the IC Editor.\n    ◦ *Response*: Vijay mentioned that Adobe is actively working on the documentation, though no ETA.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:36.072Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753422104.162069"
  },
  {
    "id": "398fcba1-7463-45aa-95ac-d2ccaa26391e",
    "source": "slack",
    "text": "*\n• The customer has started creating forms based on Core Components.\n•  They were facing issues with local development.\n•  This team is new to Forms and requires our guidance on best practices and next steps. Walking them through the process as simply as possible will go a long way.\n•  We were able to resolve the template and submission issues using the customer’s repository.\nFeedback we got from Adobe internals :\n```THANK YOU team for helping us get this turned around quickly!!! these are critical moments with customers in terms of their experience with Adobe :heart:```\n:todo_done: *",
    "created_at": "2026-01-30T06:21:34.562Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753440017.033979"
  },
  {
    "id": "fb83ea14-82e1-4eeb-b48b-36188973cbb2",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\n\nMeeting notes:\n• *Introduction to AI Innovations in AM Forms:* Jochen and Anurag introduced the session on AI innovations in AM forms, highlighting the involvement of the product management team and the focus on generative AI, multimodal capabilities, and forms optimisation.\n    ◦ *Session Introduction:* Jochen initiated the session by mentioning the recording disclaimer and encouraging participants to turn on their cameras. He introduced the purpose of the meeting, which was to delve deeper into AI innovations in AM forms, a conversation that started two weeks ago. He highlighted the presence of the product management team and handed over to Anurag to lead the session.\n    ◦ *Team Introduction:* Anurag introduced himself and his colleagues: Vijay, the lead engineering manager for generative AI, Chris, the product manager for other AI aspects, and Satyadeep Maheshwari, the principal engineer for AI-related initiatives. He outlined the session's agenda, which included demos on generative AI for authoring interfaces, multimodal capabilities, and forms optimisation.\n• *Generative AI for Authoring Interfaces:* Anurag demonstrated how generative AI can be used to create forms quickly using screenshots, photos, or simple scribbles, showcasing the ability to detect fields and apply brand templates.\n    ◦ *Form Creation:* Anurag demonstrated the use of generative AI to create forms from various inputs such as screenshots, photos, or scribbles. He showed how a business user could quickly brainstorm and create a form by uploading a photo or screenshot to the generative AI assistant, which then detects fields and generates a form.\n    ◦ *Brand Templates:* Anurag explained that the generative AI assistant allows users to apply brand-specific templates and styles to the generated forms, ensuring consistency with the brand's design guidelines.\n    ◦ *Authoring Assistant:* Anurag showcased another demo where the authoring assistant suggests fields for a form based on a simple command, such as \"create a form with personal information panel.\" The assistant automatically adds the suggested fields to the form, which can then be customized further.\n• *Multimodal Form Filling:* Anurag explained the multimodal capabilities introduced for form filling, including chat-based interactions and document uploads, which enhance the user experience and improve conversion rates.\n    ◦ *Chat-Based Interaction:* Anurag demonstrated how users can interact with forms through a chat-based interface embedded within the form. This chat experience allows users to fill out forms conversationally, making the process more intuitive and user-friendly.\n    ◦ *Document Uploads:* Anurag showed how users can upload identification documents, and the system extracts relevant information to prefill the form fields. This reduces the manual effort required to fill out forms and improves accuracy.\n    ◦ *Field Types:* Anurag highlighted that the chat-based interface supports various field types, including dropdowns, multiple select options, and yes/no questions, making it versatile for different form requirements.\n• *Click to Fill Modality:* Anurag showcased the Click to Fill modality, which allows users to indicate damage on a car image or other visual elements, making form filling more intuitive and reducing errors.\n    ◦ *Damage Indication:* Anurag demonstrated the Click to Fill modality using a car insurance claim form. Users can click on parts of a car image to indicate where the damage occurred and select the damage intensity, which automatically fills the corresponding fields in the form.\n    ◦ *Use Cases:* Anurag mentioned that this modality is useful in various industries, such as dental and aerospace, where users need to indicate specific areas of concern visually. This approach reduces errors and makes the form-filling process more intuitive.\n• *Forms Optimisation:* Anurag discussed the AM sites optimiser product, which identifies opportunities to improve form interfaces, such as reducing the number of fields or improving discoverability, to enhance conversion rates.\n    ◦ *Optimisation Opportunities:* Anurag explained that the AM sites optimiser product analyses forms to identify areas for improvement, such as reducing the number of fields or changing the layout to a progressive disclosure format. These optimisations aim to enhance user experience and increase conversion rates.\n    ◦ *Insight and Suggestions:* Anurag highlighted that the optimiser provides insights and suggestions based on the analysis, such as indicating that a form looks complicated and recommending a more user-friendly layout. The optimiser can automatically create variations of the form for testing and comparison.\n• *Integration with Customer's LLM:* Matthias and Vijay discussed the flexibility of integrating the customer's own LLM, such as Gemini DBLLM, with AM forms, considering the data security and governance requirements.\n    ◦ *LLM Integration:* Matthias raised concerns about data security and governance when using LLMs. Vijay explained that Adobe has a standard agreement with Microsoft for using Azure Open AI models, ensuring that customer data is not used for training. He also mentioned the possibility of integrating the customer's own LLM, such as Gemini DBLLM, with AM forms.\n    ◦ *Data Security:* Vijay assured that the integration with Azure Open AI models ensures data security and that customer data is not used for training the models. He also mentioned that customers could use their own LLMs to maintain control over their data.\n• *Data Extraction from Scanned Forms:* Matthias and Vijay explored the possibility of extracting data from scanned forms and unstructured documents, highlighting the use of adaptive forms and the importance of document quality.\n    ◦ *Data Extraction:* Matthias inquired about extracting data from scanned forms and unstructured documents. Vijay explained that the system could extract data from various document types, including handwritten forms, and convert it into a structured format for further processing.\n    ◦ *Document Quality:* Vijay emphasized the importance of document quality for accurate data extraction. He mentioned that the system performs well with clear and well-defined documents but may face challenges with poor-quality scans or complex handwriting.\n• *Technical Integration and Data Security:* Birgit and Vijay discussed the technical aspects of integrating AM forms with the customer's systems, including data encryption, secure storage, and the use of preprocessor and postprocessor hooks.\n    ◦ *Data Encryption:* Birgit inquired about data encryption during integration. Vijay explained that AM forms support data encryption using preprocessor and postprocessor hooks, allowing customers to implement their encryption methods for secure data transfer.\n    ◦ *Secure Storage:* Vijay mentioned that AM forms do not store user-entered data. Instead, the data is processed in memory and passed directly to the customer's storage endpoint, ensuring data security and compliance with regulations.\n• *Sandbox Environment for POC:* Nitesh and Anurag discussed the availability of a sandbox environment for proof of concept (POC) purposes, with the possibility of enabling generative AI capabilities after accepting a beta agreement.\n• *Next Steps and Follow-up:* Jochen summarised the next steps, including sending out the recording, meeting notes, and coordinating another meeting to discuss migration topics, while ensuring the sandbox environment is ready for use.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:33.051Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753692023.404669"
  },
  {
    "id": "13d0b86f-b72e-4661-88c4-2b7ae4f6491a",
    "source": "slack",
    "text": "*\nIt was 1st Kickoff call for VIP but Jet2 decided to move VIP program to Next year Jan.\n\n\nJet2 team shared document during the meeting covering the *expectation and scope of VIP*.\n    ◦ Below is the information shared on the call. The doc itself is a working doc so I’ve included the relevant information below. \n• The *requirements document* for forms and links to the *existing forms*.\n    ◦ Attached/links below – this is an internal document but covers the detail \n• The *Figma/design files* for the forms.\n    ◦ These will follow at a later point \n*VIP Programme Objectives* \n• Demonstrate and validate the value of Edge Delivery Forms with Universal Editor. \n• Development velocity - Demonstrate how fast complex forms can be developed on Edge Delivery. \n• Authoring simplicity / content velocity - Speed of content creation and maintenance.\n• Maintain submission actions: \n• Save to excel or send to inbox \n• GDPR requirements automation\n*Scope of VIP*\n• <https://www.jet2holidays.com/contact-us/help-at-home> (First three forms that we want to consolidate into one) \n• <https://www.jet2holidays.com/colleague-discounts/colleague-discount-form>  \n• <https://www.jet2holidays.com/group-holidays/form>  \n• <https://www.jet2holidays.com/weddings/enquiry-form>  \n• <https://www.jet2holidays.com/bid-for-a-break>  \n    ◦ (Currently closed but re-opens each month)\n*Current working assumptions:*\n• Out of the box Form functionality will meet our requirements \n• Improvements to the existing forms will be required\n• Data output to Marketing db, Excel and Email will be the required to be auto-generated \n• How will GDPR requirements work? automation? \n• There are no SEO requirements, only the ability to know if there are changes to forms on pages/ where re-directsare involved\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:31.541Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753692325.536539"
  },
  {
    "id": "68673a60-00fa-4b79-abcb-ab06dec89e8f",
    "source": "slack",
    "text": "*\n*Meeting Summary* - Key Discussion Points:\n1. *Real-Time Data Usage During Authoring:*\n    ◦ NFCU expressed interest in using real-time data during the authoring process.\n    ◦ It was suggested that the Associate UI could be leveraged to fetch real data and enable PDF preview at authoring time.\n2. *Integration with Real FDM Data Source:*\n    ◦ NFCU intends to integrate *FDM with a real data source*.\n    ◦ They requested that the *demo utilize the Render API* with real FDM data.\n3. *PDF Generation for Specific Users:*\n    ◦ NFCU wants to generate PDFs using *specific user data from FDM*.\n4. *YAML 3.0 Compatibility:*\n    ◦ Action Item: Verify if the FDM data source supports *YAML 3.0*.\n*Customer Feedback:*\n• NFCU appreciated the discussion and acknowledged the effort being made to address their queries.\ncc: <@W4R5LUPK3> <@WQWCBV6NN> <@W9QMZFR39>\n:todo_done: *",
    "created_at": "2026-01-30T06:21:30.033Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753850662.655029"
  },
  {
    "id": "f0455681-8280-4485-a3f0-316cb7542c78",
    "source": "slack",
    "text": "*\n• *Feedback* : LPL still needs to try e2e validation of their journey and share the feedback with us\n• *Dark Mode removal* - We have shared that it is not part of default canvas theme but the css is coming from the archetype and if they can remove from the base file it will not honour the system setting dark mode.\n• *JSON support in Output service* : We have shared that the JSON support in output service is in process and will share the ETA soon - <@W9QMZFR39>: to share the ETA on this FPR\n• *Extra sign field issue* - The changes are part of their dev instance but we need to share when the changes will be available on their stage (QA) and also if we can restrict the changes to be pushed into their prod (<@W9QMZFR39> to confirm). We have also shared concern about rolling the changes on our long weekend of 15 Aug and if we can prepone the release - LPL needs to come back on the latest plan\n:todo_done: *",
    "created_at": "2026-01-30T06:21:28.522Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1753857539.257899"
  },
  {
    "id": "7c0a7d67-a5ce-4d3a-84bf-12b45f3455b0",
    "source": "slack",
    "text": "*\n• *Release Update:* Mayank updated the team that the new release is now available in the stage environment, and the older release has been pushed to the production environment to avoid blocking the team. They inquired if there had been any internal discussions regarding the release.\n• *Dark Mode Issue:* Mayank asked if the team had tried removing the dark mode issue, to which Andy responded that they had not yet had a chance to address it but had documented the necessary changes and created a ticket for the next sprint.\n• *Prefix Configuration:* Andy demonstrated an issue with the dark mode where certain themes were not getting prefixed correctly. Arneh requested Andy to show the configuration details, which Andy provided, explaining the standard sling rewrite and prefix transformer factory configuration. Arneh and Andy discussed the valid paths configuration and the possibility of using regex to address the issue of paths not being prefixed correctly. They agreed to look into the documentation and share updates in the next meeting.\n• *PDF Conversion Issues:* Andy reported issues with importing large forms and tables into PDFs, noting that neither worked for them. Mayank assured that they would look into the conversion issues and provide updates.\n• *Release Timing:* Naveen confirmed that they could not prepone the release but could do it on August 22nd 8pm US timezone (need to double confirm on Easter / central timezone) .From Adobe side we need to push the release a little before the above time - <@W9QMZFR39> we need support from your side for 23 Aug\n• *Survey Link:* Naveen requested the survey link, which Manu provided in the chat. Mayank also reminded Naveen to complete the survey for the GenAI services enablement\n:todo_done: *",
    "created_at": "2026-01-30T06:21:27.012Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754028878.889569"
  },
  {
    "id": "2370b662-8a8b-41e5-a122-466d83586075",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Introduction and Meeting Purpose:* Steven started the meeting by acknowledging Tim's absence due to PTO and emphasized the goal of understanding the difficulties Altech is facing with developing forms.\n• *Source Code Access:* Sudhanshu confirmed that they have access to the source code and have started reviewing it, but it will take some time for a detailed analysis.\n• *Issues and Frustrations:* Wayland expressed frustrations about the limitations and conflicts in the functionality of the product, highlighting immediate blockers and the need for custom development.\n    ◦ *Functionality Limitations:* Wayland highlighted the limitations and conflicts in the product's functionality, such as issues with saving drafts versus submitting and validation. He mentioned that these limitations are causing significant frustration.\n    ◦ *Immediate Blockers:* Wayland discussed the immediate blockers that are critical to address. He noted that some of these issues have been resolved, while others require development work by AFTIA.\n    ◦ *Custom Development:* Wayland emphasized the need for custom development to address the core functionality issues. He mentioned that the product was initially purchased with the impression that it could handle their requirements, but it often requires custom development or workarounds.\n• *Introductions:* Steven facilitated introductions among the Adobe engineering team, including Sudhanshu, Arun, Mayank, and Syama, and the AFTIA team, including Jessica, Carman, and Jeff.\n    ◦ *Adobe Team:* Steven facilitated introductions among the Adobe engineering team, including Sudhanshu, Arun, Mayank, and Syama. Each member provided a brief overview of their roles and responsibilities.\n    ◦ *AFTIA Team:* Steven also facilitated introductions among the AFTIA team, including Jessica, Carman, and Jeff. Each member introduced themselves and explained their roles in the project.\n• *AFTIA Team's Role:* Jessica introduced herself as the project manager from AFTIA, explaining her role in supporting the team and addressing challenges.\n• *Customizations and Issues:* Carman discussed his involvement in recent customizations and the challenges faced due to his newness to the project.\n• *Immediate Issues and Priorities:* Wayland emphasized the need to understand Adobe's questions and priorities, suggesting a focus on the save as draft and resume issue.\n    ◦ *Understanding Priorities:* Wayland emphasized the need to understand Adobe's questions and priorities. He suggested focusing on the save as draft and resume issue as a critical area to address.\n    ◦ *Engagement Plan:* Wayland discussed the importance of having a clear engagement plan to address the issues effectively. He mentioned the need to work on specific roadblocks in a logical order rather than trying to address the entire list at once.\n• *Save as Draft and Resume Issue:* Arun and Sudhanshu agreed to prioritize the save as draft and resume issue, with Sudhanshu mentioning ongoing investigations and potential out-of-the-box solutions.\n    ◦ *Prioritizing Issue:* Arun and Sudhanshu agreed to prioritize the save as draft and resume issue. Sudhanshu mentioned that they have started investigating the issue and are looking into potential out-of-the-box solutions.\n    ◦ *Technical Investigation:* Sudhanshu explained that the team is investigating the save as draft issue, including the inability to save without all validations being run. He mentioned that they believe they can provide a solution out-of-the-box.\n• *Task Portal and Workflow:* Wayland explained the process of technicians using the AEM inbox as the task portal, the creation of tasks, and the need for validation at different stages.\n    ◦ *Task Portal:* Wayland explained that technicians use the AEM inbox as the task portal. He described the process of creating tasks and the importance of having a clear and accessible task list for technicians.\n    ◦ *Validation Stages:* Wayland discussed the need for validation at different stages, including initial validation when entering the service request number and final validation before submitting the form. He emphasized the importance of having these validations to ensure data accuracy and completeness.\n    ◦ *Form Interaction:* Wayland detailed how technicians interact with the forms, including the ability to save drafts, resume work, and submit completed forms. He highlighted the need for the system to support these interactions seamlessly.\n• *Validation Requirements:* Wayland and Carman clarified the need for different types of validations (save, submit, and both) and the importance of not creating multiple submit counts.\n    ◦ *Validation Types:* Wayland and Carman clarified the need for different types of validations: save, submit, and both. They explained that certain fields need to be validated at different stages to ensure data integrity.\n    ◦ *Submit Counts:* Wayland emphasized the importance of not creating multiple submit counts for a single form. He explained that the final submit should be the only action that counts against their licensing to avoid unnecessary costs.\n• *Customization and Workflow:* Carman explained the current customization involving the save as draft functionality and the triggering of workflows, highlighting the need for improvements.\n    ◦ *Save as Draft:* Carman explained the current customization involving the save as draft functionality. He mentioned that they step in before the existing code for validations is called, depending on whether it is a draft or a submit action.\n    ◦ *Workflow Trigger:* Carman described the customization that triggers a workflow instance when a form is initially displayed. He noted that this approach is not ideal and needs improvement to avoid creating unnecessary workflow instances.\n• *Next Steps and Test Form:* Arun suggested identifying a test form to work with and documenting the requirements and use cases for further analysis and implementation.\n    ◦ *Test Form:* Arun suggested identifying a test form to work with, which would help in testing the end-to-end process and ensuring that the flow works as expected.\n    ◦ *Documenting Requirements:* Arun emphasized the importance of documenting the requirements and use cases to provide a clear understanding of the implementation needs. This documentation would help in analyzing and addressing the issues effectively.\n• *Implementation Review:* Jessica emphasized the need to scope out the work and understand the level of effort before committing to any changes, ensuring alignment with Wayland's approval.\n    ◦ *Scoping Work:* Jessica emphasized the need to scope out the work and understand the level of effort required before committing to any changes. She highlighted the importance of ensuring that the proposed solutions align with Wayland's approval and the project's overall goals.\n    ◦ *Alignment and Approval:* Jessica stressed the importance of aligning the proposed changes with Wayland's approval. She mentioned that further calls and discussions would be needed to ensure that the solutions meet the project's requirements and do not cause rework.\n• *Demonstration and Documentation:* Wayland agreed to provide a visual demonstration and detailed documentation of the requirements and scenarios to facilitate the review and implementation process.\n• *Conclusion and Next Steps:* Steven concluded the meeting, summarizing the next steps and the need for further discussions to finalize the scope and implementation plan.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:25.501Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754065259.937609"
  },
  {
    "id": "d9e8d760-58bd-4ac7-95bd-5de2e45adad9",
    "source": "slack",
    "text": "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Troubleshooting AEM Bundles:* Katerina, Devendra, and Randy worked together to troubleshoot issues with AEM bundles. Devendra guided Randy through checking and removing specific bundles, and they discussed the need to update the POM XML file.\n• *Core Component Changes:* Devendra explained to Randy that the core component changes were already included in the FAR file, so there was no need to reinstall dependencies. They discussed the importance of deleting certain lines from the POM file.\n• *Cloud Environment Issues:* Randy and Devendra discussed the challenges of running the setup on the cloud environment. Submission is failing on cloud environment so logs need to be checked on cloud setup\n• *Azure Blob Storage Configuration:* Randy and Rahul discussed the configuration of Azure Blob Storage for form submission. Rahul clarified that the storage account name should be used instead of the container name, and Randy updated the configuration accordingly.\n    ◦ *Configuration Clarification:* Rahul clarified that the storage account name should be used instead of the container name for Azure Blob Storage configuration. Randy updated the configuration accordingly.\n    ◦ *Account Name Update:* Randy updated the Azure Blob Storage configuration to use the correct storage account name. He confirmed the changes and proceeded with testing the form submission.\n• *Successful Form Submission:* Randy successfully submitted a form to Azure Blob Storage after updating the configuration. The team reviewed the logs and confirmed that the submission was successful.\n• *Document of Record Setup:* Devendra explained the need for a Docker setup to generate a document of record. Randy agreed to set up Docker locally and requested documentation for the process.\n• *Next Meeting:* Katerina scheduled the next meeting for Wednesday to continue working on the setup and address any remaining issues. The team agreed on the time and expressed their satisfaction with the progress made.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:23.990Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754385899.189189"
  },
  {
    "id": "3ef2c5fd-b3f8-465d-8e28-51146ab9cf40",
    "source": "slack",
    "text": "*\nTeam provided a detailed walkthrough covering the following use-cases:\n• Template management\n• Rest API based FDM creation and data binding\n• IC document creation + customisations (fonts faces, etc.)\nCustomer queried around the following features\n• FDM supported data sources -&gt; Team will share existing documentation for supported data sources as and when required.\n• Template Versioning -&gt; Team will check this and update.\n• Support for custom fonts -&gt; Team will share the documentation around custom fonts in communication APIs as and when required.\n• Batch APIs for rendition -&gt; Customer will be informed that this is in the roadmap.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:22.478Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754464276.787949"
  },
  {
    "id": "ef44a18b-41b5-4ab7-b791-c0217853d062",
    "source": "slack",
    "text": "*\n• Customer acknowledged the timelines shared by Sunny for the requirements.\n• Customer was provided a demo for the pre-filling of the realtime data from FDM while invoking render PDF IC.\n• Team shared the sample Render API request payloads for sample and realtime data pre-filling. Customer was satisfied with this as well.\nCustomer had the following queries:\n• Queries around FDM were resolved and team will provide the relevant documentation references.\n• OSGi APIs for rendition - Team to provide feasibility / timelines around this.\n• Documentation for HTTP APIs - Team will share the early open-api specification around the APIs.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:20.969Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754466338.592969"
  },
  {
    "id": "3602ecf6-e3be-42a6-a2da-774b40a65856",
    "source": "slack",
    "text": "*\n• Workflow issue - Gaurav troubleshooted and found a bug in the CQ code from a recent change and provided a workaround for now to unblock the customer. Also raised the issue with the relevant team. \n• Devendra informed the customer that form submission was failing on the cloud instance due to a misconfiguration of the mail service, and guided them to configure it correctly to resolve the issue.\n• Nimisha helped the customer with the local setup for the DoR Docker and guided them through the installation on Windows.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:19.460Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754560003.959819"
  },
  {
    "id": "8cc7b695-5370-41f7-991e-4bad0345622a",
    "source": "slack",
    "text": "*\n*Meeting Summary*\n\n*Use Case:*\n GMF aims to build templates, documents, and fragments to generate print-ready PDFs using data in XML or JSON format.\n\n*Demonstration:*\n *<@WE163TH43>* delivered a comprehensive walkthrough of the remaining functionalities within the *Interactive Communication (IC) Editor*, covering the following features:\n*IC Editor Capabilities:*\n• *Rule Editor:*\n    ◦ Demonstrated how rules can be created and their impact on document behavior.\n• *PDF Preview:*\n    ◦ Showcased the preview feature using FDM sample test data.\n• *Table Component:*\n    ◦ Explained table functionality and discussed pagination strategies for rendering tables across multiple pages during PDF generation.\n• *Other Components:*\n    ◦ Demonstrated additional components that assist with IC authoring, including barcodes, radio buttons, and subforms.\n• *Pagination (Flowed Layout):*\n    ◦ Explained how the flowed layout works and how authors can assign different master pages to specific design pages.\n• *Positioned Layout:*\n    ◦ Showed how components can be placed precisely in a positioned layout.\n• *Master Page &amp; Design Page Management:*\n    ◦ Walkthrough of creating and managing multiple design pages along with their associated master pages.\n*Customer Questions &amp; Responses:*\n1. *Can we bind an image field using a URL as data?*\n    a. *Response:* Yes, binding using a URL should work.\n2. *How can we populate a table across pages?*\n    a. *Response:* Dynamic tables can be used to render across pages based on data. However, current support for this is limited.\n3. *Is there support for different types of barcodes?*\n    a. *Response:* Barcode support will be added progressively based on customer requirements. <@W5HEU5M7Y> inquired if there are specific barcode needs from the customer.\n4. *Is page number support available?*\n    a. *Response:* Not currently, but it is planned for a future release.\n5. *Can we have full access to the AEM instance?*\n    a. *Response:* <@W9QMZFR39> confirmed that full access will be provided.\nCC: <@W4R5LUPK3> <@WQWCBV6NN> <@W9QMZFR39>\n:todo_done: *",
    "created_at": "2026-01-30T06:21:17.950Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754580459.736259"
  },
  {
    "id": "a980a21d-5312-4869-bf14-bcf14993c893",
    "source": "slack",
    "text": "*\n• The customer has a form with 60 fragments related to the 50 states in the USA.\n•  As they select a state, the corresponding fragments become visible or hidden.\n•  Server-side script execution takes a lot of time, so we have provided support for client-side script execution.\n•  One of the fragment renditions was failing, and we have provided a hotfix for this issue.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:16.443Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1754995276.785649"
  },
  {
    "id": "d2c5122a-eaa9-4f3c-a87d-535fc7ec43ed",
    "source": "slack",
    "text": "*\nGenerated by AI.\nMeeting notes:\n• *Demo Overview:* Sudhanshu outlined the demo plan, which included three parts: translating a page while retaining form data, a code walkthrough of a sample submit action, and a proof of concept for translating XFA templates using Microsoft translation.\n    ◦ *Demo Plan:* Sudhanshu outlined the demo plan, which included three parts: translating a page while retaining form data, a code walkthrough of a sample submit action, and a proof of concept for translating HTTP templates using Microsoft translation. The goal was to showcase the functionality and gather feedback.\n    ◦ *Translation Feature:* The first part of the demo focused on translating a page while retaining the form data. We explained that the form data should not be lost when the user changes the locale, and a sample was created to demonstrate this feature.\n    ◦ *Code Walkthrough:* The second part of the demo involved a code walkthrough of a sample submit action. We mentioned that the custom submit action could be integrated with the existing submit action to call the output service API and get different documents based on the locale.\n    ◦ *HTTP Template Translation:* The third part of the demo was a proof of concept for translating XFA templates using Microsoft translation. We highlighted that there were some formatting issues that needed to be corrected in the designer, and they sought feedback on the value of this feature.\n• *Form Translation Demo:* Devendra demonstrated the form translation feature, showing how a form embedded in a site page can retain data while changing the locale using custom functions and buttons.\n    ◦ *Form Embedding:* We demonstrated how a form embedded in a site page can retain data while changing the locale. The form was translated within the African locale and embedded in a site page using a container.\n    ◦ *Locale Change:* We showed the process of changing the locale using a button on the form page. He entered some values in the form and then changed the locale to African, demonstrating that the data remained intact.\n    ◦ *Custom Functions:* We explained that custom functions were written to add the locale change button. The rest of the form functionality remained the same, and the custom functions ensured that the data was retained during the locale change.\n• *Custom Submit Action:* We explained the custom submit action that generates a PDF in the form's locale, detailing the code structure and the process of selecting the appropriate template based on the locale.\n    ◦ *Custom Submit Action:* We explained the custom submit action that generates a PDF in the form's locale. He detailed the code structure, including the default locale, naming conventions, and the process of selecting the appropriate template based on the locale.\n    ◦ *Template Selection:* We described how the custom submit action identifies the current locale and replaces it with the appropriate locale code. The action then searches for the corresponding template and renders the PDF. If the template is not available, it falls back to the original template.\n    ◦ *Code Integration:* We mentioned that the custom submit action could be integrated with the existing submit action. He provided details on the structure and components required for the integration, including the content.xml file and the submit service name.\n• *Code Walkthrough:* Sakshi provided a detailed code walkthrough of the custom submit action, explaining the structure, naming conventions, and the process of generating a document of record based on the locale.\n    ◦ *Code Structure:* Sakshi provided a detailed code walkthrough of the custom submit action. They explained the structure, including the default locale, naming conventions, and the process of generating a document of record based on the locale.\n    ◦ *Submit Action Service:* Sakshi explained the submit action service, which extends from the REST submit action. He detailed the function for processing the default template and generating the document of record based on the locale.\n    ◦ *Content.xml Configuration:* Sakshi explained the configuration of the content.xml file, which includes the guide component type, submit type, and submit service name. She highlighted the importance of matching the service name with the node configuration.\n    ◦ *Post.jsp Function:* Sakshi described the post.jsp function, which remains the same for all submit actions. It retrieves the relevant submit action service and calls the submit function based on the configuration in the content.xml file.\n• *Locale Selection and PDF Generation:* Lisa and Sudhanshu discussed the process of selecting the appropriate XDP template based on the locale, including the need for custom code to handle different locales and the potential for future improvements in the form manager UI.\n    ◦ *Locale Selection:* Lisa and Sudhanshu discussed the process of selecting the appropriate XDP template based on the locale. Sudhanshu explained that the locale is passed to the server during form submission, and the relevant XDP template is selected based on the locale.\n    ◦ *Custom Code:* Sudhanshu mentioned that custom code is required to handle different locales. He explained that the custom submit action identifies the locale and selects the appropriate XDP template for PDF generation.\n    ◦ *Future Improvements:* Sudhanshu highlighted the potential for future improvements in the form manager UI. He mentioned that an option to select multiple templates based on the locale could be added, reducing the need for custom code. We highlighted the requirement of an FPR for the same - which was shared earlier as well.\n• *Translation of XFA Templates:* Anshika demonstrated a CLI tool for translating XDP templates into different locales, explaining the setup process, the use of Microsoft translation service, and the potential formatting issues that may arise.\n    ◦ *CLI Tool:* Anshika demonstrated a CLI tool for translating XDP templates into different locales. The tool uses the Microsoft translation service to translate the templates and generates a JSON dump of the original and translated strings.\n    ◦ *Setup Process:* Anshika explained the setup process for the CLI tool. Users need to provide their Microsoft translation keys and region, and the tool will generate the translated XDP template and JSON dump.\n    ◦ *Formatting Issues:* Anshika highlighted potential formatting issues that may arise after translation. He mentioned that users might need to adjust the layout in the designer to ensure that the translated text fits within the template.\n• *Tool Setup and Usage:* Anshika explained the setup and usage of the CLI tool for translating XDP templates, including the configuration of translation services and the steps to generate translated templates.\n    ◦ *Tool Configuration:* Anshika explained the configuration of the CLI tool for translating XDP templates. Users need to provide their translation service keys, endpoint, and region in the config.js file or through the NPM run init command.\n    ◦ *Translation Process:* Anshika described the translation process, which involves running the NPM start command with the source XDP template and desired locale. The tool generates a translated XDP template and a JSON dump of the original and translated strings.\n    ◦ *Manual Adjustments:* Anshika mentioned that users might need to make manual adjustments to the translated XDP template. They can edit the JSON dump to correct any translation errors and run the apply JSON command to generate an updated XDP template.\n• *Discussion on Barcode Forms:* Lisa and Sudhanshu discussed the impact of translation on barcode forms, confirming that the barcode information would not be affected by the translation process. <@WBV97LK8D> could you help confirm the same.\n• *Sandbox Access Issues:* Lisa and Mahomed discussed the challenges faced in accessing the sandbox environment, including permission issues and the need for a session to navigate and test various components.\n• *Next Steps:* Mahomed proposed setting up a session to address sandbox access issues and to finalise the components for testing, with the involvement of the cloud manager team. <@W4R4S9FS4> <@W5HEU5M7Y> could we involve some CSME to help with a KT/session on the Cloud Manager part. We had done it earlier - but seems recording was deleted due to expiry.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:14.931Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755050145.928519"
  },
  {
    "id": "7071a1a6-ee58-4105-85b5-89683b234401",
    "source": "slack",
    "text": "*\n• Customer raised queries around fragments, templates and rule-editor\n    ◦ *Use-case:* Display dynamic logo based on the “type” key’s value from data(FDM) using rules.\n    ◦ <@WE163TH43> provided the demo to achieve this via a workaround, with the assurance of a formal fix in works.\n• Customer also enquired about calculation and validation rules in-addition to currently supported rules to which they were assured that these are already part of the roadmap.\n• Customer had questions around the usage of render API and FDM. Team agreed to provide a targeted demo in next meeting.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:13.423Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755065013.404399"
  },
  {
    "id": "b2fbf952-5e12-4b4b-b9c9-356cf41cfdff",
    "source": "slack",
    "text": "*\n• Customer had shared a use-case document listing down the requirements related wit forms and workflows.\n• Demoed them an approach that would be quick and easy to implement with the current customizations they have.\n• The approach demoed would lead to multiple form submissions getting counted for a single journey and that is something that adobe might need to take care in terms of how transactions should be handled for the customer.\n• Discussed the approach that they have shared with the customer and what was the customer feedback \n• Raised concerns about how the inbox works only on author and aftia was unsure if the customer was aware of the fact that everything will work on author and not on publish and since they have a number of users who would be working on the tasks at the same time, author could be a bottleneck in terms of have handling that load.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:11.915Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755095754.445059"
  },
  {
    "id": "da2db47a-0d3b-497d-ba81-7a0895fad7d2",
    "source": "slack",
    "text": "*\n• *Feedback on Generative AI Solutions:* Vijay Kumar and Rodney discussed the feedback on the generative AI solutions used in UPS forms, with David providing insights on his experience with image-to-form and PDF-to-form generation.\n    ◦ *David’s Experience:* David shared his experience with image-to-form and PDF-to-form generation, mentioning that he had provided feedback about a week ago and had not done further testing since then.\n    ◦ *Issues and Workarounds:* Vijay Kumar acknowledged that David had faced some issues with layout changes and other commands, which the team had been working to rectify and provide workarounds for.\n    ◦ *Future Testing:* David expressed willingness to test specific functionalities if required, and Vijay Kumar mentioned the goal of using AI capabilities to speed up forms development and reduce manual effort.\n• *Use of AI in Forms:* David and Rodney discussed the potential use of AI in creating forms, highlighting the benefits of AI in reducing manual work, such as creating dropdown menus with multiple options.\n    ◦ *AI Benefits:* David highlighted the potential benefits of AI in reducing manual work, such as creating dropdown menus with multiple options, which would be helpful in form creation.\n    ◦ *Current Usage:* Rodney mentioned that while AI assistance would be helpful for creating future forms, the team *does not frequently* create new forms, and the last new form was built *about a year and a half to two years ago.*\n    ◦ *Future Use Cases:* Rodney suggested that AI tools could be useful for creating forms for new brand implementations, and Vijay Kumar agreed that AI should be leveraged to improve development time and cycles.\n• *Conversational Forms:* Vijay Kumar demonstrated the use of conversational forms, which allow users to fill out forms through a chat interface, and discussed the potential integration with WhatsApp and other chat platforms.\n    ◦ *Demonstration:* Vijay Kumar demonstrated conversational forms, where users can fill out forms through a chat interface, showcasing the extraction of data from uploaded documents and the interactive filling of form fields.\n    ◦ *Integration Potential:* Vijay Kumar discussed the potential integration of conversational forms with WhatsApp and other chat platforms, mentioning that some customers are already using this capability in WhatsApp.\n    ◦ *API First Approach:* Vijay Kumar explained that the conversational forms use an API-first approach, allowing integration with various chat interfaces and enabling multimodal form filling experiences.\n    ◦ *Customisation:* Anirudh inquired about the use of LLM models, and Vijay Kumar mentioned that while out-of-the-box models are used, there is an opportunity for customisation to integrate customer-specific models.\n• *Image-Based Form Filling:* Vijay Kumar showcased a new way of form filling using image-based selection, where users can click on parts of an image to fill out form fields, such as in a car insurance claim form.\n    ◦ *Demonstration:* Vijay Kumar demonstrated image-based form filling, where users can click on parts of an image, such as a car, to fill out form fields, indicating the intensity of damage on different parts of the car.\n    ◦ *Use Case:* Vijay Kumar mentioned that this new mechanism is being used by existing customers in their own domains, providing a more interactive and intuitive form filling experience.\n    ◦ *Customisation:* Anirudh asked about the need for front-end work, and Vijay Kumar confirmed that some customisation is required, but Adobe is open to co-innovating with customers to enhance AI support for specific use cases.\n• *Runtime Capabilities:* Vijay Kumar discussed the runtime capabilities of AEM forms, including the use of conversational forms and multimodal form filling, and the potential for integrating with existing chatbots and LLM models.\n    ◦ *Capabilities Overview:* Vijay Kumar discussed the runtime capabilities of AEM forms, including conversational forms and multimodal form filling, which enhance user interaction and data collection.\n    ◦ *Integration:* Vijay Kumar mentioned the potential for integrating conversational forms with existing chatbots and LLM models, allowing for a seamless user experience across different platforms.\n    ◦ *Co-Innovation:* Vijay Kumar highlighted the opportunity for co-innovation with customers to customise and enhance the runtime capabilities of AEM forms, based on specific use cases and requirements.\n• *Rule Editor for Forms:* Vijay Kumar and Navneet explained the use of the visual rule editor in AEM forms, which allows users to create rules for form fields based on conditions such as country selection.\n    ◦ *Rule Creation:* Vijay Kumar and Navneet explained that the visual rule editor in AEM forms allows users to create rules for form fields based on conditions, such as showing or hiding fields based on country selection.\n    ◦ *Demonstration:* Vijay Kumar demonstrated the use of the rule editor, showing how to create a rule for a dropdown menu to list all states of the United States, which can be done using a simple prompt.\n    ◦ *Existing Forms:* Vijay Kumar confirmed that the rule editor can be used to update existing forms, provided they are based on core components or edge delivery blocks.\n• *Marketo and AEP Connectors:* Vijay Kumar introduced new connectors for Marketo and AEP, which allow for the integration of form submissions with Marketo and the hydration of AEP profiles with form data.\n    ◦ *Marketo Connector:* Vijay Kumar introduced the Marketo connector, which allows form submissions to be integrated with Marketo, enabling centralised form management while pushing data to Marketo.\n    ◦ *AEP Connector:* Vijay Kumar explained the AEP connector, which allows for the hydration of AEP profiles with form data, enabling personalised form experiences based on user profiles.\n• *Future Form Creation:* Rodney and Jason discussed the potential for future form creation at UPS, noting that while new forms are rarely created, there may be opportunities to use AI tools for form creation in the future.\n• *Contact with <http://UPS.com|UPS.com> Team:* Rodney and Jason suggested connecting with Smita Patel from the <http://UPS.com|UPS.com> team to discuss the potential use of AI tools for form creation, as they have a large number of forms and could benefit from these capabilities.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:10.406Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755148388.713359"
  },
  {
    "id": "5874e9f7-ad11-4e8e-955b-8b80ebbc2337",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Navneet, Rodney, Michael, and other team members introduced themselves and their roles. The meeting aimed to discuss the integration of generative AI capabilities in forms at UPS and gather feedback on their usage and future plans. \n• *Feedback on Generative AI Capabilities:* Rodney mentioned that the team had not specifically discussed the usage of AI technology as a group. David provided feedback on using forms experience builder, image to forms generation, and PDF to form generation. He highlighted some issues faced and workarounds provided. \n• *Current and Future Use of AI Capabilities:* David stated that there were no specific plans to use AI capabilities in a particular scenario. He suggested a use case of using an Acrobat form to create a form and then upload it to the system for AI assistance. Rodney mentioned that Canon demonstrated creating a form using a freehand drawing. \n• *Forms Development Process:* David explained the typical workflow for creating forms, which involves discussing requirements, building the form in the staging environment, testing, and then uploading it to the production environment. There is no formal documentation or intake form for this process. \n• *Conversational Forms and Multimodal Form Filling:* Vijay Kumar demonstrated the capabilities of conversational forms and multimodal form filling, which use vision capabilities and data extraction to fill forms. He explained that these forms can be integrated with chat interfaces like WhatsApp and Telegram. \n• *Image-Based Form Filling:* Vijay Kumar showcased a new way of form filling using image-based experiences, where users can select parts of an image to fill form fields. This method is being used by existing customers in their domains. \n• *Rule Creation in Forms:* Vijay Kumar and Navneet discussed the capability of creating rules in forms using the forms experience builder. This feature allows users to create rules for hiding and showing fields based on specific conditions. \n• *New Connectors for Form Submission:* Vijay Kumar mentioned the introduction of new connectors for Marketo and AEP RTCDP profile. These connectors allow users to push form data to Marketo and personalise forms based on user profiles. \n• *Potential Collaboration with Other Teams:* Rodney and Jason suggested connecting with Smita Patel's team at <http://UPS.com|UPS.com> to explore the use of AI tools for their forms. They mentioned that Smita's team would be a good fit for testing and providing feedback on these capabilities. \n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:08.897Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755495517.647919"
  },
  {
    "id": "c597ac26-690a-4eac-8803-321929cc0b0a",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Arun, Kathy Behler, Jennifer Wroblewski, Shami, Vijay Kumar, and Christina Trujillo discussed the use of Forms in AEM, Marketo, and RTCDP. The meeting aimed to understand the use cases, discuss recent innovations, and explain how the connectors work. \n• *Current Forms Setup:* Jennifer Wroblewski and Shami explained that their forms are currently built in Marketo and embedded into site pages using HTML. They aim to centralise forms management in AEM while retaining backend automation through Marketo. \n• *Marketo Connector:* Arun explained the functionality of the Marketo connector, which allows easy mapping of existing Marketo forms onto AEM forms and introduces a new trigger specific to AEM form submissions. This enables the reuse of smart campaigns and activities built in Marketo. \n• *Forms Migration:* Jennifer Wroblewski mentioned that they have more than 50 forms to migrate from Marketo to AEM. Arun inquired about the reusability of form fragments and the scale of the migration. \n• *Edge Delivery Services:* Shami confirmed that their current forms are cloud-based, but they are considering using edge delivery services for other projects. Arun highlighted that Forms are supported on Edge delivery services and can be built using the Universal Editor. \n• *AAP Connector:* Arun described the AAP connector, which allows form data to be submitted into an XDM-based schema in RTCDP. This data can then be used for personalising journeys and segmenting users into audiences for downstream use in AAP apps. \n• *Form Experience Builder:* Arun and Vijay Kumar introduced the Form Experience Builder, which uses Gen. AI to create forms quickly by interpreting screenshots or hand-drawn images. This tool aims to ease the form creation process and help scale the migration of forms. \n• *Next Steps:* Arun and Vijay Kumar discussed the next steps, including enabling the connectors and innovations on Lumens instances, sharing documentation, and scheduling a follow-up meeting to focus on the Marketo part and the migration process. \n:todo_done: *",
    "created_at": "2026-01-30T06:21:07.387Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755495816.532369"
  },
  {
    "id": "595c5d62-c3df-4203-a2d1-179d734ef131",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Arun, Ajani, and Mayank discussed the Lenovo use cases, focusing on progressive profiling, global privacy rules, dashboards, and customer journey analytics. They also covered the integration of AEP and Marketo with AEM forms. \n• *Lenovo Use Cases:* Ajani explained Lenovo's requirements for progressive profiling, global privacy rules, and the need for dashboards and customer journey analytics. They also discussed the integration of AEP and Marketo with AEM forms. \n• *Marketo Integration:* Ajani and Vijay Kumar discussed the integration of Marketo with AEM forms, including the need for a universal form that can handle both B2B and B2C leads. They also covered the submission routing options for different lead types. \n• *Form Creation and Marketo Connector:* Vijay Kumar demonstrated the process of creating a form using the Marketo connector in AEM forms. He explained how to configure the Marketo environment, create adaptive forms, and map form fields to Marketo schema. \n• *Prefill and Submission Routing:* Ajani and Vijay Kumar discussed the use of prefill services and submission routing based on form data. They explored the use of variables and custom buttons to achieve conditional submission to different systems. \n• *API Integration and Consent Management:* Ajani and Vijay Kumar discussed the integration of third-party APIs for prefill and consent management. They also covered the use of invoke service API calls to enhance form functionality. \n• *Translation and Display:* Ajani and Vijay Kumar discussed the requirement for auto-detecting the visitor's country and adjusting the display language of the form. They explored the use of IP lookup and browser settings to achieve this. \n• *Lenovo Engagement Background:* Ajani provided background information on the Lenovo engagement, including their current use of Marketo forms, the need for a universal form, and their aggressive start time of October. He also mentioned the involvement of ACS and the expected timeline for implementation. \n\n:todo_done: *",
    "created_at": "2026-01-30T06:21:05.877Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755496292.484869"
  },
  {
    "id": "b797233a-c243-4f8b-ae77-9516825d9fb6",
    "source": "slack",
    "text": "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Naveen, Andy, Arun, and Arneh discussed the challenges and requirements related to versioning and publishing adaptive forms in the AM repository. The main issues include ensuring correct publication, maintaining version history, and automating the process to avoid manual errors. \n• *Versioning and Publishing:* Andy and Naveen expressed concerns about the manual process of publishing forms and the need for versioning to track changes and ensure consistency between QA and production environments. Arun confirmed that versioning for XDPS is scheduled for Q4, with a tentative timeline of October to November. \n• *Blue-Green Deployment:* Naveen inquired about the possibility of automating the versioning process and implementing blue-green deployment to ensure consistency between QA and production environments. Andy suggested using a preview server in production for testing content before publishing. \n• *Manual Process and Automation:* Andy and Naveen discussed the challenges of the manual process for promoting forms from development to production. They emphasised the need for automation to reduce errors and improve efficiency. Vijay Kumar mentioned the possibility of using a schedule publish date feature to ensure timely publication. \n• *Approval Workflow and Access Control:* Naveen highlighted the lack of an approval process for publishing forms. Andy and Arun agreed on the importance of defining workflows and access controls to ensure proper monitoring and approval before publishing. \n• *PDF to AF Service:* Vijay Kumar informed Naveen and Andy about the improved PDF to AF service, which now supports column views. They encouraged testing the new service with the next batch of forms to see if it helps in their upcoming projects. \n• *Intermittent 401 Errors:* Arneh acknowledged the intermittent 401 errors reported by Andy and mentioned plans to connect with the AM security team to investigate the issue further. \n• *Governance and QA Automation:* Kalyan suggested discussing governance models and QA automation in the next meeting to ensure the quality of forms and improve the efficiency of the testing process. Vijay Kumar and Arneh agreed to review the current process and provide recommendations. \n:todo_done: *",
    "created_at": "2026-01-30T06:21:04.356Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755496487.205169"
  },
  {
    "id": "5a6f36bc-8253-4e2e-bc18-cf74656c086f",
    "source": "slack",
    "text": "*\nMoM:\n• Discussion focused on the issues raised by GMF team (shared over mail)\n    ◦ Vijay and Sufyan helped answer most of the queries around IC-Editor\n• Anirudh conducted partial demo for Render API + FDM with continuation scheduled for the next meeting\n    ◦ FDM queries to be discussed in detail in next meeting along with render API\nFeature requests:\n• Page break as a explicit component (not in roadmap right now) -- discuss internally\n• Team to provide manual packaging steps to export the collateral while the actual “export IC” feature is in-progress (in-order to move content from lower to higher environments)\n• Global Variables for IC\n:todo_done: *",
    "created_at": "2026-01-30T06:21:02.847Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755672781.880159"
  },
  {
    "id": "b20458be-a3a0-4874-9ff4-f9186feb7537",
    "source": "slack",
    "text": "*\n• *Form Data Submission Issue in React Application*: Charles, Devendra, and Rich discussed a problem where form data manipulated via JavaScript in the AEM environment is not correctly appearing in the XML payload when submitted through the React application, despite working as expected when submitted directly via AEM.\n• *Custom Scripting and Data Binding in Forms*: Charles and Devendra reviewed the custom JavaScript used in forms, which manipulates the DOM directly and stores field values in attributes rather than elements, leading to non-standard data binding and challenges in data extraction for PDF generation.\n• *Testing, Deployment, and Feedback Process*: Charles informed Devendra and Rich about the ongoing testing of approximately 450 forms, the upcoming UAT code freeze, and plans to document and share feedback on rendering and data issues for further fixes.\n• *Technical Differences Between PDF and HTML Forms*: Charles and Devendra discussed the differences in data handling and validation between PDF and HTML forms, noting that HTML requires stricter data patterns and that timing issues can affect rendering and event processing.\n• Customer is planning to migrate 8K XDPs on HTML5 forms\n• Current fix related to populating data in table cell of dataXML using scripts unblocked 60 forms as that fragment was in use those forms.\n:todo_done: *",
    "created_at": "2026-01-30T06:21:01.339Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755680337.712189"
  },
  {
    "id": "4e90f857-d4ba-4470-8afa-3f5a174514e5",
    "source": "slack",
    "text": "*\n• Gave a demo on custom fonts, covering UI and code changes required, explained the steps, and shared documentation. *Next step:* Enable on _dev2_.\n• Demoed the IC import/export bundle feature, which allows IC with related assets to be exported and imported to another instance. Addressed queries on Package Manager download with filters and UI download/upload.\n• Publish APIs for communications are returning *404.* Requested NFCU peeps to whitelist the APIs on Publish. Also shared the required changes for `dispatchers filter.any`. This would be part of product in next release.\n• NFCU requires data.json for previewing the IC on priority, we had earlier hared the ETA for `data.json.`  Confirmed them its on track. Also the osgi service for render pdf api, would be shared by sept 15. \n• Discussed cleanup issue: deleting and re-adding leads to a *500 error* on PDF preview (intermittent issue). Adarsh/Srini explained the flow, and it worked during the session. We will investigate further with different combinations. Will create a JIRA for this.\n:todo_done: *",
    "created_at": "2026-01-30T06:20:59.830Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755793481.062359"
  },
  {
    "id": "2c3d0bcf-99e6-4b1c-8da3-d51698b9b2f2",
    "source": "slack",
    "text": "*\n• Anirudh conducted detailed walkthrough for the Render APIs (picking up from the last meeting).\n    ◦ First-cut API definition was shared beforehand with the customer with the documentation links for token generation.\n    ◦ Customer was suggested to invoke APIs from publish instance whenever invoked programmatically, though they could test the API via author instance as well.\n    ◦ Customer’s queries regarding supported data options were also attended.\n    ◦ Since customer enquired about the json data support in the APIs, demo for the same was added as an agenda item for the next meeting.\n• As enquired by the customer over email, Anirudh provided a demo for the upcoming ‘Publish’ feature for IC assets. The customer’s queries regarding rollbacks were also answered alongside.\n• Anirudh addressed customer’s concerns regarding the e2e deployment and release process of an IC, by providing a complete picture of e2e flow, explaining the differences between author/publish instances and how these differ from dev/stage/production environments. The discussion covered the full flow from authoring IC on a dev-author to rendering it using the APIs available in prod-publish, which successfully addressed the customer’s concerns about the process.\n• Anirudh provided a demo for ‘Packaging of IC assets’ to move them to higher environments (from dev to prod) as enquired by the customer.\n    ◦ Demo for the upcoming ‘Download’ feature was provided.\n    ◦ As an interim measure, the customer was also provided with a detailed walkthrough of the manual packaging process - creation, export, import and installation - for the IC assets via `crx/packmgr`.\n    ◦ Queries around the second option were also attended.\n• Vijay helped resolve the authoring issues highlighted by the customer including rules-copy and image-deletion. Acknowledging the root cause, they were provided with a suitable workaround.\n• Customer sought timelines and insights for the following features:\n    ◦ Versioning - Planned to be discussed in detail for the next meeting.\n    ◦ Workflows\n        ▪︎ Planned to be discussed in detail for the next meeting.\n    ◦ *Use-case:* They have a tool from which they want to invoke the APIs directly and feed the data and again send the PDF result back to it. Not to confuse with the Associate UI use-case, instead they need the general workflow support for the APIs similar to the existing on-prem IC workflow APIs.\n    ◦ Availability of Publish/Download features.\n:todo_done: *",
    "created_at": "2026-01-30T06:20:58.320Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755837410.014009"
  },
  {
    "id": "c960a0c8-7ada-4316-9b49-4c3e7957092d",
    "source": "slack",
    "text": "*\n*AI Model Integration and Pilot Testing Plans:* Vijay Kumar, Naveen, Andy, and Kalyan discussed the current status and next steps for integrating the AI model into product workflows, including the need for a dedicated timeline for pilot testing and feedback, with Naveen agreeing to coordinate with their team and provide dates for focused sprints.\n\n*Finalised Architecture and Content Authoring Workflow:* Vijay Kumar, Andy, Mayank, and Naveen reviewed and summarised the finalised architecture for content authoring and publishing, detailing the workflow from authoring in production to preview, QA, and publishing, and discussed the elimination of manual processes and infrastructure changes required for the new approach.\n\n*Automated Testing Tool Demonstration and Capabilities:* Gaurav, Vijay Kumar, Andy, Hemadri, and Naveen discussed and demonstrated a new automated testing tool for adaptive forms, highlighting its Chrome plugin, event capturing, dynamic rule handling, and AI-driven test case generation, with plans for pilot usage and feedback from the QA team.\n\n*Documentation and Process Change Requests:* Kalyan requested documentation of the current and new processes for form authoring and testing, with Andy confirming that this will be included in upcoming sprint stories to ensure clarity for all stakeholders.\n\n*AI Conversion of XDP Forms:* Andy and Gaurav discussed the upcoming availability of AI conversion for XDP forms, with Gaurav indicating that the feature should be ready by next week, enabling the team to leverage AI for additional form formats.\n:todo_done: *",
    "created_at": "2026-01-30T06:20:56.808Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755838573.221009"
  },
  {
    "id": "8f0a339d-ad13-4437-ac4c-9379fda8ca96",
    "source": "slack",
    "text": "*\n*Data Routing and Partition Assignment for AM Forms:* Andy, Varun, Mayank, Rahul Kumar, Ben, and Sarah Warzecha discussed the challenges of routing form submissions to the correct Marketo partitions based on user location, exploring options such as hidden fields, assignment rules, and location validation methods.\n\n*Form Requirements, Regions, and Language Support:* Andy, Sarah Warzecha, Mayank, and Vijay Kumar clarified the scope for milestone one, agreeing to build a single AM form to be deployed across multiple regional sites (ANZP and EMEA), with support for language variations and dynamic behaviour.\n\n*Technical Integration and Analytics Requirements:* Andy, Sarah Warzecha, Mayank, Ben, and Mark discussed technical integration points, including Marketo cookies, UTM parameters, ECID tracking, and the use of Adobe Analytics and Launch for form analytics.\n\n*Project Coordination, Access, and Next Steps:* Mayank, Sarah Warzecha, Vijay Kumar, and Mark coordinated next steps, including setting up a Teams channel, confirming access to AM environments, assigning technical contacts, and defining the project timeline and go-live expectations.\n\n*Environment-Specific API Configuration:* Andy, Mayank, and Rahul Kumar discussed the need for separate API configurations for QA, stage, and production environments, ensuring that form submissions are routed to the correct Marketo instance.\n\n*AI Tool Forms and Beta Agreement:* Vijay Kumar and Sarah Warzecha discussed the potential use of the AI Tool Forms Experience Builder and the need for a signed beta agreement to proceed with demonstrations.\n:todo_done: *",
    "created_at": "2026-01-30T06:20:55.299Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755838758.042469"
  },
  {
    "id": "0d51e122-9c17-4d7c-b787-73000724a922",
    "source": "slack",
    "text": "*\n*Meeting notes*\n• *Intent-Based Experience Creation with Gen AI:* Anurag, Sudhanshu, and the team discussed Adobe's approach to customer experience management using intent-based experiences powered by Gen AI, focusing on generating, activating, and optimizing user experiences for end users and customers.\n    ◦ *Three Pillars Overview:* Anurag outlined the three key pillars for creating performant experiences: generation (using tools like Edge Delivery Services and Universal Editor), activation (with multimodal forms), and optimization (identifying and fixing opportunities for improvement).\n    ◦ *Unified Authoring:* The team explained the concept of unified authoring, where both pages and forms can be created within a single editor, allowing authors to drag and drop adaptive form components in either the Universal Editor or the site editor using core components.\n    ◦ *AI-Assisted Form Creation:* Anurag demonstrated the Forms Experience Builder, an AI assistant that enables authors to create forms by expressing intent in natural language, with Gen AI suggesting appropriate fields, layouts, and even basic rules, which can then be applied directly to the form.\n    ◦ *Limitations and Parity:* It was clarified that the AI assistant is currently available in the AEM Forms editor and not in the core component side of the sites page builder, but unified authoring experiences are maintained across editors for consistency.\n• *AI-Driven Form Generation from Visual Inputs:* Anurag presented capabilities for generating forms from screenshots, Figma exports, legacy forms, hand-drawn sketches, and PDF forms, allowing users to upload visual references and have the system extract and build forms automatically.\n    ◦ *Screenshot and Sketch Extraction:* The team showcased how users can upload screenshots or hand-drawn sketches, and the system will analyze the image to extract fields, identify optional fields, and add relevant components such as attachments and submit buttons.\n    ◦ *PDF Form Conversion:* Anurag explained the process of uploading PDF forms into the Experience Builder, which then converts them into adaptive forms, applying brand-approved templates and style guides as part of the conversion.\n• *Authoring Versus Developer Roles and Customization:* Lauren, Jitendra, and others discussed the division of responsibilities between authors and developers, focusing on what can be automated by AI and what still requires manual intervention, especially for integrations, styling, and error handling.\n    ◦ *Author-Focused Features:* Anurag clarified that the AI assistant is primarily intended for authors, enabling them to quickly create forms, while developers are responsible for configuring data sources, integrations, and custom components.\n    ◦ *Integration and Error Handling:* Lauren and Jitendra raised questions about integrating forms with systems like Marketo or Salesforce and handling errors; Vijay Kumar and Sudhanshu explained that while some integrations can be configured via connectors and templates, advanced error handling and customizations still require developer involvement.\n    ◦ *Styling and Customization Roadmap:* Jitendra asked about AI-driven styling, and Anurag confirmed that updating styles via AI is on the roadmap, with current support for leveraging Figma styles and plans to further automate style updates.\n• *Security, Captcha, and Analytics Integration:* Jitendra, Sudhanshu, and Vijay Kumar discussed security features such as Captcha integration, how these are configured, and the analytics capabilities available for forms, including out-of-the-box integration with Adobe Analytics.\n    ◦ *Captcha Support:* Sudhanshu and Vijay Kumar explained that various Captcha types (Google Captcha, Edge Capture, Turnstile, enterprise Captcha) are supported, and can be added manually or via templates, with cloud configuration for reuse across forms.\n    ◦ *Analytics Integration:* Anurag and Sudhanshu described the out-of-the-box integration with Adobe Analytics for core component-based forms, and the availability of operational telemetry data for monitoring form performance without requiring AI.\n• *Multimodal Forms and Advanced User Interactions:* Anurag and Sudhanshu introduced multimodal forms, which allow end users to interact with forms through conversational interfaces, document scanning, and click-to-fill features, supporting diverse use cases such as healthcare and insurance.\n    ◦ *Conversational Interface:* The team demonstrated how users can fill forms via a conversational interface embedded within the form, with the ability to switch between conversation and traditional views, and preview or submit forms from either interface.\n    ◦ *Document Scanning and Prefill:* Anurag described how users can upload identification documents, which are scanned to prefill relevant form fields, reducing manual entry and cognitive load.\n    ◦ *Click-to-Fill and SVG Mapping:* Sudhanshu explained the use of SVGs and custom components to enable users to click on images (e.g., a car or body part) to indicate areas of interest, with the system mapping these selections to form fields.\n• *Form Optimization and Sites Optimizer:* Anurag and Sudhanshu detailed the Sites Optimizer tool, which identifies and suggests optimizations for forms and site content, including conversion rates, accessibility, and other performance metrics, with plans for auto-optimization features.\n    ◦ *Opportunity Detection:* The Sites Optimizer identifies opportunities such as low form views, poor navigation, low conversion rates, and accessibility issues, providing prescriptive suggestions and, in some cases, alternative variations for improvement.\n    ◦ *Operational Telemetry and AI Models:* Sudhanshu explained that the optimizer uses operational telemetry data and AI models to analyze user interactions and generate actionable insights, with current support for auto-detection and suggestions, and ongoing work towards auto-fixing certain issues.\n    ◦ *Migration and Compatibility:* The optimizer supports both adaptive forms and third-party forms for opportunity detection, but auto-optimization features are currently limited to adaptive forms.\n• *Migration from Foundation to Core Components:* Ashajyoti, Pradeep, and Sudhanshu discussed the challenges and process of migrating forms from foundation-based components to core components, including code compatibility, rule migration, and the benefits of modernization.\n    ◦ *Migration Process and Challenges:* The team discussed that while the structure of forms can be migrated, rule sets currently need to be redefined manually, which is a significant effort for teams with many forms and complex rules.\n    ◦ *Modernization Benefits:* Sudhanshu and Vijay Kumar highlighted that core components offer better performance, easier styling, and support for modern JavaScript (ES6+), as well as advanced features like headless and multi-channel support.\n    ◦ *Incremental Migration Strategy:* It was recommended to keep existing forms on foundation components if immediate migration is not feasible, and to use core components for new forms to gradually modernize the codebase.\n• *Custom Component Development and Support:* Pradeep, Ashajyoti, and the team discussed the development of custom components, challenges with extending existing components, and the support available for troubleshooting and documentation.\n    ◦ *Custom Component Creation:* Pradeep described efforts to create a custom auto-suggestion field by extending the text field component, with the team requesting design references or screenshots to assist with support.\n    ◦ *Troubleshooting and Documentation:* Ashajyoti raised issues with copying structures and JavaScript compatibility after migration, and Sudhanshu recommended sharing code for review and consulting documentation, especially when moving to core components.\n• *Next Steps and Follow-Up Actions:* Anurag outlined the next steps, including enabling features on dev servers, scheduling follow-up sessions, collecting collateral and sample forms, and enrolling interested teams in the VIP program for early access and feedback.\n    ◦ *Feature Enablement:* The team agreed to enable Forms Experience Builder and related features on dev servers upon receiving the necessary program and org IDs from the customer team.\n    ◦ *Follow-Up Sessions:* Anurag committed to scheduling follow-up meetings to address outstanding questions, review migration strategies, and provide hands-on support for enabling and using new features.\n    ◦ *VIP Program Enrollment:* Interested teams were invited to join the VIP program for beta access to new capabilities, with the opportunity to provide feedback and participate in proof-of-concept projects.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:20:53.782Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1755853555.040079"
  },
  {
    "id": "f8184f22-01c1-46e0-83ec-037e6ee2d333",
    "source": "slack",
    "text": "*\nAnirudh conducted demo for Json data (inline and as file) support in the Render APIs\n• Customer’s queries regarding supported options and formats for the APIs were addressed.\n• Discussion regarding sync and batch processing of documents.\n    ◦ Use-case: Customer has large set of data files which they want to process in batches (not in sync).\n    ◦ For building the customer perspective, Sufyan shared overview of the batch processing via output APIs.\n    ◦ The customer inquired about timelines for batch support in IC. They were assured that the timelines would be shared as part of the roadmap.\nPrateek conducted a demo for probable versioning support using Adaptive Forms.\n• Customer questions about switching between different versions and their storage were addressed aptly.\n• Customer was assured that versioning for IC assets will have a similar experience when available.\n:todo_done: *",
    "created_at": "2026-01-30T06:20:52.274Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756223195.549159"
  },
  {
    "id": "64e60bac-f4f3-45c6-8f0d-3e1c1469e256",
    "source": "slack",
    "text": "*\n• Discussed current limitations in the PDF import tool, including its inability to process scanned PDFs, Word documents, and explored workarounds such as using Acrobat Pro and Experience Builder for form creation.\n• Reviewed the recent Friday night release failure, discussed the need for longer rollout windows due to large cluster lists, and explored the feasibility of using feature toggles or environment variables to manage deployments and minimize user impact.\n• Discussed the status of the QA automation tool, its current capabilities, the need for plugin packaging, and outlined next steps for documentation, sample form selection, and agenda setting for future meetings.\n• Sample Form Selection for Testing: Michelle and Naveen agreed to provide new sample forms for the next session to further explore the tool's capabilities, with a focus on complex or commonly used forms.\n• LPL discussed the difficulties in converting Word documents to PDFs for form processing, the volume of affected forms, and the need for sustainable solutions to reduce manual authoring time. They reported that over 1,000 forms are received as PDFs, many of which were originally Word documents, and that the conversion tool struggles with these due to issues introduced during the Word-to-PDF conversion process.\n:todo_done: *",
    "created_at": "2026-01-30T06:20:50.756Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756306402.744399"
  },
  {
    "id": "1002ffb3-230d-4b1d-b0fc-4bf58fd92a66",
    "source": "slack",
    "text": "*\n• *AEM Forms and Marketo Integration Demo:* Mayank, Shraddha, and Rahul presented a demo to Andy Kluck and Sarah Warzecha, showcasing the implementation of AEM Forms integrated with Marketo, including custom rules for lead partitioning based on form fields such as city and postal code.\n• *Requirements Review and Field Mapping:* Andy Kluck walked the group through a detailed requirements presentation, outlining the need for replicating the request a quote form on multiple regional websites, specifying required visible and hidden fields, and ensuring correct data flow and field mapping into Marketo and Salesforce.\n• *Lead Routing, Partitioning, and Duplicate Management:* The team discussed strategies for routing leads to the correct Marketo partitions and workspaces, handling existing and new contacts, and minimizing duplicate records, with Andy and Mayank exploring whether assignment logic should reside in AEM Forms or Marketo.\n• *Salesforce Integration and Custom Field Handling:* Rahul and Andy discussed the integration between Marketo and Salesforce, confirming that all form data flows through the lead object, with custom fields and tasks used to trigger updates in Salesforce, and clarified the frequency and process for creating new custom fields.\n• *Access Management and Next Steps:* The group coordinated on access to AEM and Marketo environments, with Sarah confirming access for Mayank, Vijay, Rahul, and Shraddha, and Andy agreeing to provide the requirements document via email, while planning for the next meeting and initial form authoring by Andy.\n• *Trigger Points and Campaign Adjustments in Marketo:* Rahul and Andy discussed the need to update Marketo campaign triggers to accommodate the shift from Marketo form fills to AEM form fills, with plans to clone and adjust campaigns as needed for the new integration.\n:todo_done: *",
    "created_at": "2026-01-30T06:11:14.812Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756358443.203619"
  },
  {
    "id": "546f1836-d1b4-4ced-ae26-10734d2fa382",
    "source": "slack",
    "text": "*\nDiscussed the usecase of reload of page on switch of a condition.\nThe site page has 11 forms, and 2 are shown at a time.\n:todo_done: *",
    "created_at": "2026-01-30T06:11:13.300Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756379331.808029"
  },
  {
    "id": "0ae928a4-3277-49c5-926a-5076ccc37d77",
    "source": "slack",
    "text": "*\nUnderstanding the usecases.\nOn 6.5.23 (latest 6.5 SP)\nMigrating from other form technology, had developed something in AF1, but want new development to be in core component based forms.\nThey were asking about the limited capabilities of guideBridge in CC vs AF1\nThey mostly have business persona, and said \"Theme editor is very popular\"\nThey also have XDPs, which they want to migrate to AF (separate initiative), didn't get great results from AFCS\n:todo_done: *",
    "created_at": "2026-01-30T06:11:11.790Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756379930.482199"
  },
  {
    "id": "4b1307d2-fe57-483a-834a-d1db929f37f6",
    "source": "slack",
    "text": "*\nDiscussion on upcoming private release, scope of features, and any requirements from customer’s end for archetype.\n\nKey Points Discussed:\n• Generic API Integration – Support for data.json in PDF Preview API.\n• Enabling Page presets support in the editor for master pages.\n• Export &amp; Import – Support for IC migration across different environments.\n• IC on Publish –\n• Persona Access for Fragments – Role-based access control for IC in general.\n:todo_done: *",
    "created_at": "2026-01-30T06:11:10.283Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756449950.465869"
  },
  {
    "id": "14d9664c-f1eb-44b8-a52d-3060ae0319e9",
    "source": "slack",
    "text": "*\nMeeting notes:\n• *PDF to Adaptive Form Conversion Updates:* Mayank, Naveen, Andy, and Gaurav discussed recent fixes and updates to the PDF-to-adaptive form conversion process, including handling of static and Acroform PDFs, and confirmed that the latest fixes now allow for successful field selection and panel attachment in converted forms.\n    ◦ *Issue Resolution and Fix Deployment:* Mayank explained that a fix was pushed to address discrepancies in generating adaptive forms from PDF or PNG sources, specifically enabling proper selection of fields and attachment of panels, which Naveen agreed to test on their side.\n    ◦ *Static PDF and Acroform Handling:* Mayank clarified that only Acroform PDFs are selectable in the dropdown for conversion, and static PDFs must be converted to Acroform format using tools like Acrobat Pro before they can be processed by the adaptive form tool.\n    ◦ *Workflow Confirmation and Testing:* Andy described the process of converting a PDF using Acrobat Pro and uploading it, noting a delay due to the standard asset update workflow, and Gaurav confirmed that the converted Acroform retained all fields as expected.\n    ◦ *Live Demonstration and Error Handling:* Naveen demonstrated the conversion process live, successfully converting a single-page form and testing the addition of an address section, with Arneh and Gaurav assisting in troubleshooting minor issues related to field placement and confirming the presence of field bindings.\n• *Migration Timeline and Form Conversion Targets:* Mayank, Naveen, Michelle, and Arneh discussed the migration plan from pdf to AF, including the number of forms to be converted, target timelines, and the need for a focused approach with clear commitments and incremental releases.\n    ◦ *Form Volume and Timeline Estimates:* Naveen estimated that at least 2000 forms need to be converted by October, with Michelle clarifying that while 2000 is not required, several hundred forms for NAO and standalone use are expected, and she is working to obtain an exact list.\n    ◦ *Incremental Release Strategy:* Michelle stated that forms would be released incrementally rather than in a single batch, with an ongoing 10% monthly change rate in forms, and Mayank emphasized the importance of focusing on a quantifiable subset (e.g., top 20-40 forms) for initial conversion within 15-20 days.\n    ◦ *Commitment and Focused Approach:* Arneh requested a commitment from Naveen's team on specific forms and go-live dates to ensure a focused approach, and Naveen confirmed their commitment to prioritize the migration and move away from DocuSign.\n• *Automated Test Case Generation Prerequisites:* Arneh, Mayank, Andy, and Naveen discussed the requirements for leveraging automated test case generation, emphasizing that only core component-based adaptive forms are currently supported, and outlined the need to migrate existing forms to this format for full compatibility.\n    ◦ *Core Component Requirement:* Arneh and Mayank explained that the automated testing tool only works with core component-based adaptive forms, as these follow an open runtime specification that enables event capture and instrumentation necessary for test case generation.\n    ◦ *Migration of Existing Forms:* Andy and Arneh clarified that existing foundation component-based forms would need to be migrated to core components to utilize the testing tool, and Naveen agreed to explore this migration with their team.\n    ◦ *Parallelization of Conversion and Testing:* Kalyan raised the possibility of running conversion and testing efforts in parallel, and Arneh responded that while the testing tool can be used on newly converted core component forms, the conversion process must be stabilized first before scaling up testing.\n    ◦ *Prototype Status and Product Integration:* Arneh noted that the current testing tool is a prototype and not yet fully integrated into the product, and future engagement with customers like Naveen's team will help shape its productization and exposure.\n• *Word to PDF to Acroform Conversion Workflow:* Mayank, Naveen, and Andy reviewed the end-to-end process for converting Word documents to PDFs and then to Acroforms, confirming that the operations team uses Acrobat Pro for this purpose and clarifying previous misunderstandings about license availability.\n    ◦ *Workflow Clarification:* Naveen explained that Word forms are received from advisors, converted to PDF, and then to Acroform using Acrobat Pro, after which the Adobe AI tool can be used for further conversion, resolving earlier confusion about Acrobat Pro licensing.\n• *Deployment Coordination and Environment Configuration:* Andy, Naveen, and Arneh coordinated on deployment strategies, agreeing to implement an environment variable approach for blue-green deployments, with the next release window scheduled for September 20 and plans for joint testing during deployment.\n    ◦ *Environment Variable Implementation:* Andy confirmed that their team would implement the environment variable approach for deployment, as the feature toggle option was deemed unsuitable for their needs, and Naveen outlined the plan to deploy and test this configuration during the next release window.\n    ◦ *Joint Testing and Alignment:* Naveen suggested that both teams join a call during the deployment to test the changes together, ensuring alignment and minimizing dependencies between the teams.\n• *Troubleshooting Import Errors and Logging:* Naveen, Arneh, Andy, and Gaurav addressed recurring import errors during form conversion, discussed possible causes, and agreed on steps for capturing network traffic and logs to facilitate further troubleshooting.\n    ◦ *Error Investigation Steps:* Naveen agreed to capture network traffic and console logs if import errors recur, while Arneh offered to investigate Splunk logs for the relevant environment to assist in isolating the issue.\n\n:todo_done: *",
    "created_at": "2026-01-30T06:11:08.777Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756453534.933639"
  },
  {
    "id": "31f73c2e-1957-4088-8315-bb8d9478cb4d",
    "source": "slack",
    "text": "*\n• *Marketo Configuration Setup in AEM:* Shraddha, Mayank, and Arun demonstrated to Andy and Sarah how to set up Marketo configurations within Adobe Experience Manager (AEM), including creating configuration folders, entering Marketo credentials, and enabling custom activities for form submissions.\n• *Form Creation Using GenAI Experience Builder:* Shraddha and Mayank showcased the GenAI-powered Experience Builder in AEM to Andy and Sarah, demonstrating how forms can be created from screenshots or PDFs, edited via drag-and-drop, and customized with templates and themes for brand compliance.\n• *Form-to-Marketo Field Mapping and Hidden Fields:* Andy inquired about mapping form fields to Marketo and adding hidden fields, and Shraddha and Arun explained the process of binding AEM form fields to Marketo fields, configuring submissions, and using hidden fields for routing and campaign logic.\n• *Translation and Localization of Forms:* Andy and Sarah raised questions about translating forms for multiple languages, and Arun explained the translation framework in AEM, the integration with external translation services, and the implications of standalone versus embedded forms for localization.\n• *Next Steps and Stakeholder Involvement:* Andy, Sarah, and Arun agreed to invite additional stakeholders (Lesley, Heidi, Ben) to future meetings to finalize form structure, translation strategy, and AEM setup, with the immediate plan to build and connect an English form before expanding to other languages.\n:todo_done: *",
    "created_at": "2026-01-30T06:11:07.268Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756877839.372879"
  },
  {
    "id": "93040c4e-d469-4afc-b081-f8266b3e6401",
    "source": "slack",
    "text": "*\n• *AEM Forms Enablement and Initial Setup:* Arun, David Lopez, Vijay Kumar, Sudhanshu, and Jennifer Rogers coordinated the enablement of AEM Forms in the dev environment, discussed the process for activating the solution in Cloud Manager, and clarified the approach to avoid impacting production while setting up the proof of concept (POC) form.\n• *POC Form Scope and Data Integration:* Arun, Jennifer Rogers, and David Lopez defined the scope of the POC form, confirmed the use of core components, and agreed to integrate form submissions with the AEP RTCDP connector, ensuring data accessibility for other Adobe Experience Platform applications.\n• *Collaboration and Communication Plan:* Arun, Vijay Kumar, Jennifer Rogers, and Vince established a plan for ongoing collaboration, including setting up a dedicated Slack channel for the forms project and scheduling weekly cadence meetings to track progress and address requirements.\n• *Next Steps and Open Questions:* Vijay Kumar and Arun outlined the next steps, including finalizing access, clarifying form requirements, and planning a discovery call to address detailed questions about form reuse, validations, and integration with AEP.\n:todo_done: *",
    "created_at": "2026-01-30T06:11:05.760Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756877949.804249"
  },
  {
    "id": "8699c1b9-7537-4962-87f3-5fac41df2e0b",
    "source": "slack",
    "text": "*\n• `Add address field below the first name field` not adding to desired location. We will have to implement this.\n• They wanted to enable form functionality across environments. They will be providing the program ids.\n• Naveen shared plans to demo the new functionality to their operations team, who are responsible for creating forms\n• They have a timeline of Oct end to migrate 30-40 forms.\n• Andy confirmed that the code for the environment variable approach was completed and built successfully, but had not yet been deployed to the development environment for testing.\n• They want to use the testing tool but it is available on af2 form and most of their forms are af1\n\n:todo_done: *",
    "created_at": "2026-01-30T06:11:04.251Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756878483.725999"
  },
  {
    "id": "bdbad919-9934-4f31-8c4e-844951f99b17",
    "source": "slack",
    "text": "*\n• Demonstrated pdf-2-af capability from Forms experience builder for converting their acroform.\n• Demoed approval workflows using AEM Workflows.\n• Discussed their use-case of populating dropdowns using API calls to backend service.\n• Answered queries related to how the conversions work, how do we set rules on fields, how to generate DoR and send emails, how can templates be used, how file attachments work with DoR.   \n:todo_done: *",
    "created_at": "2026-01-30T06:11:02.744Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756880191.295419"
  },
  {
    "id": "cb9efe6e-c880-4b03-a21a-dd8222f2cb42",
    "source": "slack",
    "text": "*\n• *Marketing Team’s Transition from Digio to AEM Forms:* Chi, Amit, and Arun discussed the marketing team’s interest in replacing Digio with AEM Forms for fan experience activations, focusing on understanding AEM Forms’ capabilities, identifying gaps, and ensuring the demo addresses specific pain points relevant to their current use cases.\n• *Technical Integration and Data Flow Requirements:* Amit and Arun discussed the technical requirements for AEM Forms, including integration with the data warehouse, Adobe RTCDP, and the need for flexible data submission options, while ensuring the demo remains non-technical for the marketing audience.\n• *Demo Content, Scenarios, and Customization:* Chi, Arun, and Amit outlined the desired content and approach for the AEM Forms demo, agreeing to focus on marketing forms, reusable components, and user-friendly experiences, while highlighting but not dwelling on technical or custom development aspects.\n• *Future State and Platform Roadmap Considerations:* Chi and Arun discussed the potential future use of AEM Sites, clarifying that while the current focus is on forms, the demo should also create awareness of the broader capabilities of AEM Sites without assuming a replatforming decision.\n• *Demo Scheduling and Next Steps:* Chi, Arun, and the team coordinated on next steps, agreeing to share pain points and sample URLs via email, and for Arun to propose a demo timeline after consulting with their team.\n:todo_done: *",
    "created_at": "2026-01-30T06:11:01.233Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1756966421.639629"
  },
  {
    "id": "f22019e6-ecf2-4797-af65-495f9dc0795b",
    "source": "slack",
    "text": "*\n*Context:* \n• Forms ARR: $72.9K\n• Contractual Utilization: 18.9%\n• Multiple submit alerts - customer not reachable\n*Intent:*\n• Good opportunity for new feature adoption: Forms Exp. Builder, Forms opp - ASO, ..\n• Internal connect with Manuel (TAM) and Ana (SAM) to have subsequent customer call\n*Updates:*\n• Expansion plan in Bancolombia - they want to start using AEM Forms in another business\n• They would be discussing requirements and using more of AEM Forms\n• Currently leverage multiple AEM Forms features - including XFA/XDP DoR, Headless (using custom library developed by ACS)\n• Looking for Acrobat Sign / DocuSign - initial demo done (most probably with Foundation Forms)\n• Workshop/Coaching planned - attaching plan in thread.\n• Submit errors in past were related to FTP config - which was resolved. Was not aware of recent failures.\n:todo_done: *",
    "created_at": "2026-01-30T06:10:59.724Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757038002.904469"
  },
  {
    "id": "88b696f6-e44c-488e-bcc6-c77df3cabe03",
    "source": "slack",
    "text": "*\n• *Marketo Connector Enablement in AEM Environments:* Andy Kluck, Mayank, Lesley, and Rahul Kumar collaborated to enable and configure the Marketo connector in both the stage and production AEM environments, with Lesley providing necessary admin permissions and folder setup support.\n• *AEM Forms Core Component Enablement and Pipeline Configuration:* Christy, Mayank, Lesley, and the team discussed the absence of AEM Forms core components and themes, investigated pipeline configurations, and agreed on steps to enable core components in the appropriate environments, with Christy taking responsibility for the enablement before the next meeting.\n• *Access Provisioning for AEM and Cloud Manager:* Christy and Mayank coordinated to resolve access issues for the Adobe team, with Christy adding multiple team members to the AEM instance, Cloud Manager, and code base to facilitate ongoing configuration and troubleshooting.\n• *Next Steps for AEM Forms Testing:* The team, including Andy Kluck, Heidi, and Christy, agreed to proceed with enabling core components and to reconvene in the next meeting to begin creating and testing AEM Forms, with Heidi preparing a test page and Christy handling the technical enablement.\n:todo_done: *",
    "created_at": "2026-01-30T06:10:58.216Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757057610.093969"
  },
  {
    "id": "96cfb079-2ffb-419a-9e6e-2ddd9670c7cf",
    "source": "slack",
    "text": "*\n*AI Form Conversion*: Customer tested AI-based form conversion; overall successful but with minor formatting issues (headers, signature fields). Customer is tracking time/effort saved vs manual process.\n*Engineering Conversion Check*: Engineering will convert the form that Customer is trying and confirm if everything worked.\n*API &amp; Index Issues*: Customer observed recurring JWT token denials and index traversal issues in Adobe Cloud.\n*QA Manual Testing*: Customer’s QA team detailed their manual process: validating fields, branching logic, PDF generation, and signing workflows; each long form takes ~3–3.5 hrs to test. Regression testing ensures basic functionality across releases.\n*Automation Evaluation*: Engineering asked Customer to evaluate Cypress Studio for broader automation, focusing on validation and submission flows.\n*Environment Enablement*: Experience Builder has been enabled on QA environment (Program ID *124307*).\n:todo_done: *",
    "created_at": "2026-01-30T06:10:56.707Z",
    "customers": [],
    "channel": "C04D195JVGS",
    "thread_ts": "1757437934.167629"
  }
]