[
  {
    "theme": "Authoring UX - request",
    "primary_theme": "Authoring UX",
    "feature": "Forms",
    "category": "request",
    "report_count": 70,
    "customer_count": 33,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:40.741Z",
    "evidence_signal_ids": [
      "023eb1e1-c371-4aa0-9e53-855ad42f86a3",
      "0a148c3d-693b-4a06-9b5e-ad0834ea95ba",
      "11e6a0f8-960f-4fbf-9e93-8f5720fc3adc",
      "1b3626d2-f2f3-45cc-88f7-c9369c253140",
      "1b8ddbb2-319e-4256-8da1-e0d03ae0fec0",
      "1bb5c365-1149-4330-bb33-e1df70339759",
      "275d08c4-4660-4792-896e-143c1a056242",
      "27c0e668-a599-45a2-a206-831ae2693190",
      "2a020038-1bf8-4f61-8079-e0bea4ba1892",
      "3b841d52-a6f0-4d75-a46f-85b012003b21",
      "3d99d3d2-9013-48d6-b219-e5af7e4dc5dc",
      "3f1cb81b-c18d-41c3-8cc9-0d593daa0a08",
      "401630b3-df57-454b-92d6-e3447216c8c6",
      "48aa1db6-f410-43eb-945f-e0c045e806c1",
      "4c9175b6-8416-4793-9ff9-6d2554c340cd",
      "52b7cd92-7473-4001-afe1-e9960f94645d",
      "57fbacfa-6fcc-4152-8b8a-9c8d0b20e146",
      "596c0b77-e087-4418-9dec-ddc5d012f5de",
      "5c0b47f9-f9b4-4e94-a9e5-bcda046dd256",
      "607667a4-b5ed-4ac0-bd86-232d6515b438",
      "64965afb-4a09-4079-ad50-2a9400df7412",
      "7134ca54-f0e7-4883-898c-c6bad4874156",
      "72455d58-f04b-49c5-8336-cac13a686f66",
      "72f2ccec-566d-45d7-809f-e7f5344addf6",
      "750d12ce-bb52-4368-8973-f35ff3b0053f",
      "75aae6a2-1b74-411c-b2b4-678819b1e289",
      "769f54a0-5c8d-41c4-b1d2-de9e597b8a36",
      "7949e7df-8d98-4a20-bd44-d9a08c9ff2f6",
      "823c024a-8b4e-4569-bf90-5432d442b181",
      "87fd1a08-8874-44d9-8944-b3fd636b8479",
      "8a24808a-3b51-42de-965d-3dc57a07f30d",
      "8b3f87e0-5a39-4223-9c02-0c23869855c1",
      "8b4da9d4-e16e-4374-8604-dda85de7dab1",
      "8c93e9ca-06be-4334-8951-a921f94909a1",
      "906ee0db-a886-404e-8ddf-09c5e262b233",
      "90ee28bd-6f5d-41a8-9fed-cc554ad7616b",
      "936dad46-262f-4f08-ba1d-d3241d76ace8",
      "94dca04d-a06c-4d09-846e-4a610975785c",
      "97f7021f-85c6-4f8d-bc53-63ce72d3ef68",
      "9a76de2d-9005-490b-9ef2-656d94bd2997",
      "9e07518e-673e-419e-81b7-4af30f9d6c61",
      "a39ea055-dbf0-4c41-943d-eb0b048edfb8",
      "a5b85df5-0624-45a9-b9df-c9d5126557a7",
      "bd88fe6a-456d-4144-9cf3-90192bd1d533",
      "be64f0a1-0781-41f1-90ea-dbec3d48a830",
      "bee92eec-1e22-4493-bbe6-e88735e18266",
      "c1930ac6-7ab9-42f1-9410-6c51a4c5385c",
      "c7af13ae-b1b0-4e40-aad2-4d4e7d023ea2",
      "cab0e558-1979-4917-99c6-0a5eeee1a72c",
      "cf0d2527-fb56-4bf1-b65d-70e9af9d4906",
      "d569c138-a8e1-49ba-92c3-25dc3d80ca58",
      "d9aa4d02-86c2-42fb-ab3b-b17203d17718",
      "dbcf62bd-5b24-4ee8-9b96-ed85411c1d83",
      "de0c812e-e1b9-4be4-89a2-795b29a869a4",
      "df1e5b7f-1d5d-4737-9fb9-d5164d955503",
      "e05d6cf2-09cc-434f-8d76-13e2bcc7389b",
      "ee4e420c-fe18-4dfc-b7b3-a8593f41c6a2",
      "efedcffe-febf-4df1-949a-6b5c539faf71",
      "f2362d5b-13a0-4058-a4ea-b3752033de1b",
      "f6a9c2d1-3e92-423b-b91b-3ac8b4fdfc1c",
      "fda9ca04-58a2-4269-871c-464a1d4e127d",
      "ff7adef4-10e5-46eb-950e-3d6ceedf694a"
    ],
    "top_customers": [
      "Abbvie",
      "Aftia (altec)",
      "BMW",
      "BMW Attrition Risk Mitigation (With Eggs)",
      "Brightline"
    ],
    "summary_keywords": [
      "forms",
      "form",
      "discussed",
      "customer",
      "andy",
      "mayank",
      "team",
      "their"
    ],
    "evidence_snippets": [
      "*\n• *AEM Form Publishing and Loading Issues:* Andy Kluck, Mayank, Sakshi, and others discussed persistent issues with AEM forms not loading on the published QA website, despite working in the editor a",
      "*\n• *AEM Forms and Marketo Integration Demo:* Mayank, Shraddha, and Rahul presented a demo to Andy Kluck and Sarah Warzecha, showcasing the implementation of AEM Forms integrated with Marketo, includi",
      "*\n• *AEM Forms Integration with Adobe Experience Platform (AEP):* Harman, Mayank, and Katie Manarte discussed the end-to-end process of integrating AEM forms with Adobe Experience Platform, including ",
      "*\n• *AFV2 Guidebridge Enhancement:* Engineering deployed a private build enhancing guidebridge that enables the use-case of multiple forms on a single page; Customer to validate functionality.\n• *Vali",
      "*\n• *Agent UI Demonstration and Capabilities:* Harshit provided an in-depth demonstration of the Agent UI, highlighting features for editing, validating, and managing content fragments, PDF output and",
      "*\n• *Bulk Migration Need:* Customer highlighted the urgency to migrate ~1900 RIA forms from DocuSign to AEM; manual conversion (~2 hrs/form) is not scalable.\n• *Batch API Approach:* Engineering outlin",
      "*\n• *Capturing ECID, FBCLID, and GCLID in Marketo Forms:* Andy Kluck, Mayank, Arun, and others discussed the technical process and challenges of capturing ECID, FBCLID, and GCLID values in Marketo for",
      "*\n• *Feature Toggle and Bundle Configuration for Local Development:* Christy, Mayank, and Shraddha discussed the process for enabling feature toggles in local development, confirming that uploading th",
      "*\n• *Forms Conversion Progress:* Satya Deep provided an update on the conversion of 15 out of 19 forms, noting that some manual work is required to address gaps in the automated conversion process. Th",
      "*\n• *Implementation of Custom Functions for Tracking IDs:* Andy, Mayank, Speaker 1, and the team discussed the implementation of custom functions to capture Facebook click ID, Google click ID, and Ado",
      "*\n• *Marketing Team’s Transition from Digio to AEM Forms:* Chi, Amit, and Arun discussed the marketing team’s interest in replacing Digio with AEM Forms for fan experience activations, focusing on und",
      "*\n• *Newsletter Subscription Form Optimization Opportunity:* Rahul Kumar presented a new Site Optimizer opportunity related to the newsletter subscription form, explaining the low conversion rates and",
      "*\n• *Producer Usability Challenges with Adobe Forms:* Katie Manarte, supported by Rebecca and Vince, raised concerns to Mayank and Harman about the complexity of configuring Adobe Forms for producers,",
      "*\n• *Project Status and Migration Challenges:* Andy provided an update on the project's current state, highlighting issues encountered during the migration from QA to stage, particularly with form nam",
      "*\n• *Release Update:* Mayank updated the team that the new release is now available in the stage environment, and the older release has been pushed to the production environment to avoid blocking the ",
      "*\n• *Sandbox Environment Access:* Mayank requested access to the sandbox environment for himself, Satya Deep, and Yash. Raciel agreed to provide access to the dev environment and asked for their email",
      "*\n• *Testing and Validation of Custom Functions for ECID, FCLID, GCLID:* Andy, Mayank, Christy, and the team discussed ongoing testing of custom functions for ECID, FCLID, and GCLID, including the nee",
      "*\n• *Transition from Marketo to AEM Forms: Analytics Tracking:* Andy, Mayank, Heidi, Mark, and Jonathan discussed the transition from Marketo to AEM forms, focusing on ensuring analytics tracking (inc",
      "*\n• `Add address field below the first name field` not adding to desired location. We will have to implement this.\n• They wanted to enable form functionality across environments. They will be providin",
      "*\n• Customer discuss about mandatory and option forms.\n• The customer mentioned that, in addition to generating an XDP from the legacy PDF, they also need to create an Adaptive Form.\n•  They mentioned",
      "*\n• Customer had shared a use-case document listing down the requirements related wit forms and workflows.\n• Demoed them an approach that would be quick and easy to implement with the current customiz",
      "*\n• Customer Use case : \n    ◦ Total number of Forms : 20 \n    ◦ Future use case: Clark County has PDF forms and would like to migrate to web-based forms.\n    ◦ Customer would like to explore AEM form",
      "*\n• Forms Team showcased accessibility issues for few of their forms which had high traffic. \n• Shared the issues with Michelle which she will hand over to relevant team.\n• Michelle mentioned that the",
      "*\n• NFCU had a requirement where a 4 field form needs to submit to a Mulesoft API. During the call they shared that the requirement is that API is authenticated. <@U03Q109GQMT> quickly demonstrated th",
      "*\n• The customer was provided with a demo showcasing IC Cloud Editor and its capabilities in comparison to the existing on-premises editors.\n• The customer expressed positive feedback regarding the en",
      "*\n• Vijay showcased the latest innovations of IC on cloud with new structural change of json based storage and highlighted that most of the requested features by NFCU being delivered.\n• Showcased the ",
      "*\n• We showed how to create a servlet that integrates the OSGi service for rendering PDFs in a local setup. We had previously shared a private FAR for this via an Adobe CRM ticket, and Ashish from NFC",
      "*\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Arun, Martin, Christoph, and Sven discussed the decision to stop using EM forms and replace them with a cust",
      "*\n_AI-generated notes_\n\n*Key Topics:*\n• *Introduction:* Matthew, Arun, Vijay Kumar, and Chris from Adobe met with Laura, Dipesh Shrestha, and James from Centene to discuss the VIP project for implemen",
      "*\n*AI Model Integration and Pilot Testing Plans:* Vijay Kumar, Naveen, Andy, and Kalyan discussed the current status and next steps for integrating the AI model into product workflows, including the n",
      "*\n*Cloudflare Form Submission Routing and Security:* Andy Kluck, Christy, and Sarah Warzecha discussed the recent Cloudflare configuration that now globally routes form submissions correctly and block",
      "*\n*Current Document Generation flow*\n• The customer fetches JSON data from a web service (BPM tool used for account creation, which extracts form field data and persists it in a database).\n• JSON is t",
      "*\n*Discussion Agenda: New OOTB Marketo Connector*\n• Brad from the Spark NZ team highlighted a few minor issues and suggestions, including improvements to the Marketo Cloud Configuration screen and ens",
      "*\n*Discussion Summary:*\n1. ETA for FDM , render API and Rule Editor:\n    ◦ Communicated ETA: April\n2. ETA for New Feature Requests:\n    ◦ Signature Component: No ETA yet\n    ◦ Barcode (other than Code",
      "*\n*Discussion Summary*\n*Issues with the Editor:*\n1. *Fragment Width*: The fragment does not have the correct width when dropped on the canvas during document creation. This issue arises when the fragm",
      "*\n*ECID Deployment and Rule Editor Updates:* Shraddha, Christy, and Andy discussed the deployment status of the ECID code, with Christy confirming the ECID deployment is pending and planning to notify",
      "*\n*ECID Function Deployment and Rule Modification:* Shraddha updated Andy and Joseph on the deployment of the new ECID async function, which will require a subsequent rule modification once Christy de",
      "*\n*Forms License:* *Yes,  Cloud*\n*Primary Use Case:* Regulated Communication &amp; Adaptive Forms.\n*Adobe Products in Use:* Sites &amp; Assets\n*Attendees:* Betsy (VP), Naveen Sharma (Manager)\n\n\n*Curre",
      "*\n*Forms License:* *Yes, On-prem to Cloud*\n*Primary Use Case:* Adaptive Forms.\n*Adobe Products in Use:* Sites &amp; Assets\n*Attendees:* Joe George (Director), Shivendra Vikram Singh (Platform Manager)",
      "*\n*Lighthouse Program Overview:*\n• Amritabha provided an overview of the Lighthouse program initiated by the MD and CIO, Ramesh, which includes 16 programs, some of which involve Gen. AI use cases. \n*",
      "*\n*Major pain points for Customer that we need to handle in VIP Engagement:*\n• *Scalability Issues:* Scalability has been identified as a major challenge, it takes significant time and effort  to desi",
      "*\n*Meeting notes*\n\n*AEM Forms Local Development Environment Setup:* Christy, Mayank, Andy, and Shraddha discussed and collaboratively worked through the step-by-step process for setting up AEM Forms o",
      "*\n*Meeting notes*\n\n*Current Form Workflow and Demonstration:* Randy provided a detailed walkthrough of the current expenditure request form, explaining its workflow, user interactions, and technical l",
      "*\n*Partner* - Ghost Dynamics\n\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Manu, Vijay Kumar, Pritam, and Deepti discussed the New Zealand Ministry of Soci",
      "*\n*Use Case:*\n Abbvie intends to automatically save a draft whenever a form submission is triggered. They also want to implement a service that can query these drafts based on form type and timestamp ",
      "*\nAnirudh conducted demo for Json data (inline and as file) support in the Render APIs\n• Customer’s queries regarding supported options and formats for the APIs were addressed.\n• Discussion regarding ",
      "*\nAttendees\n• *Colin Vlasak* – Marketing Owner, Stericycle &amp; Shred-it\n• *Dillon Sorensen* – Colin’s Manager, Waste Management (parent company of Stericycle)\n\n*Meeting notes*\n\n*Explained Site Optim",
      "*\nCustomer is creating a new business division , Fedex-Freight. They have accenture as their partner who are implementing the forms for them. They are looking into creating multiple forms. They have f",
      "*\nDiscussion Summary with NFCU -\n1. *Font Subset Embedding:* NFCU requested the ability to embed font subsets during PDF preview. We clarified that this feature is available when generating PDFs using",
      "*\nHad a connect with Terry Mah for a new Forms opportunity\n• PWC (Chicago) wants to leverage Forms for their Audit process - worldwide with ~ 100K users\n• Render the form in headless mode in their .Ne",
      "*\nHad Meeting with NFCU Engineers (Ashish and Ashwairya).\n• NFCU is looking for dates for MVP features to their usecase primarily FDM, Render API, Basic Rules.\n• Informed them that by *May end* these ",
      "*\nIt was 1st Kickoff call for VIP but Jet2 decided to move VIP program to Next year Jan.\n\n\nJet2 team shared document during the meeting covering the *expectation and scope of VIP*.\n    ◦ Below is the ",
      "*\nMOM of today's call with GM\n• The 403 issue for the forms is resolved , it was related to allowing the edge domain in the referrer filters of publish. Now submission is getting processed to aem publ",
      "*\nNFCU went live with their first AF usecase\n<https://www.navyfederal.org/forms/lending/ccdr/ccdr.html>\n\nIn the meeting NFCU, highlighted few other requirements and they mentioned that there is good t",
      "*\nTFS - Existing IC customer on AMS had connect with Arun during Summit, where they are interested in Cloud based IC, as part of moving to Cloud.\n• 30% of their usecase is PDF generation - No issues i",
      "<@W4RSW3ECC>: The LPL ask is to have versioning in forms - they have heard somewhere and want to know how they can use it .\n\n<@W4XTCQ07J>: LPL team wants some recommendation from our side : for follow",
      "<@W4XTCQ07J> here are some more\n\n• The MTAB app is used to open 70–80K job cards daily. It is English-only and built on Native tech. The typical update cycle of app is ~1/month. The backend is Java + ",
      "<@WAM5KDYBZ> There are documentation improvements which are required for simpler cases. For Carpenter their developer was not an expert - and content was not easy for him. He performed some steps - wh",
      "Agree. This was an early pitch for Sales and we can recommend the same once they plan to move ahead. More details from the meeting:\n• Their forms had a requirement to generate *Document of Record* (cu",
      "Form Urls of each category\n\n<https://www.jet2holidays.com/request-a-callback>\n<https://www.jet2holidays.com/penguin>\n<https://www.jet2holidays.com/contact-us/returned/makeacomplaint>\n<https://www.jet2",
      "Misunderstood the requirement, they just want to list the forms similar to JPMC. In that case, they can make use of the API directly",
      "Shameem/Kevin would be connecting with Shivendra and confirming on the next steps (Shivendra had to drop after 30 mins for another meeting).\n\nThough Shivendra did mention that he had a connect for Sit"
    ],
    "score": 6930
  },
  {
    "theme": "Integrations - request",
    "primary_theme": "Integrations",
    "feature": "Forms",
    "category": "request",
    "report_count": 44,
    "customer_count": 18,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:53.095Z",
    "evidence_signal_ids": [
      "0458faaa-b2e6-4053-b593-b7e57c517394",
      "0a148c3d-693b-4a06-9b5e-ad0834ea95ba",
      "1e95c441-0e8c-42e1-802e-47f22bcbef7f",
      "275d08c4-4660-4792-896e-143c1a056242",
      "3d99d3d2-9013-48d6-b219-e5af7e4dc5dc",
      "48aa1db6-f410-43eb-945f-e0c045e806c1",
      "4c9175b6-8416-4793-9ff9-6d2554c340cd",
      "52b7cd92-7473-4001-afe1-e9960f94645d",
      "596c0b77-e087-4418-9dec-ddc5d012f5de",
      "5c0b47f9-f9b4-4e94-a9e5-bcda046dd256",
      "72455d58-f04b-49c5-8336-cac13a686f66",
      "72f2ccec-566d-45d7-809f-e7f5344addf6",
      "750d12ce-bb52-4368-8973-f35ff3b0053f",
      "75aae6a2-1b74-411c-b2b4-678819b1e289",
      "769f54a0-5c8d-41c4-b1d2-de9e597b8a36",
      "7949e7df-8d98-4a20-bd44-d9a08c9ff2f6",
      "87e583e0-5040-4bba-afe7-58cb3154df96",
      "87fd1a08-8874-44d9-8944-b3fd636b8479",
      "8a24808a-3b51-42de-965d-3dc57a07f30d",
      "8bd34303-cc5a-48dc-a1b3-d43b8efac278",
      "8c93e9ca-06be-4334-8951-a921f94909a1",
      "906ee0db-a886-404e-8ddf-09c5e262b233",
      "90ee28bd-6f5d-41a8-9fed-cc554ad7616b",
      "94dca04d-a06c-4d09-846e-4a610975785c",
      "97f7021f-85c6-4f8d-bc53-63ce72d3ef68",
      "a39ea055-dbf0-4c41-943d-eb0b048edfb8",
      "a5b85df5-0624-45a9-b9df-c9d5126557a7",
      "b77941b7-45fb-4fd6-a25e-53eec6ccaf50",
      "be64f0a1-0781-41f1-90ea-dbec3d48a830",
      "ca1546db-588d-4bb2-8734-fb8d0434be84",
      "cab0e558-1979-4917-99c6-0a5eeee1a72c",
      "cf0d2527-fb56-4bf1-b65d-70e9af9d4906",
      "d9aa4d02-86c2-42fb-ab3b-b17203d17718",
      "dbcf62bd-5b24-4ee8-9b96-ed85411c1d83",
      "de0c812e-e1b9-4be4-89a2-795b29a869a4",
      "efedcffe-febf-4df1-949a-6b5c539faf71",
      "f2362d5b-13a0-4058-a4ea-b3752033de1b",
      "fda9ca04-58a2-4269-871c-464a1d4e127d",
      "ff7adef4-10e5-46eb-950e-3d6ceedf694a"
    ],
    "top_customers": [
      "Abbvie",
      "BMW",
      "BMW Attrition Risk Mitigation (With Eggs)",
      "Brightline",
      "Brunswich"
    ],
    "summary_keywords": [
      "forms",
      "form",
      "discussed",
      "andy",
      "mayank",
      "ecid",
      "marketo",
      "christy"
    ],
    "evidence_snippets": [
      "• The content is refreshed every 6 months related to their bi-annual fiscal reports\n• Currently produced in house in a powerpoint format; much of it is manually created, but financial numbers are API'",
      "*\n• *AEM Form Integration and Hidden Fields Issue:* Andy Kluck, Mayank, Devendra, and Sudhanshu discussed the problem of hidden fields and conditional rules not transferring from the adaptive form to ",
      "*\n• *AEM Forms and Marketo Integration Demo:* Mayank, Shraddha, and Rahul presented a demo to Andy Kluck and Sarah Warzecha, showcasing the implementation of AEM Forms integrated with Marketo, includi",
      "*\n• *AEM Forms Integration with Adobe Experience Platform (AEP):* Harman, Mayank, and Katie Manarte discussed the end-to-end process of integrating AEM forms with Adobe Experience Platform, including ",
      "*\n• *Agent UI Demonstration and Capabilities:* Harshit provided an in-depth demonstration of the Agent UI, highlighting features for editing, validating, and managing content fragments, PDF output and",
      "*\n• *Bulk Migration Need:* Customer highlighted the urgency to migrate ~1900 RIA forms from DocuSign to AEM; manual conversion (~2 hrs/form) is not scalable.\n• *Batch API Approach:* Engineering outlin",
      "*\n• *Capturing ECID, FBCLID, and GCLID in Marketo Forms:* Andy Kluck, Mayank, Arun, and others discussed the technical process and challenges of capturing ECID, FBCLID, and GCLID values in Marketo for",
      "*\n• *Feature Toggle and Bundle Configuration for Local Development:* Christy, Mayank, and Shraddha discussed the process for enabling feature toggles in local development, confirming that uploading th",
      "*\n• *Forms Conversion Progress:* Satya Deep provided an update on the conversion of 15 out of 19 forms, noting that some manual work is required to address gaps in the automated conversion process. Th",
      "*\n• *Implementation of Custom Functions for Tracking IDs:* Andy, Mayank, Speaker 1, and the team discussed the implementation of custom functions to capture Facebook click ID, Google click ID, and Ado",
      "*\n• *Marketing Team’s Transition from Digio to AEM Forms:* Chi, Amit, and Arun discussed the marketing team’s interest in replacing Digio with AEM Forms for fan experience activations, focusing on und",
      "*\n• *Newsletter Subscription Form Optimization Opportunity:* Rahul Kumar presented a new Site Optimizer opportunity related to the newsletter subscription form, explaining the low conversion rates and",
      "*\n• *Project Status and Migration Challenges:* Andy provided an update on the project's current state, highlighting issues encountered during the migration from QA to stage, particularly with form nam",
      "*\n• *Sandbox Environment Access:* Mayank requested access to the sandbox environment for himself, Satya Deep, and Yash. Raciel agreed to provide access to the dev environment and asked for their email",
      "*\n• *Testing and Validation of Custom Functions for ECID, FCLID, GCLID:* Andy, Mayank, Christy, and the team discussed ongoing testing of custom functions for ECID, FCLID, and GCLID, including the nee",
      "*\n• *Transition from Marketo to AEM Forms: Analytics Tracking:* Andy, Mayank, Heidi, Mark, and Jonathan discussed the transition from Marketo to AEM forms, focusing on ensuring analytics tracking (inc",
      "*\n• NFCU had a requirement where a 4 field form needs to submit to a Mulesoft API. During the call they shared that the requirement is that API is authenticated. <@U03Q109GQMT> quickly demonstrated th",
      "*\n• Vijay showcased the latest innovations of IC on cloud with new structural change of json based storage and highlighted that most of the requested features by NFCU being delivered.\n• Showcased the ",
      "*\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Arun, Martin, Christoph, and Sven discussed the decision to stop using EM forms and replace them with a cust",
      "*\n*AI Model Integration and Pilot Testing Plans:* Vijay Kumar, Naveen, Andy, and Kalyan discussed the current status and next steps for integrating the AI model into product workflows, including the n",
      "*\n*Cloudflare Form Submission Routing and Security:* Andy Kluck, Christy, and Sarah Warzecha discussed the recent Cloudflare configuration that now globally routes form submissions correctly and block",
      "*\n*Current Document Generation flow*\n• The customer fetches JSON data from a web service (BPM tool used for account creation, which extracts form field data and persists it in a database).\n• JSON is t",
      "*\n*Discussion Agenda: New OOTB Marketo Connector*\n• Brad from the Spark NZ team highlighted a few minor issues and suggestions, including improvements to the Marketo Cloud Configuration screen and ens",
      "*\n*Discussion Summary:*\n1. ETA for FDM , render API and Rule Editor:\n    ◦ Communicated ETA: April\n2. ETA for New Feature Requests:\n    ◦ Signature Component: No ETA yet\n    ◦ Barcode (other than Code",
      "*\n*ECID Deployment and Rule Editor Updates:* Shraddha, Christy, and Andy discussed the deployment status of the ECID code, with Christy confirming the ECID deployment is pending and planning to notify",
      "*\n*ECID Function Deployment and Rule Modification:* Shraddha updated Andy and Joseph on the deployment of the new ECID async function, which will require a subsequent rule modification once Christy de",
      "*\n*Forms License:* *Yes,  Cloud*\n*Primary Use Case:* Regulated Communication &amp; Adaptive Forms.\n*Adobe Products in Use:* Sites &amp; Assets\n*Attendees:* Betsy (VP), Naveen Sharma (Manager)\n\n\n*Curre",
      "*\n*Major pain points for Customer that we need to handle in VIP Engagement:*\n• *Scalability Issues:* Scalability has been identified as a major challenge, it takes significant time and effort  to desi",
      "*\n*Meeting notes*\n\n*AEM Forms Local Development Environment Setup:* Christy, Mayank, Andy, and Shraddha discussed and collaboratively worked through the step-by-step process for setting up AEM Forms o",
      "*\n*Meeting notes*\n\n*Current Form Workflow and Demonstration:* Randy provided a detailed walkthrough of the current expenditure request form, explaining its workflow, user interactions, and technical l",
      "*\nAnirudh conducted demo for Json data (inline and as file) support in the Render APIs\n• Customer’s queries regarding supported options and formats for the APIs were addressed.\n• Discussion regarding ",
      "*\nAttendees\n• Shameem Gouse Lazam Sayyad\n• Shivendra Vikram Singh\n• Kevin Ausburn\nMeeting Notes:\n\n*Introduction:* The team had some knowledge of Sites Optimizer and gave them an introduction of the Fo",
      "*\nDiscussion Summary with NFCU -\n1. *Font Subset Embedding:* NFCU requested the ability to embed font subsets during PDF preview. We clarified that this feature is available when generating PDFs using",
      "*\nHad a connect with Terry Mah for a new Forms opportunity\n• PWC (Chicago) wants to leverage Forms for their Audit process - worldwide with ~ 100K users\n• Render the form in headless mode in their .Ne",
      "*\nHad Meeting with NFCU Engineers (Ashish and Ashwairya).\n• NFCU is looking for dates for MVP features to their usecase primarily FDM, Render API, Basic Rules.\n• Informed them that by *May end* these ",
      "<@U0213T59LMN> NFCU is seeking an update on the same, I have included you in the email, need to share a sample implementation on their usecase\n1. Member submits the Form with the data, initial validat",
      "<@WE163TH43> Do they now have any clarity on how the remote service they want to use with FDM is designed?  In the last meeting, they mentioned it was still unclear to them.\n\nI have already shared the",
      "<@WLWHN4TV3> As of now they are not aware of it but they mentioned that service exposes rest API end point. Let me know what additional information you need I can get that tomorrow.",
      "Misunderstood the requirement, they just want to list the forms similar to JPMC. In that case, they can make use of the API directly"
    ],
    "score": 2376
  },
  {
    "theme": "Migration - request",
    "primary_theme": "Migration",
    "feature": "Forms",
    "category": "request",
    "report_count": 36,
    "customer_count": 15,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:52.042Z",
    "evidence_signal_ids": [
      "0458faaa-b2e6-4053-b593-b7e57c517394",
      "0a9d7978-26fa-4916-9a0c-8bb9ff7c6787",
      "11e6a0f8-960f-4fbf-9e93-8f5720fc3adc",
      "1b8ddbb2-319e-4256-8da1-e0d03ae0fec0",
      "275d08c4-4660-4792-896e-143c1a056242",
      "2a020038-1bf8-4f61-8079-e0bea4ba1892",
      "395b7219-0fd1-4689-8639-540416599d59",
      "47d60f96-2641-4110-84c7-df8e7f8bbefa",
      "48aa1db6-f410-43eb-945f-e0c045e806c1",
      "596c0b77-e087-4418-9dec-ddc5d012f5de",
      "5c0b47f9-f9b4-4e94-a9e5-bcda046dd256",
      "607667a4-b5ed-4ac0-bd86-232d6515b438",
      "750d12ce-bb52-4368-8973-f35ff3b0053f",
      "769f54a0-5c8d-41c4-b1d2-de9e597b8a36",
      "7949e7df-8d98-4a20-bd44-d9a08c9ff2f6",
      "87fd1a08-8874-44d9-8944-b3fd636b8479",
      "89d033be-0d49-4b77-afbf-f09488868c23",
      "8b3f87e0-5a39-4223-9c02-0c23869855c1",
      "90ee28bd-6f5d-41a8-9fed-cc554ad7616b",
      "97f7021f-85c6-4f8d-bc53-63ce72d3ef68",
      "9a76de2d-9005-490b-9ef2-656d94bd2997",
      "9e07518e-673e-419e-81b7-4af30f9d6c61",
      "a5b85df5-0624-45a9-b9df-c9d5126557a7",
      "bd88fe6a-456d-4144-9cf3-90192bd1d533",
      "c1930ac6-7ab9-42f1-9410-6c51a4c5385c",
      "cf0d2527-fb56-4bf1-b65d-70e9af9d4906",
      "d41b167a-3c88-47c6-8c0e-7e77ce441570",
      "dbcf62bd-5b24-4ee8-9b96-ed85411c1d83",
      "ee4e420c-fe18-4dfc-b7b3-a8593f41c6a2",
      "f50750f1-ecd6-4f52-a64c-8d1b839878e3",
      "f6a9c2d1-3e92-423b-b91b-3ac8b4fdfc1c",
      "fda9ca04-58a2-4269-871c-464a1d4e127d"
    ],
    "top_customers": [
      "Abbvie",
      "Brunswick",
      "Carpenter",
      "Celestyal",
      "Clark County"
    ],
    "summary_keywords": [
      "forms",
      "customer",
      "form",
      "case",
      "conversion",
      "current",
      "issues",
      "team"
    ],
    "evidence_snippets": [
      "*\n• *AFV2 Guidebridge Enhancement:* Engineering deployed a private build enhancing guidebridge that enables the use-case of multiple forms on a single page; Customer to validate functionality.\n• *Vali",
      "*\n• *Bulk Migration Need:* Customer highlighted the urgency to migrate ~1900 RIA forms from DocuSign to AEM; manual conversion (~2 hrs/form) is not scalable.\n• *Batch API Approach:* Engineering outlin",
      "*\n• *Feature Toggle and Bundle Configuration for Local Development:* Christy, Mayank, and Shraddha discussed the process for enabling feature toggles in local development, confirming that uploading th",
      "*\n• *Forms Conversion Progress:* Satya Deep provided an update on the conversion of 15 out of 19 forms, noting that some manual work is required to address gaps in the automated conversion process. Th",
      "*\n• *Newsletter Subscription Form Optimization Opportunity:* Rahul Kumar presented a new Site Optimizer opportunity related to the newsletter subscription form, explaining the low conversion rates and",
      "*\n• *Project Status and Migration Challenges:* Andy provided an update on the project's current state, highlighting issues encountered during the migration from QA to stage, particularly with form nam",
      "*\n• *Release Update:* Mayank updated the team that the new release is now available in the stage environment, and the older release has been pushed to the production environment to avoid blocking the ",
      "*\n• *Sandbox Environment Access:* Mayank requested access to the sandbox environment for himself, Satya Deep, and Yash. Raciel agreed to provide access to the dev environment and asked for their email",
      "*\n• *Transition from Marketo to AEM Forms: Analytics Tracking:* Andy, Mayank, Heidi, Mark, and Jonathan discussed the transition from Marketo to AEM forms, focusing on ensuring analytics tracking (inc",
      "*\n• Customer discuss about mandatory and option forms.\n• The customer mentioned that, in addition to generating an XDP from the legacy PDF, they also need to create an Adaptive Form.\n•  They mentioned",
      "*\n• Customer Use case : \n    ◦ Total number of Forms : 20 \n    ◦ Future use case: Clark County has PDF forms and would like to migrate to web-based forms.\n    ◦ Customer would like to explore AEM form",
      "*\n• Forms Team showcased accessibility issues for few of their forms which had high traffic. \n• Shared the issues with Michelle which she will hand over to relevant team.\n• Michelle mentioned that the",
      "*\n• NFCU had a requirement where a 4 field form needs to submit to a Mulesoft API. During the call they shared that the requirement is that API is authenticated. <@U03Q109GQMT> quickly demonstrated th",
      "*\n• The customer was provided with a demo showcasing IC Cloud Editor and its capabilities in comparison to the existing on-premises editors.\n• The customer expressed positive feedback regarding the en",
      "*\n• We showed how to create a servlet that integrates the OSGi service for rendering PDFs in a local setup. We had previously shared a private FAR for this via an Adobe CRM ticket, and Ashish from NFC",
      "*\n*AI Model Integration and Pilot Testing Plans:* Vijay Kumar, Naveen, Andy, and Kalyan discussed the current status and next steps for integrating the AI model into product workflows, including the n",
      "*\n*Current Document Generation flow*\n• The customer fetches JSON data from a web service (BPM tool used for account creation, which extracts form field data and persists it in a database).\n• JSON is t",
      "*\n*Discussion Summary*\n*Issues with the Editor:*\n1. *Fragment Width*: The fragment does not have the correct width when dropped on the canvas during document creation. This issue arises when the fragm",
      "*\n*ECID Function Deployment and Rule Modification:* Shraddha updated Andy and Joseph on the deployment of the new ECID async function, which will require a subsequent rule modification once Christy de",
      "*\n*Forms License:* *Yes,  Cloud*\n*Primary Use Case:* Regulated Communication &amp; Adaptive Forms.\n*Adobe Products in Use:* Sites &amp; Assets\n*Attendees:* Betsy (VP), Naveen Sharma (Manager)\n\n\n*Curre",
      "*\n*Forms License:* *Yes, On-prem to Cloud*\n*Primary Use Case:* Adaptive Forms.\n*Adobe Products in Use:* Sites &amp; Assets\n*Attendees:* Joe George (Director), Shivendra Vikram Singh (Platform Manager)",
      "*\n*Major pain points for Customer that we need to handle in VIP Engagement:*\n• *Scalability Issues:* Scalability has been identified as a major challenge, it takes significant time and effort  to desi",
      "*\n*Meeting notes*\n\n*Current Form Workflow and Demonstration:* Randy provided a detailed walkthrough of the current expenditure request form, explaining its workflow, user interactions, and technical l",
      "*\nAttendees\n• *Colin Vlasak* – Marketing Owner, Stericycle &amp; Shred-it\n• *Dillon Sorensen* – Colin’s Manager, Waste Management (parent company of Stericycle)\n\n*Meeting notes*\n\n*Explained Site Optim",
      "*\nAttendees\n• Shameem Gouse Lazam Sayyad\n• Shivendra Vikram Singh\n• Kevin Ausburn\nMeeting Notes:\n\n*Introduction:* The team had some knowledge of Sites Optimizer and gave them an introduction of the Fo",
      "*\nTom Sonntag (TAM) reached out: FirstBank team reached out to me to continue working towards their migration of Forms to CC.\n\nI have requested details on number of forms, and if possible the URLs of ",
      "<@W4R5LUPK3>, <@W4XTCQ07J> - LPL is looking for versioning support for XDP and <@W5HEU5M7Y> committed Nov.\n\n<@U0213T59LMN>, <@W4RU5J3JR>, <@U03N27GAZDZ> - We need to collect and document *best practic",
      "Agree. This was an early pitch for Sales and we can recommend the same once they plan to move ahead. More details from the meeting:\n• Their forms had a requirement to generate *Document of Record* (cu",
      "Good use case, thanks for sharing in details.\nOptions:\n1. Ask them to move to xdp and get rid of Siesmic and use pdf for download which is better perhaps.. If they want the users to change the content",
      "I suspect this will be a long-ish engagement  - lets pls write use cases on doc/wiki. IIRC, there were 2 use cases - one where they are using 3rd party app for data capture and using output for pdf ge",
      "Tested a *workaround solution* for the XDP versioning feature via the versioning capabilities within *Assets*, and that is working as expected.\n*Workaround Steps followed:*\n1. Upload the initial custo",
      "Yes, HDFC Bank had around 300 PDF which they wanted to convert and capture data via browser so we suggested them HTML Forms ( Mobile Forms)."
    ],
    "score": 1620
  },
  {
    "theme": "Data Binding - request",
    "primary_theme": "Data Binding",
    "feature": "Data Binding",
    "category": "request",
    "report_count": 36,
    "customer_count": 14,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:49.452Z",
    "evidence_signal_ids": [
      "0ab17f16-0541-4ae3-94f1-cba7efaec76f",
      "13a337b0-6143-4d0d-b7a4-14cb393a6503",
      "1729cc54-2893-44ef-b487-66b1bca67fa5",
      "1cd08c2a-b46f-4273-a989-d45804bfd4ae",
      "2878ad82-05fb-421d-b9ab-cb936e27f7c6",
      "2a65bd37-8089-4d44-8e85-69255352ddf6",
      "330d1738-55b8-4c0b-86b9-881d18a24d9d",
      "35e210d5-fda2-46b5-9d58-200fb4db8d09",
      "50bcb622-d35e-40da-8c21-8323530d4efd",
      "535dba0c-ec81-46f1-9020-35fbd99b58ec",
      "568c235e-f84a-4ef1-94b9-a05a59a0448b",
      "56c62bb6-3d00-4fa1-98bb-27e4d39b4fb7",
      "62846e6e-5a50-4ba3-b895-42d9d87674c5",
      "654bce47-d875-40c6-8b58-82d1b0ce5322",
      "77e635a2-13d6-48fd-8f13-52077ed0e2d5",
      "7b4812a1-b67e-4da5-8729-973b231e8b61",
      "7d05baf0-4b53-451b-94c7-ba396ffee6f7",
      "86121a51-20d1-4818-8237-bcb96f1cbe68",
      "8f1c9649-c6a1-4652-a0ef-d9d3a3d5ec42",
      "96ad4f6a-adab-4274-9c4d-2b8532c2d30e",
      "97dbdf29-59a3-4ac3-addc-c4ead1354cb3",
      "9c0466c4-bab2-4210-9f29-e71d11a9a1f2",
      "b32b4ab5-bdef-4190-88d9-138238c31169",
      "b75128b3-f401-443c-b4c3-9964aadf5c4b",
      "bd1243fd-0607-4301-adda-4c0a40dbb93c",
      "d7704f37-98be-4f08-b6a8-b324bb10f0a0",
      "e18685ab-e6a9-40e8-b1c9-d2612858c7d0",
      "e202eea5-7a3d-4c3c-a76f-edcd24b140c5",
      "e61ab822-9fbc-4de5-99b5-09a988994725",
      "e6b49d54-357d-46d6-9ba6-898e1848cdcf",
      "f4ea6951-e01e-4e78-a4eb-2a57b716b9f6",
      "ff3de2a2-1fbb-47e0-995e-19bc506e600d"
    ],
    "top_customers": [
      "Brightline",
      "Charles Schwab",
      "GM Financial",
      "IRS (DMAF account)",
      "IRS Meeting"
    ],
    "summary_keywords": [
      "data",
      "meeting",
      "want",
      "nfcu",
      "their",
      "customer",
      "need",
      "forms"
    ],
    "evidence_snippets": [
      "*\n• *PDF Conversion and Sync Code:* Mayank and Andy discussed the recent fixes and updates related to PDF conversion, including the need to keep the browser open during the process. Mayank mentioned t",
      "*\n• Anirudh conducted detailed walkthrough for the Render APIs (picking up from the last meeting).\n    ◦ First-cut API definition was shared beforehand with the customer with the documentation links f",
      "*\n• Customer acknowledged the timelines shared by Sunny for the requirements.\n• Customer was provided a demo for the pre-filling of the realtime data from FDM while invoking render PDF IC.\n• Team shar",
      "*\n• Internal meeting - after Emily connected with Accenture Federal\n• They shared an update that they have ~ 200 forms to be modernised, the actual forms are yet to be finalized\n• They want to identif",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Arun, Ajani, and Mayank discussed the Lenovo use cases, focusing on progressive profiling, globa",
      "*\n*Below is the meeting summary:*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n",
      "*\n*Customer Summary: GMF*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n• Curren",
      "*\n*Discussion Summary*\n\n*Issues with the Editor*\n1. *Resolved Issues:*\n    ◦ NFCU has confirmed that the earlier issues related to Fragment Width and PDF Preview have been fixed.\n2. *Pending Issues:*\n",
      "*\n*Dynamic Client Letter Generation Use Case:* Naveen Sharma described the need to generate dynamic client letters reflecting account changes, and discussed with Chris how Adobe tools could support a ",
      "*\n*Meeting notes (AI generated)*\n\n*Custom File Attachment Component Demo*: Shivam and Pankaj demonstrated the custom file attachment component, explaining its functionality and how it uploads files di",
      "*\n*Meeting Summary – Verizon Discussion on Document Generation and AEM Capabilities*\n\n*Current Vendor Landscape and Business Need*\n• *Verizon* is currently operating as an on-premise site customer.\n• ",
      "*\n*Meeting Summary*\nWe had a productive discussion regarding the issues NFCU is facing and their use cases. Below are the key discussion points:\n1. *Data Binding Workflow:*\n    ◦ Provided a detailed e",
      "*\n*Meeting Summary* – NFCU Requirements Review\n\nNFCU has shared an Excel sheet outlining their requirements and identifying gaps in the current Interactive Communication (IC) Editor. The we have revie",
      "*\n*Meeting Summary* - Key Discussion Points:\n1. *Real-Time Data Usage During Authoring:*\n    ◦ NFCU expressed interest in using real-time data during the authoring process.\n    ◦ It was suggested that",
      "*\n*Q2’25 (opportunity)*\n*SunPharma side - Sr Director (IT)* \nAdobe side - Solution COnsulting team - Chinmay and Navin\n*Partner - Depth (may be)*\n*Metrics:* \n• *100+ forms*\n• *20-30k submissions per y",
      "*\nCustomers:\n• Martin, George\n• Muravitsky, Valerie\n• Petty, Michael\n• Teague, Stephanie\n• Kolluru, Abhishek\n• Paracka, Jacob J\n*Installation*: On Prem\n\n*Background:* We had a meeting with the custome",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Adaptive Forms Creation:* Ellen explained the process of creating adaptive forms, highlighting the need to support multiple langua",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Current Forms Environment and Integration Challenges:* Tony J Fenner, Stephen, Brad R Tuckner, and John described the current form",
      "*\nIn last night meeting with NFCU, they highlighted 2 requirements which are critical for their upcoming golive plans in Oct\n1. Support of IC rendering API to take data.json as input, they want simila",
      "*\nIn the meeting, we provided a comprehensive walkthrough of the newly introduced features and discussed each in detail. The key features covered include:\n• Template creation workflow\n• Fragments &amp",
      "*\nMoM:\n• Discussion focused on the issues raised by GMF team (shared over mail)\n    ◦ Vijay and Sufyan helped answer most of the queries around IC-Editor\n• Anirudh conducted partial demo for Render AP",
      "*\nSession was to cover:\n• Access to Cloud instance (pending access from last meeting). We would be working on the Dev instance.\n• They want to create CC based forms - discussed if they want to have st",
      "&gt; Pre-rendering scenario - NFCU wants pdf preview with filtered data, which they get from FDM. They want to render only a section of a template using the part of data they select.\nIf the aim is to ",
      "&gt; Support for AEP &amp; AJO Connectors for data ingestion - Adobe team needs to share details/documentation for this\nIts mentioned as data ingestion but it will more of prefill rite?",
      "As per the discussion they are writing their own servelet from where they want to call IC render api with json data.\nI don't think they want to configure prefill via fdm.",
      "For Pre-rendering scenario - they already have one UI at their to do data filtering and they want to get the data from fdm and list sections present in data and they do preview with selected data from",
      "fyi,\nCustomer still didn't have clear understanding how the web service they are designing (for fetching data via FDM) will work and if it will have capability to filter data or not. I would like to w",
      "I guess that can be handled with FDM via custom prefill service. FDM provides a lot of goodness at its own level. Taking data directly as part of API will lead us to redo a lot of work which FDM alrea",
      "I have clarified the requirements with NFCU regarding their intended use of JSON schema. They have confirmed that their use case specifically involves utilizing their own JSON schema for data binding.",
      "Need to look into their form to analyze how big they are ? MF fits all the criteria (except prefill, which if they are not using name bindings, can be solved as well).\n\nHow many requests do they handl",
      "Pre-rendering scenario -  NFCU wants pdf preview with filtered data, which they get from FDM. They want to render only a section of a template using the part of data they select.\n\nPost-rendering scena",
      "Thanks <@WE163TH43>, Agree need more simplification or segregation here between the 2 binding approaches.\n&gt; Identified the need for improved UX to show different data binding options for text boxes"
    ],
    "score": 1512
  },
  {
    "theme": "Rendering & PDF - request",
    "primary_theme": "Rendering & PDF",
    "feature": "Forms",
    "category": "request",
    "report_count": 29,
    "customer_count": 13,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:52.042Z",
    "evidence_signal_ids": [
      "023eb1e1-c371-4aa0-9e53-855ad42f86a3",
      "1b8ddbb2-319e-4256-8da1-e0d03ae0fec0",
      "27c0e668-a599-45a2-a206-831ae2693190",
      "2a020038-1bf8-4f61-8079-e0bea4ba1892",
      "395b7219-0fd1-4689-8639-540416599d59",
      "47d60f96-2641-4110-84c7-df8e7f8bbefa",
      "5c0b47f9-f9b4-4e94-a9e5-bcda046dd256",
      "72455d58-f04b-49c5-8336-cac13a686f66",
      "750d12ce-bb52-4368-8973-f35ff3b0053f",
      "8a24808a-3b51-42de-965d-3dc57a07f30d",
      "8c93e9ca-06be-4334-8951-a921f94909a1",
      "906ee0db-a886-404e-8ddf-09c5e262b233",
      "90ee28bd-6f5d-41a8-9fed-cc554ad7616b",
      "97f7021f-85c6-4f8d-bc53-63ce72d3ef68",
      "9a76de2d-9005-490b-9ef2-656d94bd2997",
      "9e07518e-673e-419e-81b7-4af30f9d6c61",
      "c1930ac6-7ab9-42f1-9410-6c51a4c5385c",
      "cf0d2527-fb56-4bf1-b65d-70e9af9d4906",
      "d9aa4d02-86c2-42fb-ab3b-b17203d17718",
      "dbcf62bd-5b24-4ee8-9b96-ed85411c1d83",
      "de0c812e-e1b9-4be4-89a2-795b29a869a4",
      "f2362d5b-13a0-4058-a4ea-b3752033de1b",
      "f50750f1-ecd6-4f52-a64c-8d1b839878e3",
      "f6a9c2d1-3e92-423b-b91b-3ac8b4fdfc1c",
      "fda9ca04-58a2-4269-871c-464a1d4e127d",
      "ff7adef4-10e5-46eb-950e-3d6ceedf694a"
    ],
    "top_customers": [
      "BMW",
      "BMW Attrition Risk Mitigation (With Eggs)",
      "Clark County",
      "CoreBridge (prospective customer)",
      "Corebridge / GenerationStation (demoed)"
    ],
    "summary_keywords": [
      "forms",
      "customer",
      "form",
      "their",
      "nfcu",
      "environment",
      "data",
      "conversion"
    ],
    "evidence_snippets": [
      "*\n• *Agent UI Demonstration and Capabilities:* Harshit provided an in-depth demonstration of the Agent UI, highlighting features for editing, validating, and managing content fragments, PDF output and",
      "*\n• *Bulk Migration Need:* Customer highlighted the urgency to migrate ~1900 RIA forms from DocuSign to AEM; manual conversion (~2 hrs/form) is not scalable.\n• *Batch API Approach:* Engineering outlin",
      "*\n• *Forms Conversion Progress:* Satya Deep provided an update on the conversion of 15 out of 19 forms, noting that some manual work is required to address gaps in the automated conversion process. Th",
      "*\n• *Release Update:* Mayank updated the team that the new release is now available in the stage environment, and the older release has been pushed to the production environment to avoid blocking the ",
      "*\n• *Sandbox Environment Access:* Mayank requested access to the sandbox environment for himself, Satya Deep, and Yash. Raciel agreed to provide access to the dev environment and asked for their email",
      "*\n• Customer discuss about mandatory and option forms.\n• The customer mentioned that, in addition to generating an XDP from the legacy PDF, they also need to create an Adaptive Form.\n•  They mentioned",
      "*\n• Customer Use case : \n    ◦ Total number of Forms : 20 \n    ◦ Future use case: Clark County has PDF forms and would like to migrate to web-based forms.\n    ◦ Customer would like to explore AEM form",
      "*\n• NFCU had a requirement where a 4 field form needs to submit to a Mulesoft API. During the call they shared that the requirement is that API is authenticated. <@U03Q109GQMT> quickly demonstrated th",
      "*\n• Vijay showcased the latest innovations of IC on cloud with new structural change of json based storage and highlighted that most of the requested features by NFCU being delivered.\n• Showcased the ",
      "*\n• We showed how to create a servlet that integrates the OSGi service for rendering PDFs in a local setup. We had previously shared a private FAR for this via an Adobe CRM ticket, and Ashish from NFC",
      "*\n_AI-generated content. Make sure to check for accuracy._\n\n*Key Topics:*\n• *Introduction:* Arun, Martin, Christoph, and Sven discussed the decision to stop using EM forms and replace them with a cust",
      "*\n*Current Document Generation flow*\n• The customer fetches JSON data from a web service (BPM tool used for account creation, which extracts form field data and persists it in a database).\n• JSON is t",
      "*\n*Discussion Summary:*\n1. ETA for FDM , render API and Rule Editor:\n    ◦ Communicated ETA: April\n2. ETA for New Feature Requests:\n    ◦ Signature Component: No ETA yet\n    ◦ Barcode (other than Code",
      "*\n*Discussion Summary*\n*Issues with the Editor:*\n1. *Fragment Width*: The fragment does not have the correct width when dropped on the canvas during document creation. This issue arises when the fragm",
      "*\n*Forms License:* *Yes,  Cloud*\n*Primary Use Case:* Regulated Communication &amp; Adaptive Forms.\n*Adobe Products in Use:* Sites &amp; Assets\n*Attendees:* Betsy (VP), Naveen Sharma (Manager)\n\n\n*Curre",
      "*\n*Major pain points for Customer that we need to handle in VIP Engagement:*\n• *Scalability Issues:* Scalability has been identified as a major challenge, it takes significant time and effort  to desi",
      "*\nAnirudh conducted demo for Json data (inline and as file) support in the Render APIs\n• Customer’s queries regarding supported options and formats for the APIs were addressed.\n• Discussion regarding ",
      "*\nDiscussion Summary with NFCU -\n1. *Font Subset Embedding:* NFCU requested the ability to embed font subsets during PDF preview. We clarified that this feature is available when generating PDFs using",
      "*\nHad a connect with Terry Mah for a new Forms opportunity\n• PWC (Chicago) wants to leverage Forms for their Audit process - worldwide with ~ 100K users\n• Render the form in headless mode in their .Ne",
      "*\nHad Meeting with NFCU Engineers (Ashish and Ashwairya).\n• NFCU is looking for dates for MVP features to their usecase primarily FDM, Render API, Basic Rules.\n• Informed them that by *May end* these ",
      "*\nMOM of today's call with GM\n• The 403 issue for the forms is resolved , it was related to allowing the edge domain in the referrer filters of publish. Now submission is getting processed to aem publ",
      "*\nTFS - Existing IC customer on AMS had connect with Arun during Summit, where they are interested in Cloud based IC, as part of moving to Cloud.\n• 30% of their usecase is PDF generation - No issues i",
      "Agree. This was an early pitch for Sales and we can recommend the same once they plan to move ahead. More details from the meeting:\n• Their forms had a requirement to generate *Document of Record* (cu",
      "Good use case, thanks for sharing in details.\nOptions:\n1. Ask them to move to xdp and get rid of Siesmic and use pdf for download which is better perhaps.. If they want the users to change the content",
      "I suspect this will be a long-ish engagement  - lets pls write use cases on doc/wiki. IIRC, there were 2 use cases - one where they are using 3rd party app for data capture and using output for pdf ge",
      "Yes, HDFC Bank had around 300 PDF which they wanted to convert and capture data via browser so we suggested them HTML Forms ( Mobile Forms)."
    ],
    "score": 1131
  },
  {
    "theme": "Reliability - bug",
    "primary_theme": "Reliability",
    "feature": "Forms",
    "category": "bug",
    "report_count": 25,
    "customer_count": 18,
    "avg_severity": 4,
    "last_seen_at": "2026-02-02T10:46:48.319Z",
    "evidence_signal_ids": [
      "0507c536-bd95-40dd-8cc3-c85581bf5ce4",
      "24c41b8f-8f6b-4b9b-a3ee-1527108b0126",
      "31bbf489-47e4-455b-97b4-c1d51152de55",
      "3c723601-da20-4aa5-b926-4faf413a5d31",
      "43df6021-1c59-4751-bdd5-636e558e93b0",
      "52d1e9a6-568f-40f5-a633-fb9b0b33a414",
      "6141312a-f327-421b-961f-ba7bde0d8959",
      "6e6b5eeb-9405-4df3-9c10-f1325cde2632",
      "84c4eba2-fe65-496d-95fb-68e4cb97bba6",
      "8f86cee3-2ff7-462c-a092-e4ac198b05e3",
      "974410f5-0495-40b1-9fcf-834bc5244ac7",
      "981f4454-81ab-40cc-a3eb-521060096eb0",
      "a29573d2-18bc-450c-bfc0-82949107f35e",
      "a5daafa1-39ec-484e-907d-9f774b3716bb",
      "bac75b61-49fe-4904-8aa9-f15555971eee",
      "c24def69-af81-4ce2-8817-d51e9d4fa8b5",
      "c30d408f-11f2-47c2-addd-e9f1b0e76d95",
      "d0a73358-ae47-45b3-805c-bbb73397842c",
      "ebe1464e-093a-42be-8f81-d793d3406e40",
      "ef1268f7-a61c-4ec7-82d7-61b904169c15",
      "fbaeeca9-1a3d-4392-aaaa-e7f156dc34f9",
      "ff8c46f2-ad32-4f59-a61a-26896d0c7309"
    ],
    "top_customers": [
      "Abbvie",
      "Bancolombia (Internal call - before connect with customer)",
      "Brunswick",
      "Carpenter",
      "Carpenter (4Point)"
    ],
    "summary_keywords": [
      "forms",
      "issue",
      "customer",
      "meeting",
      "issues",
      "discussed",
      "team",
      "generated"
    ],
    "evidence_snippets": [
      "*\n• *401/501 Errors:* Customer escalated the ticket and coordinating internally; Arneh investigated and raised API and middleware behavior causing cookies and login token conflicts. \n• *Unbound Fields",
      "*\n• *Form Integration Issues on Regional Pages:* Andy, Mayank, Speaker 1, and Christy discussed ongoing problems with embedding and displaying forms on the Australia and New Zealand regional pages, in",
      "*\n• *Login Token Issue:* Customer investigating source of login token in metadata calls and will raise it in the upcoming support call with Adobe.\n• *Unbound Fields &amp; Batch Conversion:* Engineerin",
      "*\n• *Overview of Adobe AEM Forms Value Proposition:* Melissa, Mark, and Jared from Adobe provided Sunil, Williams-VZ, Ani, Kiran, and the Verizon team with a comprehensive overview of the value propos",
      "*\n• Model bump and some other improvements radio button getting detected correctly and all options coming in for the radio buttons. \n    ◦ *Action item - Engineering team (changes have been done some ",
      "*\n• Workflow issue - Gaurav troubleshooted and found a bug in the CQ code from a recent change and provided a workaround for now to unblock the customer. Also raised the issue with the relevant team. ",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Naveen, Andy, Arun, and Arneh discussed the challenges and requirements related to versioning an",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Meeting Notes*\n• *Sprint Dashboard &amp; KPI Alignment*: Vijay presented a new dashboard for sprint tracking, focusing on outcome goals, bas",
      "*\n*Context:* \n• Forms ARR: $72.9K\n• Contractual Utilization: 18.9%\n• Multiple submit alerts - customer not reachable\n*Intent:*\n• Good opportunity for new feature adoption: Forms Exp. Builder, Forms op",
      "*\n*Discussion Summary*\n*Issues Faced:*\n1. *Redirection Issue:* NFCU is experiencing a problem where clicking the edit option in Document, FM does not redirect to the correct ORG.\n2. *Fragment Issue:* ",
      "*\n*INAIL*\n• *Inail Executive Meeting:* Emanuele shared that the executive meeting with Inail was successful, and the client is happy with the technologies being used. They discussed the progress and e",
      "*\n*Issues they reported:*\n    ◦ In order for this to work I need to add Access-Control-Allow-Origin header to <https://main--forms--ociostateofnebraska.aem.live/> which is fine, and I am able to do th",
      "*\nAnurag, Sudhanshu and Khushwant visited the Maruti factory on Friday. We went to the Innovation Gym first where the Adobe team sites (~ 6-8 team members sit in that office). Some quick notes/pointer",
      "*\nCodePA raised an issue that below issues were critical and blocking development of some of their new forms:\n1. Scribble signature with DoR + Accessibility fixes\n2. Delete operation for files in Shar",
      "*\nExisting AEM Forms JEE customer inherited from LiveCycle days, on-prem, ~178K product + 80K paid support renewal upcoming. Field team targeting as-is renewal for now.\n\nCustomer is exploring to imple",
      "*\nGenerated by AI.\nMeeting notes:\n• *Demo Overview:* Sudhanshu outlined the demo plan, which included three parts: translating a page while retaining form data, a code walkthrough of a sample submit a",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Database Integration and Networking Configuration:* Shraddha, Sakshi, Randy, and Chad Roberts discussed the technical re",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Server Connectivity and Regional Restrictions:* Sakshi, Randy Reisling, and Shraddha discussed ongoing issues with conne",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Bindings Issue:* Satya Deep and Raciel discussed the bindings issue, with Satya suggesting reimporting the form with a different n",
      "*\nPresenter: *Ken Woodward*\nProject Lead: *Andrei Bogdan*\n\n• Ken introduced Sites Optimizer - since some of the participants had not seen the UI earlier, and were not aware of the capabilities. It was",
      "*\nWe had a connect with 4Point for customer Carpenter to identify the issues they are facing with their could environment.\n• The environments were provisioned around April, and their pipeline is faili",
      "Just wondering if the problem can be with their code that results in submission failure then any customization for Save as draft code also may be prone to the failures (it seems they don't trust their"
    ],
    "score": 2700
  },
  {
    "theme": "Authoring UX - bug",
    "primary_theme": "Authoring UX",
    "feature": "Forms",
    "category": "bug",
    "report_count": 23,
    "customer_count": 16,
    "avg_severity": 4,
    "last_seen_at": "2026-02-02T10:46:19.246Z",
    "evidence_signal_ids": [
      "0507c536-bd95-40dd-8cc3-c85581bf5ce4",
      "24c41b8f-8f6b-4b9b-a3ee-1527108b0126",
      "31bbf489-47e4-455b-97b4-c1d51152de55",
      "3c723601-da20-4aa5-b926-4faf413a5d31",
      "4570aae9-4bd4-4a22-9b65-8222884ed26d",
      "497e79ae-f742-415e-89b6-b21790d7d353",
      "52d1e9a6-568f-40f5-a633-fb9b0b33a414",
      "6e6b5eeb-9405-4df3-9c10-f1325cde2632",
      "84c4eba2-fe65-496d-95fb-68e4cb97bba6",
      "8f86cee3-2ff7-462c-a092-e4ac198b05e3",
      "981f4454-81ab-40cc-a3eb-521060096eb0",
      "a29573d2-18bc-450c-bfc0-82949107f35e",
      "a5669b70-ed19-416b-a980-115693a788c0",
      "c24def69-af81-4ce2-8817-d51e9d4fa8b5",
      "c30d408f-11f2-47c2-addd-e9f1b0e76d95",
      "d0a73358-ae47-45b3-805c-bbb73397842c",
      "ebe1464e-093a-42be-8f81-d793d3406e40",
      "ef1268f7-a61c-4ec7-82d7-61b904169c15",
      "fbaeeca9-1a3d-4392-aaaa-e7f156dc34f9",
      "ff8c46f2-ad32-4f59-a61a-26896d0c7309"
    ],
    "top_customers": [
      "Abbott",
      "Bancolombia (Internal call - before connect with customer)",
      "Carpenter",
      "Carpenter (4Point)",
      "Cintas"
    ],
    "summary_keywords": [
      "issue",
      "customer",
      "forms",
      "generated",
      "notes",
      "issues",
      "adobe",
      "team"
    ],
    "evidence_snippets": [
      "*\n• *Login Token Issue:* Customer investigating source of login token in metadata calls and will raise it in the upcoming support call with Adobe.\n• *Unbound Fields &amp; Batch Conversion:* Engineerin",
      "*\n• *Overview of Adobe AEM Forms Value Proposition:* Melissa, Mark, and Jared from Adobe provided Sunil, Williams-VZ, Ani, Kiran, and the Verizon team with a comprehensive overview of the value propos",
      "*\n• Workflow issue - Gaurav troubleshooted and found a bug in the CQ code from a recent change and provided a workaround for now to unblock the customer. Also raised the issue with the relevant team. ",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Naveen, Andy, Arun, and Arneh discussed the challenges and requirements related to versioning an",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Meeting Notes*\n• *Sprint Dashboard &amp; KPI Alignment*: Vijay presented a new dashboard for sprint tracking, focusing on outcome goals, bas",
      "*\n*Context:* \n• Forms ARR: $72.9K\n• Contractual Utilization: 18.9%\n• Multiple submit alerts - customer not reachable\n*Intent:*\n• Good opportunity for new feature adoption: Forms Exp. Builder, Forms op",
      "*\n*Discussion Summary*\n*Issues Faced:*\n1. *Redirection Issue:* NFCU is experiencing a problem where clicking the edit option in Document, FM does not redirect to the correct ORG.\n2. *Fragment Issue:* ",
      "*\n*Issues they reported:*\n    ◦ In order for this to work I need to add Access-Control-Allow-Origin header to <https://main--forms--ociostateofnebraska.aem.live/> which is fine, and I am able to do th",
      "*\n*NFCU*: Sharmila, Sreedhar, Aishwarya\nCurrent Communication Journey (DSC) that is live is a failover letter generation capability where a scheduled batch is run twice a day which picks up the failed",
      "*\nAbbott is encountering multiple conversion issues, as detailed in <https://wiki.corp.adobe.com/display/lc/PDF+Generator+Support+for+Office+2021+and+Acrobat+DC|this wiki page>\n, during their environm",
      "*\nAnurag, Sudhanshu and Khushwant visited the Maruti factory on Friday. We went to the Innovation Gym first where the Adobe team sites (~ 6-8 team members sit in that office). Some quick notes/pointer",
      "*\nCodePA raised an issue that below issues were critical and blocking development of some of their new forms:\n1. Scribble signature with DoR + Accessibility fixes\n2. Delete operation for files in Shar",
      "*\nCustomer's Requirements:\n\nThe customer shared an automation process flow for their Policy Exception (PE) form, outlining the steps involved when a submitter submits a form. They wanted us to create ",
      "*\nExisting AEM Forms JEE customer inherited from LiveCycle days, on-prem, ~178K product + 80K paid support renewal upcoming. Field team targeting as-is renewal for now.\n\nCustomer is exploring to imple",
      "*\nGenerated by AI.\nMeeting notes:\n• *Demo Overview:* Sudhanshu outlined the demo plan, which included three parts: translating a page while retaining form data, a code walkthrough of a sample submit a",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Database Integration and Networking Configuration:* Shraddha, Sakshi, Randy, and Chad Roberts discussed the technical re",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Server Connectivity and Regional Restrictions:* Sakshi, Randy Reisling, and Shraddha discussed ongoing issues with conne",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Bindings Issue:* Satya Deep and Raciel discussed the bindings issue, with Satya suggesting reimporting the form with a different n",
      "*\nPresenter: *Ken Woodward*\nProject Lead: *Andrei Bogdan*\n\n• Ken introduced Sites Optimizer - since some of the participants had not seen the UI earlier, and were not aware of the capabilities. It was",
      "*\nWe had a connect with 4Point for customer Carpenter to identify the issues they are facing with their could environment.\n• The environments were provisioned around April, and their pipeline is faili"
    ],
    "score": 2208
  },
  {
    "theme": "Authoring UX - request",
    "primary_theme": "Authoring UX",
    "feature": "Data Binding",
    "category": "request",
    "report_count": 20,
    "customer_count": 11,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:46.952Z",
    "evidence_signal_ids": [
      "0ab17f16-0541-4ae3-94f1-cba7efaec76f",
      "13a337b0-6143-4d0d-b7a4-14cb393a6503",
      "1729cc54-2893-44ef-b487-66b1bca67fa5",
      "1cd08c2a-b46f-4273-a989-d45804bfd4ae",
      "330d1738-55b8-4c0b-86b9-881d18a24d9d",
      "35e210d5-fda2-46b5-9d58-200fb4db8d09",
      "535dba0c-ec81-46f1-9020-35fbd99b58ec",
      "568c235e-f84a-4ef1-94b9-a05a59a0448b",
      "62846e6e-5a50-4ba3-b895-42d9d87674c5",
      "77e635a2-13d6-48fd-8f13-52077ed0e2d5",
      "86121a51-20d1-4818-8237-bcb96f1cbe68",
      "8f1c9649-c6a1-4652-a0ef-d9d3a3d5ec42",
      "96ad4f6a-adab-4274-9c4d-2b8532c2d30e",
      "9c0466c4-bab2-4210-9f29-e71d11a9a1f2",
      "b32b4ab5-bdef-4190-88d9-138238c31169",
      "d7704f37-98be-4f08-b6a8-b324bb10f0a0",
      "ff3de2a2-1fbb-47e0-995e-19bc506e600d"
    ],
    "top_customers": [
      "Brightline",
      "GM Financial",
      "IRS (DMAF account)",
      "KBC / Amexio",
      "Lenovo ( Internal)"
    ],
    "summary_keywords": [
      "meeting",
      "forms",
      "need",
      "customer",
      "data",
      "current",
      "discussed",
      "summary"
    ],
    "evidence_snippets": [
      "*\n• *PDF Conversion and Sync Code:* Mayank and Andy discussed the recent fixes and updates related to PDF conversion, including the need to keep the browser open during the process. Mayank mentioned t",
      "*\n• Customer acknowledged the timelines shared by Sunny for the requirements.\n• Customer was provided a demo for the pre-filling of the realtime data from FDM while invoking render PDF IC.\n• Team shar",
      "*\n• Internal meeting - after Emily connected with Accenture Federal\n• They shared an update that they have ~ 200 forms to be modernised, the actual forms are yet to be finalized\n• They want to identif",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Arun, Ajani, and Mayank discussed the Lenovo use cases, focusing on progressive profiling, globa",
      "*\n*Below is the meeting summary:*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n",
      "*\n*Customer Summary: GMF*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n• Curren",
      "*\n*Dynamic Client Letter Generation Use Case:* Naveen Sharma described the need to generate dynamic client letters reflecting account changes, and discussed with Chris how Adobe tools could support a ",
      "*\n*Meeting Summary – Verizon Discussion on Document Generation and AEM Capabilities*\n\n*Current Vendor Landscape and Business Need*\n• *Verizon* is currently operating as an on-premise site customer.\n• ",
      "*\n*Meeting Summary*\nWe had a productive discussion regarding the issues NFCU is facing and their use cases. Below are the key discussion points:\n1. *Data Binding Workflow:*\n    ◦ Provided a detailed e",
      "*\n*Meeting Summary* – NFCU Requirements Review\n\nNFCU has shared an Excel sheet outlining their requirements and identifying gaps in the current Interactive Communication (IC) Editor. The we have revie",
      "*\n*Q2’25 (opportunity)*\n*SunPharma side - Sr Director (IT)* \nAdobe side - Solution COnsulting team - Chinmay and Navin\n*Partner - Depth (may be)*\n*Metrics:* \n• *100+ forms*\n• *20-30k submissions per y",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Adaptive Forms Creation:* Ellen explained the process of creating adaptive forms, highlighting the need to support multiple langua",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Current Forms Environment and Integration Challenges:* Tony J Fenner, Stephen, Brad R Tuckner, and John described the current form",
      "*\nIn the meeting, we provided a comprehensive walkthrough of the newly introduced features and discussed each in detail. The key features covered include:\n• Template creation workflow\n• Fragments &amp",
      "*\nSession was to cover:\n• Access to Cloud instance (pending access from last meeting). We would be working on the Dev instance.\n• They want to create CC based forms - discussed if they want to have st",
      "I have clarified the requirements with NFCU regarding their intended use of JSON schema. They have confirmed that their use case specifically involves utilizing their own JSON schema for data binding.",
      "Thanks <@WE163TH43>, Agree need more simplification or segregation here between the 2 binding approaches.\n&gt; Identified the need for improved UX to show different data binding options for text boxes"
    ],
    "score": 660
  },
  {
    "theme": "Rendering & PDF - request",
    "primary_theme": "Rendering & PDF",
    "feature": "Data Binding",
    "category": "request",
    "report_count": 19,
    "customer_count": 10,
    "avg_severity": 2,
    "last_seen_at": "2026-02-02T10:46:37.372Z",
    "evidence_signal_ids": [
      "13a337b0-6143-4d0d-b7a4-14cb393a6503",
      "1729cc54-2893-44ef-b487-66b1bca67fa5",
      "1cd08c2a-b46f-4273-a989-d45804bfd4ae",
      "330d1738-55b8-4c0b-86b9-881d18a24d9d",
      "35e210d5-fda2-46b5-9d58-200fb4db8d09",
      "535dba0c-ec81-46f1-9020-35fbd99b58ec",
      "568c235e-f84a-4ef1-94b9-a05a59a0448b",
      "62846e6e-5a50-4ba3-b895-42d9d87674c5",
      "77e635a2-13d6-48fd-8f13-52077ed0e2d5",
      "86121a51-20d1-4818-8237-bcb96f1cbe68",
      "8f1c9649-c6a1-4652-a0ef-d9d3a3d5ec42",
      "9c0466c4-bab2-4210-9f29-e71d11a9a1f2",
      "b32b4ab5-bdef-4190-88d9-138238c31169",
      "bd1243fd-0607-4301-adda-4c0a40dbb93c",
      "d7704f37-98be-4f08-b6a8-b324bb10f0a0",
      "e202eea5-7a3d-4c3c-a76f-edcd24b140c5"
    ],
    "top_customers": [
      "GM Financial",
      "IRS (DMAF account)",
      "IRS Meeting",
      "KBC / Amexio",
      "LPL financial"
    ],
    "summary_keywords": [
      "meeting",
      "customer",
      "data",
      "forms",
      "current",
      "their",
      "summary",
      "json"
    ],
    "evidence_snippets": [
      "*\n• *PDF Conversion and Sync Code:* Mayank and Andy discussed the recent fixes and updates related to PDF conversion, including the need to keep the browser open during the process. Mayank mentioned t",
      "*\n• Customer acknowledged the timelines shared by Sunny for the requirements.\n• Customer was provided a demo for the pre-filling of the realtime data from FDM while invoking render PDF IC.\n• Team shar",
      "*\n• Internal meeting - after Emily connected with Accenture Federal\n• They shared an update that they have ~ 200 forms to be modernised, the actual forms are yet to be finalized\n• They want to identif",
      "*\n*Below is the meeting summary:*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n",
      "*\n*Customer Summary: GMF*\n\n*Use Case:*\nGMF aims to create templates, documents, and fragments, and generate print-ready PDFs using data in XML or JSON formats.\n\n*Customer's Current Workflow:*\n• Curren",
      "*\n*Dynamic Client Letter Generation Use Case:* Naveen Sharma described the need to generate dynamic client letters reflecting account changes, and discussed with Chris how Adobe tools could support a ",
      "*\n*Meeting notes (AI generated)*\n\n*Custom File Attachment Component Demo*: Shivam and Pankaj demonstrated the custom file attachment component, explaining its functionality and how it uploads files di",
      "*\n*Meeting Summary – Verizon Discussion on Document Generation and AEM Capabilities*\n\n*Current Vendor Landscape and Business Need*\n• *Verizon* is currently operating as an on-premise site customer.\n• ",
      "*\n*Meeting Summary*\nWe had a productive discussion regarding the issues NFCU is facing and their use cases. Below are the key discussion points:\n1. *Data Binding Workflow:*\n    ◦ Provided a detailed e",
      "*\n*Meeting Summary* – NFCU Requirements Review\n\nNFCU has shared an Excel sheet outlining their requirements and identifying gaps in the current Interactive Communication (IC) Editor. The we have revie",
      "*\n*Q2’25 (opportunity)*\n*SunPharma side - Sr Director (IT)* \nAdobe side - Solution COnsulting team - Chinmay and Navin\n*Partner - Depth (may be)*\n*Metrics:* \n• *100+ forms*\n• *20-30k submissions per y",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Adaptive Forms Creation:* Ellen explained the process of creating adaptive forms, highlighting the need to support multiple langua",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Current Forms Environment and Integration Challenges:* Tony J Fenner, Stephen, Brad R Tuckner, and John described the current form",
      "*\nIn the meeting, we provided a comprehensive walkthrough of the newly introduced features and discussed each in detail. The key features covered include:\n• Template creation workflow\n• Fragments &amp",
      "As per the discussion they are writing their own servelet from where they want to call IC render api with json data.\nI don't think they want to configure prefill via fdm.",
      "I have clarified the requirements with NFCU regarding their intended use of JSON schema. They have confirmed that their use case specifically involves utilizing their own JSON schema for data binding."
    ],
    "score": 570
  },
  {
    "theme": "Rendering & PDF - bug",
    "primary_theme": "Rendering & PDF",
    "feature": "Forms",
    "category": "bug",
    "report_count": 19,
    "customer_count": 11,
    "avg_severity": 4,
    "last_seen_at": "2026-02-02T10:46:19.036Z",
    "evidence_signal_ids": [
      "0507c536-bd95-40dd-8cc3-c85581bf5ce4",
      "24c41b8f-8f6b-4b9b-a3ee-1527108b0126",
      "3c723601-da20-4aa5-b926-4faf413a5d31",
      "43df6021-1c59-4751-bdd5-636e558e93b0",
      "4570aae9-4bd4-4a22-9b65-8222884ed26d",
      "497e79ae-f742-415e-89b6-b21790d7d353",
      "6141312a-f327-421b-961f-ba7bde0d8959",
      "84c4eba2-fe65-496d-95fb-68e4cb97bba6",
      "8f86cee3-2ff7-462c-a092-e4ac198b05e3",
      "a29573d2-18bc-450c-bfc0-82949107f35e",
      "c24def69-af81-4ce2-8817-d51e9d4fa8b5",
      "c30d408f-11f2-47c2-addd-e9f1b0e76d95",
      "ebe1464e-093a-42be-8f81-d793d3406e40",
      "ef1268f7-a61c-4ec7-82d7-61b904169c15"
    ],
    "top_customers": [
      "Abbott",
      "Bancolombia (Internal call - before connect with customer)",
      "Carpenter",
      "INAIL",
      "INPS"
    ],
    "summary_keywords": [
      "issue",
      "customer",
      "forms",
      "meeting",
      "generated",
      "discussed",
      "issues",
      "support"
    ],
    "evidence_snippets": [
      "*\n• *Login Token Issue:* Customer investigating source of login token in metadata calls and will raise it in the upcoming support call with Adobe.\n• *Unbound Fields &amp; Batch Conversion:* Engineerin",
      "*\n• Model bump and some other improvements radio button getting detected correctly and all options coming in for the radio buttons. \n    ◦ *Action item - Engineering team (changes have been done some ",
      "*\n• Workflow issue - Gaurav troubleshooted and found a bug in the CQ code from a recent change and provided a workaround for now to unblock the customer. Also raised the issue with the relevant team. ",
      "*\n_AI-generated content. Make sure to check for accuracy._\n*Key Topics:*\n• *Introduction:* Vijay Kumar, Naveen, Andy, Arun, and Arneh discussed the challenges and requirements related to versioning an",
      "*\n*Context:* \n• Forms ARR: $72.9K\n• Contractual Utilization: 18.9%\n• Multiple submit alerts - customer not reachable\n*Intent:*\n• Good opportunity for new feature adoption: Forms Exp. Builder, Forms op",
      "*\n*Discussion Summary*\n*Issues Faced:*\n1. *Redirection Issue:* NFCU is experiencing a problem where clicking the edit option in Document, FM does not redirect to the correct ORG.\n2. *Fragment Issue:* ",
      "*\n*INAIL*\n• *Inail Executive Meeting:* Emanuele shared that the executive meeting with Inail was successful, and the client is happy with the technologies being used. They discussed the progress and e",
      "*\n*NFCU*: Sharmila, Sreedhar, Aishwarya\nCurrent Communication Journey (DSC) that is live is a failover letter generation capability where a scheduled batch is run twice a day which picks up the failed",
      "*\nAbbott is encountering multiple conversion issues, as detailed in <https://wiki.corp.adobe.com/display/lc/PDF+Generator+Support+for+Office+2021+and+Acrobat+DC|this wiki page>\n, during their environm",
      "*\nCodePA raised an issue that below issues were critical and blocking development of some of their new forms:\n1. Scribble signature with DoR + Accessibility fixes\n2. Delete operation for files in Shar",
      "*\nExisting AEM Forms JEE customer inherited from LiveCycle days, on-prem, ~178K product + 80K paid support renewal upcoming. Field team targeting as-is renewal for now.\n\nCustomer is exploring to imple",
      "*\nGenerated by AI.\nMeeting notes:\n• *Demo Overview:* Sudhanshu outlined the demo plan, which included three parts: translating a page while retaining form data, a code walkthrough of a sample submit a",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Azure SQL Server Connectivity and Regional Restrictions:* Sakshi, Randy Reisling, and Shraddha discussed ongoing issues with conne",
      "*\nGenerated by AI. Make sure to check for accuracy.\nMeeting notes:\n• *Bindings Issue:* Satya Deep and Raciel discussed the bindings issue, with Satya suggesting reimporting the form with a different n"
    ],
    "score": 1254
  }
]
